{
  "title": "GDPR_CHAPTER_X_Delegated_acts_and_implementing_acts",
  "all_text": "CHAPTER X\n\nDelegated acts and implementing acts\n\nArticle 92\n\nExercise of the delegation\n\nThe power to adopt delegated acts is conferred on the Commission\n\n1. subject to the conditions laid down in this Article.\n\n2. The delegation of power referred to in Article 12(8) andArticle 43(8) shall be conferred on the Commission for an indeterminateperiod of time from 24 May 2016.\n\n3. The delegation of power referred to in Article 12(8) andArticle 43(8) may be revoked at any time by the European Parliamentor by the Council. A decision of revocation shall put an end to thedelegation of power specified in that decision. It shall take effect theday following that of its publication in the Official Journal of theEuropean Union or at a later date specified therein. It shall not affectthe validity of any delegated acts already in force.\n\n4. As soon as it adopts a delegated act, the Commission shall notifyit simultaneously to the European Parliament and to the Council.\n\n5. A delegated act adopted pursuant to Article 12(8) and Article 43(8) shall enter into force only if no objection has been expressed by eitherthe European Parliament or the Council withina period of three monthsof notification of that act to the European Parliament and the Council orif, before the expiry of that period, the European Parliament and theCouncil have both informed the Commission that they will not object. That period shall be extended by three months at the initiative of theEuropean Parliament or of the Council.\n\nArticle 93\n\nCommittee procedure\n\nThe Commission shall be assisted by a committee. That committeethe meaning of Regulation (EU)\n\n1. shall be a committee withinNo 182/2011.\n\n2. Where reference is made to this paragraph, Article 5 of Regulation (EU) No 182/2011 shall apply.\n\n3. Where reference is made to this paragraph, Article 8 of Regulation (EU) No 182/2011, in conjunction with Article 5 thereof, shallapply."
}