{
  "title": "GDPR_CHAPTER_IV_Controller_and_processor",
  "all_text": "CHAPTER IV\n\nController and processor\n\nS e c t i o n 1\n\nG e n e r a l o b l i g a t i o n s\n\nArticle 24\n\nResponsibility of the controller\n\nTaking into account the nature, scope, context and purposes of 1. processing as well as the risks of varying likelihood and severity for therights and freedoms of natural persons, the controller shall implementappropriate technical and organisational measures to ensure and to beable to demonstrate that processing is performed in accordance with thisRegulation. Those measures shall be reviewed and updated wherenecessary.\n\n02016R0679 — EN — 04.05.2016 — 000.002 — 23\n\n▼B\n\n2. Where proportionate in relation to processing activities, themeasures referred to in paragraph 1 shall include the implementationof appropriate data protection policies by the controller.\n\n3. Adherence to approved codes of conduct as referred to inArticle 40 or approved certification mechanisms as referred to inArticle 42 may be used as an element by which to demonstratecompliance with the obligations of the controller.\n\nArticle 25\n\nData protection by design and by default\n\n1. Taking into account the state of the art, the cost of implementationand the nature, scope, context and purposes of processing as well as therisks of varying likelihood and severity for rights and freedoms ofnatural persons posed by the processing, the controller shall, both atthe time of the determination of the means for processing and at thetime of the processing itself, implement appropriate technical andorganisational measures, such as pseudonymisation, which aredesigned to implement data-protection principles, such as data minimisation, in an effective manner and to integrate the necessary safeguardsinto the processing in order to meet the requirements of this Regulationand protect the rights of data subjects.\n\n2. The controller shall implement appropriate technical and organisational measures for ensuring that, by default, only personal data whichare necessary for each specific purpose of the processing are processed. That obligation applies to the amount of personal data collected, theextent of their processing, the period of their storage and their accessibility. In particular, such measures shall ensure that by default personaldata are not made accessible without the individual's intervention to anindefinite number of natural persons.\n\n3. An approved certification mechanism pursuant to Article 42 maybe used as an element to demonstrate compliance with the requirementsset out in paragraphs 1 and 2 of this Article.\n\nArticle 26\n\nJoint controllers\n\n1. Where two or more controllers jointly determine the purposes andmeans of processing, they shall be joint controllers. They shall in atransparent manner determinetheir respective responsibilities forcompliance with the obligations under this Regulation, in particular asregards the exercising of the rights of the data subject and theirrespective duties to provide the information referred to in Articles 13 and 14, by means of an arrangement between them unless, and in so faras, the respective responsibilities of the controllers are determined byUnion or Member State law to which the controllers are subject. Thearrangement may designate a contact point for data subjects.\n\n02016R0679 — EN — 04.05.2016 — 000.002 — 24\n\n▼B\n\n2. The arrangement referred to in paragraph 1 shall duly reflect therespective roles and relationships of the joint controllers vis-à-vis thedata subjects. The essence of the arrangement shall be made available tothe data subject.\n\n3. Irrespective of the terms of the arrangement referred to inparagraph 1, the data subject may exercise his or her rights under thisRegulation in respect of and against each of the controllers.\n\nArticle 27\n\nRepresentatives of controllers or processors not established in theUnion\n\n1. Where Article 3(2) applies, the controller or the processor shalldesignate in writing a representative in the Union.\n\nThe obligation laid down in paragraph 1 of this Article shall not\n\n2. apply to:\n\n(a) processing which is occasional, does not include, on a large scale, processing of special categories of data as referred to in Article 9(1) or processing of personal data relating to criminal convictions andoffences referred to in Article 10, and is unlikely to result in a riskto the rights and freedoms of natural persons, taking into accountthe nature, context, scope and purposes of the processing; or\n\n(b) a public authority or body.\n\n3. The representative shall be established in one of the MemberStates where the data subjects, whose personal data are processed inrelation to the offering of goods or services to them, or whose behaviouris monitored, are.\n\nThe representative shall be mandated by\n\n4. the controller orprocessor to be addressed in addition to or instead of the controller orthe processor by, in particular, supervisory authorities and data subjects, on all issues related to processing, for the purposes of ensuringcompliance with this Regulation.\n\n5. The designation of a representative by the controller or processorshall be without prejudice to legal actions which could be initiatedagainst the controller or the processor themselves.\n\nArticle 28\n\nProcessor\n\n1. Where processing is to be carried out on behalf of a controller, thecontroller shall use only processors providing sufficient guarantees toimplement appropriate technical and organisational measures in such amanner that processing will meet the requirements of this Regulationand ensure the protection of the rights of the data subject.\n\n02016R0679 — EN — 04.05.2016 — 000.002 — 25\n\n▼B\n\n2. The processor shall not engage another processor without priorspecific or general written authorisation of the controller. In the caseof general written authorisation, the processor shall inform the controllerof any intended changes concerning the addition or replacement of otherprocessors, thereby giving the controller the opportunity to object tosuch changes.\n\n3. Processing by a processor shall be governed by a contract or otherlegal act under Union or Member State law, that is binding on theprocessor with regardthesubject-matter and duration of the processing, the nature and purposeof the processing, the type of personal data and categories of datasubjects and the obligations and rights of the controller. That contractor other legal act shall stipulate, in particular, that the processor:\n\nthe controller and\n\nthat sets out\n\nto\n\n(a) processes the personal data only on documented instructions fromthe controller, including with regard to transfers of personal data toa third country or an international organisation, unless required todo so by Union or Member State law to which the processor issubject; in such a case, the processor shall inform the controller ofthat legal requirement before processing, unless that law prohibitssuch information on important grounds of public interest;\n\n(b) ensures that persons authorised to process the personal data havecommitted themselves to confidentiality or are under an appropriatestatutory obligation of confidentiality;\n\n(c) takes all measures required pursuant to Article 32;\n\n(d) respects the conditions referred to in paragraphs 2 and 4 for\n\nengaging another processor;\n\n(e) taking into account the nature of the processing, assists thecontroller by appropriate technical and organisational measures, insofar as this is possible, for the fulfilment of the controller'sobligation to respond to requests for exercising the data subject'srights laid down in Chapter III;\n\n(f) assists the controller in ensuring compliance with the obligationspursuant to Articles 32 to 36 taking into account the nature ofprocessing and the information available to the processor;\n\n(g) at the choice of the controller, deletes or returns all the personaldata to the controller after the end of the provision of servicesrelating to processing, and deletes existing copies unless Union orMember State law requires storage of the personal data;\n\n(h) makes available to the controller all information necessary todemonstrate compliance with the obligations laid down in thisArticle and allow for and contribute to audits, including inspections, conducted by the controller or another auditor mandated by thecontroller.\n\n02016R0679 — EN — 04.05.2016 — 000.002 — 26\n\n▼B\n\nWith regard to point (h) of the first subparagraph, the processor shallimmediately inform the controller if, in its opinion, an instructioninfringes this Regulation or other Union or Member State dataprotection provisions.\n\n4. Where a processor engages another processor for carrying outspecific processing activities on behalf of the controller, the same dataprotection obligations as set out in the contract or other legal actbetween the controller and the processor as referred to in paragraph 3 shall be imposed on that other processor by way of a contract or otherlegal act under Union or Member State law, in particular providingsufficient guarantees to implement appropriate technical and organisational measures in such a manner that the processing will meet therequirements of this Regulation. Where that other processor fails tofulfil its data protection obligations, the initial processor shall remainfully liable to the controller for the performance of that other processor'sobligations.\n\n5. Adherence of a processor to an approved code of conduct asreferred to in Article 40 or an approved certification mechanism asreferred to in Article 42 may be used as an element by which todemonstrate sufficient guarantees as referred to in paragraphs 1 and 4 of this Article.\n\n6. Without prejudice to an individual contract between the controllerand the processor, the contract or the other legal act referred to inparagraphs 3 and 4 of this Article may be based, in whole or in part, on standard contractual clauses referred to in paragraphs 7 and 8 of thisArticle, including when they are part of a certification granted to thecontroller or processor pursuant to Articles 42 and 43.\n\n7. The Commission may lay down standard contractual clauses forthe matters referred to in paragraph 3 and 4 of this Article and inaccordance with the examination procedure referred to in Article 93(2).\n\n8. A supervisory authority may adopt standard contractual clauses forthe matters referred to in paragraph 3 and 4 of this Article and inaccordance with the consistency mechanism referred to in Article 63.\n\nThe contract or the other legal act referred to in paragraphs 3 and\n\n9. 4 shall be in writing, including in electronic form.\n\n10. Without prejudice to Articles 82, 83 and 84, if a processorinfringes this Regulation by determining the purposes and means ofprocessing, the processor shall be considered to be a controller inrespect of that processing.\n\n02016R0679 — EN — 04.05.2016 — 000.002 — 27\n\n▼B\n\nProcessing under the authority of the controller or processor\n\nArticle 29\n\nThe processor and any person acting under the authority of thecontroller or of the processor, who has access to personal data, shallnot process those data except on instructions from the controller, unlessrequired to do so by Union or Member State law.\n\nArticle 30\n\nRecords of processing activities\n\n1. Each controller and, where applicable, the controller's representative, shall maintain a record of processing activities under its responsibility. That record shall contain all of the following information:\n\n(a) the name and contact details of the controller and, where applicable, the joint controller, the controller's representative and the dataprotection officer;\n\n(b) the purposes of the processing;\n\n(c) a description of the categories of data subjects and of the categories\n\nof personal data;\n\n(d) the categories of recipients to whom the personal data have been orwill be disclosed including recipients in third countries or international organisations;\n\n(e) where applicable, transfers of personal data to a third country or aninternational organisation, including the identification of that thirdcountry or international organisation and, in the case of transfersreferred to in the second subparagraph of Article 49(1), the documentation of suitable safeguards;\n\n(f) where possible, the envisaged time limits for erasure of the different\n\ncategories of data;\n\n(g) where possible, a general description of the technical and organisa\n\ntional security measures referred to in Article 32(1).\n\n2. Each processor and, where applicable, the processor's representative shall maintain a record of all categories of processing activitiescarried out on behalf of a controller, containing:\n\n(a) the name and contact details of the processor or processors and ofeach controller on behalf of which the processor is acting, and, where applicable, of the controller's or the processor's representative, and the data protection officer;\n\n(b) the categories of processing carried out on behalf of each controller;\n\n(c) where applicable, transfers of personal data to a third country or aninternational organisation, including the identification of that thirdcountry or international organisation and, in the case of transfersreferred to in the second subparagraph of Article 49(1), the documentation of suitable safeguards;\n\n02016R0679 — EN — 04.05.2016 — 000.002 — 28\n\n▼B\n\n(d) where possible, a general description of the technical and organisa\n\ntional security measures referred to in Article 32(1).\n\nThe records referred to in paragraphs 1 and 2 shall be in writing,\n\n3. including in electronic form.\n\n4. The controller or the processor and, where applicable, thecontroller's or the processor's representative, shall make the recordavailable to the supervisory authority on request.\n\n5. The obligations referred to in paragraphs 1 and 2 shall not applyto an enterprise or an organisation employing fewer than 250 personsunless the processing it carries out is likely to result in a risk to therights and freedoms of data subjects, the processing is not occasional, orthe processing includes special categories of data as referred to inArticle 9(1) or personal data relating to criminal convictions andoffences referred to in Article 10.\n\nArticle 31\n\nCooperation with the supervisory authority\n\nThe controller and the processor and, where applicable, their representatives, shall cooperate, on request, with the supervisory authority in theperformance of its tasks.\n\nS e c t i o n 2\n\nS e c u r i t y o f p e r s o n a l d a t a\n\nArticle 32\n\nSecurity of processing\n\n1. Taking into account the state of the art, the costs of implementation and the nature, scope, context and purposes of processing as wellas the risk of varying likelihood and severity for the rights and freedomsof natural persons, the controller and the processor shall implementappropriate technical and organisational measures to ensure a level ofsecurity appropriate to the risk, including inter alia as appropriate:\n\n(a) the pseudonymisation and encryption of personal data;\n\n(b) the ability to ensure the ongoing confidentiality, integrity, availabil\n\nity and resilience of processing systems and services;\n\n(c) the ability to restore the availability and access to personal data in atimely manner in the event of a physical or technical incident;\n\n(d) a process for regularly testing, assessing and evaluating the effectiveness of technical and organisational measures for ensuring thesecurity of the processing.\n\n▼B\n\n02016R0679 — EN — 04.05.2016 — 000.002 — 29\n\n2. In assessing the appropriate level of security account shall betaken in particular of the risks that are presented by processing, inparticular from accidental or unlawful destruction, loss, alteration, unauthorised disclosure of, or access to personal data transmitted, stored or otherwise processed.\n\n3. Adherence to an approved code of conduct as referred to inArticle 40 or an approved certification mechanism as referred to inArticle 42 may be used as an element by which to demonstratecompliance with the requirements set out in paragraph 1 of this Article.\n\n4. The controller and processor shall take steps to ensure that anynatural person acting under the authority of the controller or theprocessor who has access to personal data does not process themexcept on instructions from the controller, unless he or she is requiredto do so by Union or Member State law.\n\nArticle 33\n\nNotification of a personal data breach to the supervisory authority\n\n1. In the case of a personal data breach, the controller shall withoutundue delay and, where feasible, not later than 72 hours after havingbecome aware of it, notify the personal data breach to the supervisoryauthority competent in accordance with Article 55, unless the personaldata breach is unlikely to result in a risk to the rights and freedoms ofnatural persons. Where the notification to the supervisory authority isnot made within 72 hours, it shall be accompanied by reasons for thedelay.\n\nThe processor shall notify the controller without undue delay after\n\n2. becoming aware of a personal data breach.\n\n3.\n\nThe notification referred to in paragraph 1 shall at least:\n\n(a) describe the nature of the personal data breach including wherepossible, the categories and approximate number of data subjectsconcerned and the categories and approximate number of personaldata records concerned;\n\n(b) communicate the name and contact details of the data protectionofficer or other contact point where more information can beobtained;\n\n(c) describe the likely consequences of the personal data breach;\n\n(d) describe the measures taken or proposed to be taken by thecontroller to address the personal data breach, including, whereappropriate, measures to mitigate its possible adverse effects.\n\n4. Where, and in so far as, it is not possible to provide theinformation at the same time, the information may be provided inphases without undue further delay.\n\n02016R0679 — EN — 04.05.2016 — 000.002 — 30\n\n▼B\n\n5. The controller shall document any personal data breaches, comprising the facts relating to the personal data breach, its effectsand the remedial action taken. That documentation shall enable thesupervisory authority to verify compliance with this Article.\n\nCommunication of a personal data breach to the data subject\n\nArticle 34\n\n1. When the personal data breach is likely to result in a high risk tothe rights and freedoms of natural persons, the controller shallcommunicate the personal data breach to the data subject withoutundue delay.\n\nThe communication to the data subject referred to in paragraph 12. of this Article shall describe in clear and plain language the nature ofthe personal data breach and contain at least the information andmeasures referred to in points (b), (c) and (d) of Article 33(3).\n\nThe communication to the data subject referred to in paragraph 1\n\n3. shall not be required if any of the following conditions are met:\n\n(a) the controller has implemented appropriate technical and organisational protection measures, and those measures were applied to thepersonal data affected by the personal data breach, in particularthose that render the personal data unintelligible to any personwho is not authorised to access it, such as encryption;\n\n(b) the controller has taken subsequent measures which ensure that thehigh risk to the rights and freedoms of data subjects referred to inparagraph 1 is no longer likely to materialise;\n\n(c) it would involve disproportionate effort. In such a case, there shallinstead be a public communication or similar measure whereby thedata subjects are informed in an equally effective manner.\n\nIf the controller has not already communicated the personal data 4. breach to the data subject, the supervisory authority, having consideredthe likelihood of the personal data breach resulting in a high risk, mayrequire it to do so or may decide that any of the conditions referred toin paragraph 3 are met.\n\nS e c t i o n 3\n\nD a t a p r o t e c t i o n\n\ni m p a c t a s s e s s m e n t a n d p r i o rc o n s u l t a t i o n\n\nArticle 35\n\nData protection impact assessment\n\n1. Where a type of processing in particular using new technologies, and taking into account the nature, scope, context and purposes of theprocessing, is likely to result in a high risk to the rights and freedoms of\n\n▼B\n\n02016R0679 — EN — 04.05.2016 — 000.002 — 31\n\nnatural persons, the controller shall, prior to the processing, carry out anassessment of the impact of the envisaged processing operations on theprotection of personal data. A single assessment may address a set ofsimilar processing operations that present similar high risks.\n\nThe controller shall seek the advice of the data protection officer, impact\n\n2. where designated, when carrying out a data protectionassessment.\n\n3. A data protection impact assessment referred to in paragraph 1 shall in particular be required in the case of:\n\n(a) a systematic and extensive evaluation of personal aspects relating tonatural persons which is based on automated processing, includingprofiling, and on which decisions are based that produce legaleffects concerning the natural person or similarly significantlyaffect the natural person;\n\n(b) processing on a large scale of special categories of data referred toin Article 9(1), or of personal data relating to criminal convictionsand offences referred to in Article 10; or\n\n(c) a systematic monitoring of a publicly accessible area on a large\n\nscale.\n\n4. The supervisory authority shall establish and make public a list ofthe kind of processing operations which are subject to the requirementfor a data protection impact assessment pursuant to paragraph 1. Thesupervisory authority shall communicate those lists to the Board referredto in Article 68.\n\n5. The supervisory authority may also establish and make public alist of the kind of processing operations for which no data protectionrequired. The supervisory authority shallimpact assessmentcommunicate those lists to the Board.\n\nis\n\nPrior to the adoption of the lists referred to in paragraphs 4 and 5, 6. the consistencythe competent supervisory authority shall applymechanism referred to in Article 63 where such lists involve processingactivities which are related to the offering of goods or services to datasubjects orin severalMember States, or may substantially affect the free movement ofpersonal data within the Union.\n\nthe monitoring of\n\ntheir behaviour\n\nto\n\n7.\n\nThe assessment shall contain at least:\n\n(a) a systematic description of the envisaged processing operations andthe purposes of the processing, including, where applicable, thelegitimate interest pursued by the controller;\n\n(b) an assessment of the necessity and proportionality of the processing\n\noperations in relation to the purposes;\n\n(c) an assessment of the risks to the rights and freedoms of data\n\nsubjects referred to in paragraph 1; and\n\n(d) the measures envisaged to address the risks, including safeguards, security measures and mechanisms to ensure the protection ofpersonal data and to demonstrate compliance with this Regulationtaking into account the rights and legitimate interests of datasubjects and other persons concerned.\n\n02016R0679 — EN — 04.05.2016 — 000.002 — 32\n\n▼B\n\n8. Compliance with approved codes of conduct referred to inArticle 40 by the relevant controllers or processors shall be taken intodue account in assessing the impact of the processing operationsperformed by such controllers or processors, in particular for thepurposes of a data protection impact assessment.\n\n9. Where appropriate, the controller shall seek the views of datasubjects or their representatives on the intended processing, withoutprejudice to the protection of commercial or public interests or thesecurity of processing operations.\n\n10. Where processing pursuant to point (c) or (e) of Article 6(1) hasa legal basis in Union law or in the law of the Member State to whichthe controller is subject, that law regulates the specific processingoperation or set of operations in question, and a data protectionimpact assessment has already been carried out as part of a generalimpact assessment in the context of the adoption of that legal basis, paragraphs 1 to 7 shall not apply unless Member States deem it to benecessary to carry out such an assessment prior to processing activities.\n\n11. Where necessary, the controller shall carry out a review to assessif processing is performed in accordance with the data protection impactassessment at least when there is a change of the risk represented byprocessing operations.\n\nArticle 36\n\nPrior consultation\n\nThe controller shall consult the supervisory authority prior to 1. processing where a data protection impact assessment under Article 35 indicates that the processing would result in a high risk in the absenceof measures taken by the controller to mitigate the risk.\n\n2. Where the supervisory authority is of the opinion that the intendedprocessing referred to in paragraph 1 would infringe this Regulation, inparticular where the controller has insufficiently identified or mitigatedthe risk, the supervisory authority shall, within period of up to eightweeks of receipt of the request for consultation, provide written adviceto the controller and, where applicable to the processor, and may useany of its powers referred to in Article 58. That period may be extendedby six weeks, taking into account the complexity of the intendedprocessing. The supervisory authority shall inform the controller and, where applicable, the processor, of any such extension within onemonth of receipt of the request for consultation together with thereasons for the delay. Those periods may be suspended until the supervisory authority has obtained information it has requested for thepurposes of the consultation.\n\n3. When consulting the supervisory authority pursuant to paragraph 1, the controller shall provide the supervisory authority with:\n\n(a) where applicable, the respective responsibilities of the controller, joint controllers and processors involved in the processing, inparticular for processing within a group of undertakings;\n\n▼B\n\n(b) the purposes and means of the intended processing;\n\n02016R0679 — EN — 04.05.2016 — 000.002 — 33\n\n(c) the measures and safeguards provided to protect the rights and\n\nfreedoms of data subjects pursuant to this Regulation;\n\n(d) where applicable, the contact details of the data protection officer;\n\n(e) the data protection impact assessment provided for in Article 35;\n\nand\n\n(f) any other information requested by the supervisory authority.\n\n4. Member States shall consult the supervisory authority during thepreparation of a proposal for a legislative measure to be adopted by anational parliament, or of a regulatory measure based on such a legislative measure, which relates to processing.\n\n5. Notwithstanding paragraph 1, Member State law may requirecontrollers to consult with, and obtain prior authorisation from, thesupervisory authority in relation to processing by a controller for theperformance of a task carried out by the controller in the public interest, including processing in relation to social protection and public health.\n\nS e c t i o n 4\n\nD a t a p r o t e c t i o n o f f i c e r\n\nArticle 37\n\nDesignation of the data protection officer\n\nThe controller and the processor shall designate a data protection\n\n1. officer in any case where:\n\n(a) the processing is carried out by a public authority or body, except\n\nfor courts acting in their judicial capacity;\n\n(b) the core activities of the controller or the processor consist ofprocessing operations which, by virtue of their nature, their scopeand/or their purposes, require regular and systematic monitoring ofdata subjects on a large scale; or\n\n(c) the core activities of the controller or the processor consist ofprocessing on a large scale of special categories of data pursuantto Article 9 or personal data relating to criminal convictions andoffences referred to in Article 10.\n\n2. A group of undertakings may appoint a single data protectionofficer provided that a data protection officer is easily accessible fromeach establishment.\n\n3. Where the controller or the processor is a public authority or body, a single data protection officer may be designated for several suchauthorities or bodies, taking account of their organisational structureand size.\n\n▼C1\n\n▼B\n\n02016R0679 — EN — 04.05.2016 — 000.002 — 34\n\n▼B\n\n4. In cases other than those referred to in paragraph 1, the controlleror processor or associations and other bodies representing categories ofcontrollers or processors may or, where required by Union or MemberState law shall, designate a data protection officer. The data protectionofficer may act for such associations and other bodies representingcontrollers or processors.\n\n5. The data protection officer shall be designated on the basis ofprofessional qualities and, in particular, expert knowledge of dataprotection law and practices and the ability to fulfil the tasks referredto in Article 39.\n\nThe data protection officer may be a staff member of the controller\n\n6. or processor, or fulfil the tasks on the basis of a service contract.\n\n7. The controller or the processor shall publish the contact details ofthe data protection officer and communicate them to the supervisoryauthority.\n\nArticle 38\n\nPosition of the data protection officer\n\nThe controller and the processor shall ensure that the data 1. protection officer is involved, properly and in a timely manner, in allissues which relate to the protection of personal data.\n\n2. The controller and processor shall support the data protectionofficer in performing the tasks referred to in Article 39 by providingresources necessary to carry out those tasks and access to personal dataand processing operations, and to maintain his or her expert knowledge.\n\n3. The controller and processor shall ensure that the data protectionofficer does not receive any instructions regarding the exercise of thosetasks. He or she shall not be dismissed or penalised by the controller orthe processor for performing his tasks. The data protection officer shalldirectly report to the highest management level of the controller or theprocessor.\n\n4. Data subjects may contact the data protection officer with regardto all issues related to processing of their personal data and to theexercise of their rights under this Regulation.\n\n5. The data protection officer shall be bound by secrecy or confidentiality concerning the performance of his or her tasks, in accordancewith Union or Member State law.\n\n6. The data protection officer may fulfil other tasks and duties. Thecontroller or processor shall ensure that any such tasks and duties do notresult in a conflict of interests.\n\n02016R0679 — EN — 04.05.2016 — 000.002 — 35\n\n▼B\n\nArticle 39\n\nTasks of the data protection officer\n\n1.\n\nThe data protection officer shall have at least the following tasks:\n\n(a) to inform and advise the controller or the processor and theemployees who carry out processing of their obligations pursuantto this Regulation and to other Union or Member State dataprotection provisions;\n\n(b) to monitor compliance with this Regulation, with other Union orMember State data protection provisions and with the policies of thecontroller or processor in relation to the protection of personal data, including the assignment of responsibilities, awareness-raising andtraining of staff involved in processing operations, and the relatedaudits;\n\n(c) to provide advice where requested as regards the data protectionto\n\nits performance pursuant\n\nimpact assessment and monitorArticle 35;\n\n(d) to cooperate with the supervisory authority;\n\n(e) to act as the contact point for the supervisory authority on issuesrelating to processing, including the prior consultation referred to inArticle 36, and to consult, where appropriate, with regard to anyother matter.\n\n2. The data protection officer shall in the performance of his or hertasks have due regard to the risk associated with processing operations, taking into account the nature, scope, context and purposes ofprocessing.\n\nS e c t i o n 5\n\nC o d e s o f c o n d u c t a n d c e r t i f i c a t i o n\n\nArticle 40\n\nCodes of conduct\n\n1. The Member States, the supervisory authorities, the Board and theCommission shall encourage the drawing up of codes of conductintended to contribute to the proper application of this Regulation, taking account of the specific features of the various processingsectors and the specific needs of micro, small and medium-sizedenterprises.\n\nrepresenting categories of 2. Associations and other bodiescontrollers or processors may prepare codes of conduct, or amend orextend such codes, for the purpose of specifying the application of thisRegulation, such as with regard to:\n\n(a) fair and transparent processing;\n\n(b) the legitimate interests pursued by controllers in specific contexts;\n\n(c) the collection of personal data;\n\n▼B\n\n(d) the pseudonymisation of personal data;\n\n02016R0679 — EN — 04.05.2016 — 000.002 — 36\n\n(e) the information provided to the public and to data subjects;\n\n(f) the exercise of the rights of data subjects;\n\n(g) the information provided to, and the protection of, children, and themanner in which the consent of the holders of parental responsibility over children is to be obtained;\n\n(h) the measures and procedures referred to in Articles 24 and 25 andthe measures to ensure security of processing referred to inArticle 32;\n\n(i) the notification of personal data breaches to supervisory authoritiesand the communication of such personal data breaches to datasubjects;\n\n(j) the transfer of personal data to third countries or international\n\norganisations; or\n\n(k) out-of-court proceedings and other dispute resolution procedures forresolving disputes between controllers and data subjects with regardto processing, without prejudice to the rights of data subjectspursuant to Articles 77 and 79.\n\n3. In addition to adherence by controllers or processors subject tothis Regulation, codes of conduct approved pursuant to paragraph 5 ofthis Article and having general validity pursuant to paragraph 9 of thisArticle may also be adhered to by controllers or processors that are notsubject to this Regulation pursuant to Article 3 in order to provideappropriate safeguards within the framework of personal data transfersto third countries or international organisations under the terms referredto in point (e) of Article 46(2). Such controllers or processors shallmake binding and enforceable commitments, via contractual or otherlegally binding instruments, to apply those appropriate safeguardsincluding with regard to the rights of data subjects.\n\n4. A code of conduct referred to in paragraph 2 of this Article shallcontain mechanisms which enable the body referred to in Article 41(1) to carry out the mandatory monitoring of compliance with its provisionsby the controllers or processors which undertake to apply it, withoutprejudice to the tasks and powers of supervisory authorities competentpursuant to Article 55 or 56.\n\n5. Associations and other bodies referred to in paragraph 2 of thisArticle which intend to preparea code of conduct or to amend or extendan existing code shall submit the draft code, amendment or extension tothe supervisory authority which is competent pursuant to Article 55. The supervisory authority shall provide an opinion on whether thedraft code, amendment or extension complies with this Regulationand shall approve that draft code, amendment or extension if it findsthat it provides sufficient appropriate safeguards.\n\n6. Where the draft code, or amendment or extension is approved inaccordance with paragraph 5, and where the code of conduct concerneddoes not relate to processing activities in several Member States, thesupervisory authority shall register and publish the code.\n\n▼B\n\n02016R0679 — EN — 04.05.2016 — 000.002 — 37\n\nto Article 55 shall, before approving\n\n7. Where a draft code of conduct relates to processing activities inseveral Member States, the supervisory authority which is competentpursuantthe draft code, amendment or extension, submit it in the procedure referred to inArticle 63 to the Board which shall provide an opinion on whetherthe draft code, amendment or extension complies with this Regulationor, in the situation referred to in paragraph 3 of this Article, providesappropriate safeguards.\n\n8. Where the opinion referred to in paragraph 7 confirms that thedraft code, amendment or extension complies with this Regulation, or, in the situation referred to in paragraph 3, provides appropriate safeguards, the Board shall submit its opinion to the Commission.\n\n9. The Commission may, by way of implementing acts, decide thatthe approved code of conduct, amendment or extension submitted to itpursuant to paragraph 8 of this Article have general validity within theUnion. Those implementing acts shall be adopted in accordance withthe examination procedure set out in Article 93(2).\n\nThe Commission shall ensure appropriate publicity for the 10. approved codes which have been decided as having general validityin accordance with paragraph 9.\n\nThe Board shall collate all approved codes of conduct, 11. amendments and extensions in a register and shall make thempublicly available by way of appropriate means.\n\nArticle 41\n\nMonitoring of approved codes of conduct\n\n1. Without prejudice to the tasks and powers of the competent supervisory authority under Articles 57 and 58, the monitoring of compliancewith a code of conduct pursuant to Article 40 may be carried out by abody which has an appropriate level of expertise in relation to thesubject-matter of the code and is accredited for that purpose by thecompetent supervisory authority.\n\n2. A body as referred to in paragraph 1 may be accredited to monitorcompliance with a code of conduct where that body has:\n\n(a) demonstrated its independence and expertise in relation to thesubject-matter of the code to the satisfaction of the competent supervisory authority;\n\n(b) established procedures which allow it to assess the eligibility ofcontrollers and processors concernedtomonitor their compliance with its provisions and to periodicallyreview its operation;\n\nthe code,\n\nto apply\n\n(c) established procedures and structures to handle complaints aboutinfringements of the code or the manner in which the code hasbeen, or is being, implemented by a controller or processor, andto make those procedures and structures transparent to data subjectsand the public; and\n\n(d) demonstrated to the satisfaction of the competent supervisoryauthority that its tasks and duties do not result in a conflict ofinterests.\n\n02016R0679 — EN — 04.05.2016 — 000.002 — 38\n\n▼C1\n\n▼B\n\n▼C1\n\n▼B\n\n3. The competent supervisory authority shall submit the draftrequirements for accreditation of a body as referred to in paragraph 1 of this Article to the Board pursuant to the consistency mechanismreferred to in Article 63.\n\n4. Without prejudice to the tasks and powers of the competent supervisory authority and the provisions of Chapter VIII, a body as referredto in paragraph 1 of this Article shall, subject to appropriate safeguards, take appropriate action in cases of infringement of the code by acontroller or processor, including suspension or exclusion of thecontroller or processor concerned from the code. It shall inform thecompetent supervisory authority of such actions and the reasons fortaking them.\n\n5. The competent supervisory authority shall revoke the accreditationof a body as referred to in paragraph 1 if the requirements for accreditation are not, or are no longer, met or where actions taken by the bodyinfringe this Regulation.\n\nThis Article shall not apply to processing carried out by public\n\n6. authorities and bodies.\n\nArticle 42\n\nCertification\n\n1. The Member States, the supervisory authorities, the Board and theCommission shall encourage, in particular at Union level, the establishment of data protection certification mechanisms and of dataprotection seals and marks, for the purpose of demonstrating compliancewith this Regulation of processing operations by controllers andprocessors. The specific needs of micro, small and medium-sized enterprises shall be taken into account.\n\n2. In addition to adherence by controllers or processors subject tothis Regulation, data protection certification mechanisms, seals or marksapproved pursuant to paragraph 5 of this Article may be established forthe purpose of demonstrating the existence of appropriate safeguardsprovided by controllers or processors that are not subject to this Regulation pursuant to Article 3 within the framework of personal datatransfers to third countries or international organisations under theterms referred to in point (f) of Article 46(2). Such controllers orprocessors shall make binding and enforceable commitments, viacontractual or other legally binding instruments, to apply those appropriate safeguards, including with regard to the rights of data subjects.\n\nThe certification shall be voluntary and available via a process that\n\n3. is transparent.\n\n4. A certification pursuant to this Article does not reduce the responsibility of the controller or the processor for compliance with this Regulation and is without prejudice to the tasks and powers of the supervisory authorities which are competent pursuant to Article 55 or 56.\n\n02016R0679 — EN — 04.05.2016 — 000.002 — 39\n\n▼B\n\n▼C1\n\n▼B\n\n5. A certification pursuant to this Article shall be issued by thecertification bodies referred to in Article 43 or by the competent supervisory authority, on the basis of criteria approved by that competentsupervisory authority pursuant to Article 58(3) or by the Board pursuantto Article 63. Where the criteria are approved by the Board, this mayresult in a common certification, the European Data Protection Seal.\n\nThe controller or processor which submits its processing to the 6. certification mechanism shall provide the certification body referred toin Article 43, or where applicable, the competent supervisory authority, with all information and access to its processing activities which arenecessary to conduct the certification procedure.\n\n7. Certification shall be issued to a controller or processor for amaximum period of three years and may be renewed, under the sameconditions, provided that the relevant criteria continue to be met. Certification shall be withdrawn, as applicable, by the certification bodiesreferred to in Article 43 or by the competent supervisory authoritywhere the criteria for the certification are not or are no longer met.\n\n8. The Board shall collate all certification mechanisms and dataprotection seals and marks in a register and shall make them publiclyavailable by any appropriate means.\n\nArticle 43\n\nCertification bodies\n\n1. Without prejudice to the tasks and powers of the competent supervisory authority under Articles 57 and 58, certification bodies whichhave an appropriate level of expertise in relation to data protection shall, after informing the supervisory authority in order to allow it to exerciseits powers pursuant to point (h) of Article 58(2) where necessary, issueand renew certification. Member States shall ensure that those certification bodies are accredited by one or both of the following:\n\n(a) the supervisory authority which is competent pursuant to Article 55\n\nor 56;\n\n(b) the national accreditation body named\n\nin accordance withRegulation (EC) No 765/2008 of the European Parliament and ofthe Council ( 1 ) in accordance with EN-ISO/IEC 17065/2012 andwith the additional requirements established by the supervisoryauthority which is competent pursuant to Article 55 or 56.\n\n2. Certification bodies referred to in paragraph 1 shall be accreditedin accordance with that paragraph only where they have:\n\n(a) demonstrated their independence and expertise in relation to thethe\n\nthe satisfaction of\n\nthe certification\n\nto\n\nsubject-matter ofcompetent supervisory authority;\n\n( 1 ) Regulation (EC) No 765/2008 of the European Parliament and of the Councilof 9 July 2008 setting out the requirements for accreditation and marketsurveillancerepealingRegulation (EEC) No 339/93 (OJ L 218, 13.8.2008, p. 30).\n\nthe marketing of products and\n\nrelating\n\nto\n\n02016R0679 — EN — 04.05.2016 — 000.002 — 40\n\n▼B\n\n(b) undertaken to respect the criteria referred to in Article 42(5) andapproved by the supervisory authority which is competent pursuantto Article 55 or 56 or by the Board pursuant to Article 63;\n\n(c) established procedures for the issuing, periodic review and with\n\ndrawal of data protection certification, seals and marks;\n\n(d) established procedures and structures to handle complaints aboutinfringements of the certification or the manner in which the certification has been, or is being, implemented by the controller orprocessor, and to make those procedures and structures transparentto data subjects and the public; and\n\n(e) demonstrated, to the satisfaction of the competent supervisory authority, that their tasks and duties do not result in a conflict ofinterests.\n\nthe supervisory authority which\n\n3. ►C1 The accreditation of certification bodies as referred to inparagraphs 1 and 2 of this Article shall take place on the basis ofrequirements approved byiscompetent pursuant to Article 55 or 56 or by the Board pursuant toArticle 63. ◄ In the case of accreditation pursuant to point (b) ofparagraph 1 of this Article, those requirements shall complementthose envisaged in Regulation (EC) No 765/2008 and the technicalrules that describe the methods and procedures of the certificationbodies.\n\n4. The certification bodies referred to in paragraph 1 shall beresponsible for the proper assessment leading to the certification orthe withdrawal of such certification without prejudice to the responsibility of the controller or processor for compliance with this Regulation. The accreditation shall be issued for a maximum period of five yearsand may be renewed on the same conditions provided that the certification body meets the requirements set out in this Article.\n\n5. The certification bodies referred to in paragraph 1 shall providethe competent supervisory authorities with the reasons for granting orwithdrawing the requested certification.\n\n▼C1\n\n▼B\n\n6. The requirements referred to in paragraph 3 of this Article and thecriteria referred to in Article 42(5) shall be made public by the supervisory authority in an easily accessible form. The supervisory authoritiesshall also transmit those requirements and criteria to the Board.\n\n7. Without prejudice to Chapter VIII, the competent supervisoryauthority or the national accreditation body shall revoke an accreditationofa certification body pursuant to paragraph 1 of this Article where theconditions for the accreditation are not, or are no longer, met or whereactions taken by a certification body infringe this Regulation.\n\nThe Commission shall be empowered to adopt delegated acts in 8. accordance with Article 92 fortherequirements to be taken into account for the data protection certification mechanisms referred to in Article 42(1).\n\nthe purpose of specifying\n\n02016R0679 — EN — 04.05.2016 — 000.002 — 41\n\n▼B\n\n9. The Commission may adopt implementing acts laying downtechnical standards for certification mechanisms and data protectionseals and marks, and mechanisms to promote and recognise thosecertification mechanisms, seals and marks. Those implementing actsshall be adoptedin accordance with the examination procedurereferred to in Article 93(2).\n\nTransfers of personal data\n\nto\n\nthird countries or\n\ninternational"
}