{
  "title": "GDPR_CHAPTER_VI_Independent_supervisory_authorities",
  "all_text": "CHAPTER VI\n\nIndependent supervisory authorities\n\nS e c t i o n 1\n\nI n d e p e n d e n t s t a t u s\n\nArticle 51\n\nSupervisory authority\n\n1. Each Member State shall provide for one or more independentpublic authorities to be responsible for monitoring the application ofthis Regulation, in order to protect the fundamental rights and freedomsof natural persons in relation to processing and to facilitate the free flowof personal data within the Union (‘supervisory authority’).\n\n2. Each supervisory authority shall contribute to the consistent application of this Regulation throughout the Union. For that purpose, thethesupervisory authorities shall cooperate with each other andCommission in accordance with Chapter VII.\n\n3. Where more than one supervisory authority is established in aMember State, that Member State shall designate the supervisoryauthority which is to represent those authorities in the Board andshall set out the mechanism to ensure compliance by the other authorities with the rules relating to the consistency mechanism referred toin Article 63.\n\n4. Each Member State shall notify to the Commission the provisionsof its law which it adopts pursuant to this Chapter, by 25 May 2018 and, without delay, any subsequent amendment affecting them.\n\nArticle 52\n\nIndependence\n\n1. Each supervisory authority shall act with complete independencein performing its tasks and exercising its powers in accordance with thisRegulation.\n\n2. The member or members of each supervisory authority shall, inthe performance of their tasks and exercise of their powers inaccordance with this Regulation, remain free from external influence, whether direct or indirect, and shall neither seek nor take instructionsfrom anybody.\n\n3. Member or members of each supervisory authority shall refrainfrom any action incompatible with their duties and shall not, duringtheir term of office, engage in any incompatible occupation, whethergainful or not.\n\n▼B\n\n02016R0679 — EN — 04.05.2016 — 000.002 — 49\n\n4. Each Member State shall ensure that each supervisory authority isprovided with the human, technical and financial resources, premisesand infrastructure necessary for the effective performance of its tasksand exercise of its powers, including those to be carried out in thecontext of mutual assistance, cooperation and participation in the Board.\n\n5. Each Member State shall ensure that each supervisory authoritychooses and has its own staff which shall be subject to the exclusivedirection of the member or members of the supervisory authorityconcerned.\n\n6. Each Member State shall ensure that each supervisory authority issubject to financial control which does not affect its independence andthat it has separate, public annual budgets, which may be part of theoverall state or national budget.\n\nArticle 53\n\nGeneral conditions for the members of the supervisory authority\n\n1. Member States shall provide for each member of their supervisoryauthorities to be appointed by means of a transparent procedure by:\n\n— their parliament;\n\n— their government;\n\n— their head of State; or\n\n— an independent body entrusted with the appointment under Member\n\nState law.\n\n2. Each member shall have the qualifications, experience and skills, in particular in the area of the protection of personal data, required toperform its duties and exercise its powers.\n\n3. The duties of a member shall end in the event of the expiry of theterm of office, resignation or compulsory retirement, in accordance withthe law of the Member State concerned.\n\n4. A member shall be dismissed only in cases of serious misconductor if the member no longer fulfils the conditions required for theperformance of the duties.\n\nArticle 54\n\nRules on the establishment of the supervisory authority\n\n1.\n\nEach Member State shall provide by law for all of the following:\n\n(a) the establishment of each supervisory authority;\n\n(b) the qualifications and eligibility conditions required to be appointed\n\nas member of each supervisory authority;\n\n(c) the rules and procedures for the appointment of the member or\n\nmembers of each supervisory authority;\n\n(d) the duration of the term of the member or members of each supervisory authority of no less than four years, except for the firstappointment after 24 May 2016, part of which may take place fora shorter period where that is necessary to protect the independenceof the supervisory authority by means of a staggered appointmentprocedure;\n\n02016R0679 — EN — 04.05.2016 — 000.002 — 50\n\n▼B\n\n(e) whether and, if so, for how many terms the member or members of\n\neach supervisory authority is eligible for reappointment;\n\n(f) the conditions governing the obligations of the member or membersand staff of each supervisory authority, prohibitions on actions, occupations and benefits incompatible therewith during and afterthe term of office and rules governing the cessation of employment.\n\n2. The member or members and the staff of each supervisoryauthority shall, in accordance with Union or Member State law, besubject to a duty of professional secrecy both during and after theirterm of office, with regard to any confidential information which hascome to their knowledge in the course of the performance of their tasksor exercise of their powers. During their term of office, that duty ofprofessional secrecy shall in particular apply to reporting by naturalpersons of infringements of this Regulation.\n\nS e c t i o n 2\n\nC o m p e t e n c e , t a s k s a n d p o w e r s\n\nArticle 55\n\nCompetence\n\nEach supervisory authority shall be competent for the performance 1. of the tasks assigned to and the exercise of the powers conferred on it inaccordance with this Regulation on the territory of its own MemberState.\n\n2. Where processing is carried out by public authorities or privatebodies acting on the basis of point (c) or (e) of Article 6(1), the supervisory authority of the Member State concerned shall be competent. Insuch cases Article 56 does not apply.\n\nSupervisory authorities shall not be competent to supervise\n\n3. processing operations of courts acting in their judicial capacity.\n\nArticle 56\n\nCompetence of the lead supervisory authority\n\n1. Without prejudice to Article 55, the supervisory authority of themain establishment or of the single establishment of the controller orprocessor shall be competent to act as lead supervisory authority for thecross-border processing carried out by that controller or processor inaccordance with the procedure provided in Article 60.\n\n2. By derogation from paragraph 1, each supervisory authority shallbe competent to handle a complaint lodged with it or a possibleinfringement of this Regulation, if the subject matter relates only toan establishment in its Member State or substantially affects datasubjects only in its Member State.\n\n▼B\n\n02016R0679 — EN — 04.05.2016 — 000.002 — 51\n\n3. In the cases referred to in paragraph 2 of this Article, the supervisory authority shall inform the lead supervisory authority withoutdelay on that matter. Within a period of three weeks after beinginformed the lead supervisory authority shall decide whether or not itwill handle the case in accordance with the procedure provided inArticle 60, taking into account whether or not there is an establishmentof the controller or processor in the Member State of which the supervisory authority informed it.\n\n4. Where the lead supervisory authority decides to handle the case, the procedure provided in Article 60 shall apply. The supervisoryauthority which informed the lead supervisory authority may submitto the lead supervisory authority a draft for a decision. The lead supervisory authority shall take utmost account of that draft when preparingthe draft decision referred to in Article 60(3).\n\n5. Where the lead supervisory authority decides not to handle thecase, the supervisory authority which informed the lead supervisoryauthority shall handle it according to Articles 61 and 62.\n\n6. The lead supervisory authority shall be the sole interlocutor of thecontroller or processor for the cross-border processing carried out bythat controller or processor.\n\nArticle 57\n\nTasks\n\n1. Without prejudice to other tasks set out under this Regulation, each supervisory authority shall on its territory:\n\n(a) monitor and enforce the application of this Regulation;\n\n(b) promote public awareness and understanding of the risks, rules, safeguards andto processing. Activitiesrelationaddressed specifically to children shall receive specific attention;\n\nrights\n\nin\n\n(c) advise, in accordance with Member State law, the nationalparliament, the government, and other institutions and bodies onlegislative and administrative measures relating to the protection ofnatural persons' rights and freedoms with regard to processing;\n\n(d) promote the awareness of controllers and processors of their obli\n\ngations under this Regulation;\n\n(e) upon request, provide information to any data subject concerningthe exercise of their rights under this Regulation and, if appropriate, cooperate with the supervisory authorities in other Member Statesto that end;\n\n(f) handle complaints lodged by a data subject, or by a body, organisation or association in accordance with Article 80, and investigate, to the extent appropriate, the subject matter of the complaint andinform the complainant of the progress and the outcome of theinvestigation within a reasonable period, in particular if furtherinvestigation or coordination with another supervisory authority isnecessary;\n\n02016R0679 — EN — 04.05.2016 — 000.002 — 52\n\n▼B\n\n▼C1\n\n▼B\n\n(g) cooperate with, including sharing information and provide mutualassistance to, other supervisory authorities with a view to ensuringthe consistency of application and enforcement of this Regulation;\n\n(h) conduct investigations on the application of this Regulation, including on the basis of information received from another supervisory authority or other public authority;\n\n(i) monitor relevant developments, insofar as they have an impact onthe protection of personal data, in particular the development ofinformation and communicationtechnologies and commercialpractices;\n\n(j) adopt standard contractual clauses referred to in Article 28(8) and\n\nin point (d) of Article 46(2);\n\n(k) establish and maintain a list in relation to the requirement for data\n\nprotection impact assessment pursuant to Article 35(4);\n\n(l) give advice onArticle 36(2);\n\nthe processing operations\n\nreferred\n\nto\n\nin\n\n(m) encourage the drawing up of codes of conduct pursuant toArticle 40(1) and provide an opinion and approve such codes ofconduct which providetosufficientArticle 40(5);\n\nsafeguards, pursuant\n\n(n) encourage the establishment of data protection certification mechanisms and of data protection seals and marks pursuant toArticle 42(1), and approve the criteria of certification pursuant toArticle 42(5);\n\n(o) where applicable, carry out a periodic review of certifications\n\nissued in accordance with Article 42(7);\n\n(p) draft and publish the requirements for accreditation of a body formonitoring codes of conduct pursuant to Article 41 and of a certification body pursuant to Article 43;\n\n(q) conduct the accreditation of a body for monitoring codes ofconduct pursuant to Article 41 and of a certification bodypursuant to Article 43;\n\n(r) authorise contractual clauses and provisions\n\nreferred\n\nto\n\nin\n\nArticle 46(3);\n\n(s) approve binding corporate rules pursuant to Article 47;\n\n(t) contribute to the activities of the Board;\n\n(u) keep internal records of infringements of this Regulation and of\n\nmeasures taken in accordance with Article 58(2); and\n\n(v) fulfil any other tasks related to the protection of personal data.\n\n2. Each supervisory authority shall facilitate the submission ofcomplaints referred to in point (f) of paragraph 1 by measures suchas a complaint submission form which can also be completed electronically, without excluding other means of communication.\n\n3. The performance of the tasks of each supervisory authority shallbe free of charge for the data subject and, where applicable, for the dataprotection officer.\n\n02016R0679 — EN — 04.05.2016 — 000.002 — 53\n\n▼B\n\nin 4. Where requests are manifestly unfounded or excessive, particular because ofthe supervisoryauthority may charge a reasonable fee based on administrative costs, or refuse to act on the request. The supervisory authority shall bear theburden of demonstratingthe manifestly unfounded or excessivecharacter of the request.\n\ntheir repetitive character,\n\nArticle 58\n\nPowers\n\nEach supervisory authority shall have all of the following inves\n\n1. tigative powers:\n\n(a) to order the controller and the processor, and, where applicable, theto provide anythe processor's representative\n\ncontroller's orinformation it requires for the performance of its tasks;\n\n(b) to carry out investigations in the form of data protection audits;\n\n(c) to carry out a review on certifications\n\nissued pursuant\n\nto\n\nArticle 42(7);\n\n(d) to notify the controller or the processor of an alleged infringement\n\nof this Regulation;\n\n(e) to obtain, from the controller and the processor, access to allpersonal data and to all information necessary for the performanceof its tasks;\n\n(f) to obtain access to any premises of the controller and the processor, in\n\nto any data processing equipment and means,\n\nincludingaccordance with Union or Member State procedural law.\n\nEach supervisory authority shall have all of the following\n\n2. corrective powers:\n\n(a) to issue warnings to a controller or processor that intendedprocessing operations are likely to infringe provisions of this Regulation;\n\n(b) to issue reprimands to a controller or a processor where processing\n\noperations have infringed provisions of this Regulation;\n\n(c) to order the controller or the processor to comply with the datasubject's requests to exercise his or her rights pursuant to thisRegulation;\n\n(d) to order the controller or processor to bring processing operationsinto compliance with the provisions of this Regulation, whereappropriate, in a specified manner and within a specified period;\n\n(e) to order the controller to communicatea personal data breach to the\n\ndata subject;\n\n(f) to impose a temporary or definitive limitation including a ban on\n\nprocessing;\n\n▼B\n\n02016R0679 — EN — 04.05.2016 — 000.002 — 54\n\n(g) to order the rectification or erasure of personal data or restriction ofprocessing pursuant to Articles 16, 17 and 18 and the notification ofsuch actions to recipients to whom the personal data have beendisclosed pursuant to Article 17(2) and Article 19;\n\n(h) to withdraw a certification or to order the certification body towithdraw a certification issued pursuant to Articles 42 and 43, orto order the certification body not to issue certification if therequirements for the certification are not or are no longer met;\n\n(i) to impose an administrative fine pursuant to Article 83, in additionto, or instead of measures referred to in this paragraph, dependingon the circumstances of each individual case;\n\n(j) to order the suspension of data flows to a recipient in a third\n\ncountry or to an international organisation.\n\nEach supervisory authority shall have all of the following author\n\n3. isation and advisory powers:\n\n(a) to advise the controller in accordance with the prior consultation\n\nprocedure referred to in Article 36;\n\n(b) to issue, on its own initiative or on request, opinions to the nationalparliament, the Member State government or, in accordance withMember State law, to other institutions and bodies as well as to thepublic on any issue related to the protection of personal data;\n\n(c) to authorise processing referred to in Article 36(5), if the law of the\n\nMember State requires such prior authorisation;\n\n(d) to issue an opinion and approve draft codes of conduct pursuant to\n\nArticle 40(5);\n\n(e) to accredit certification bodies pursuant to Article 43;\n\n(f) to issue certifications and approve criteria of certification in\n\naccordance with Article 42(5);\n\n(g) to adopt standard data protection clauses referred to in Article 28(8)\n\nand in point (d) of Article 46(2);\n\n(h) to authorise contractual clauses referred to\n\nin point (a) of\n\nArticle 46(3);\n\n(i) to authorise administrative arrangements referred to in point (b) of\n\nArticle 46(3);\n\n(j) to approve binding corporate rules pursuant to Article 47.\n\n4. The exercise of the powers conferred on the supervisory authoritypursuant to this Article shall be subject to appropriate safeguards, including effective judicial remedy and due process, set out in Unionand Member State law in accordance with the Charter.\n\n5. Each Member State shall provide by law that its supervisoryauthority shall have the power to bring infringements of this Regulationto the attention of the judicial authorities and where appropriate, tocommence or engage otherwise in legal proceedings, in order toenforce the provisions of this Regulation.\n\n02016R0679 — EN — 04.05.2016 — 000.002 — 55\n\n▼B\n\n6. Each Member State may provide by law that its supervisoryauthority shall have additional powers to those referred to in paragraphs 1, 2 and 3. The exercise of those powers shall not impair theeffective operation of Chapter VII.\n\nArticle 59\n\nActivity reports\n\nEach supervisory authority shall draw up an annual report on its activities, which may include a list of types of infringement notified andtypes of measures taken in accordance with Article 58(2). Those reportsshall be transmitted to the national parliament, the government and otherauthorities as designated by Member State law. They shall be madeavailable to the public, to the Commission and to the Board."
}