{
  "title": "GDPR_CHAPTER_VII_Cooperation_and_consistency",
  "all_text": "CHAPTER VII\n\nCooperation and consistency\n\nS e c t i o n 1\n\nC o o p e r a t i o n\n\nArticle 60\n\nCooperation between the lead supervisory authority and the othersupervisory authorities concerned\n\n1. The lead supervisory authority shall cooperate with the othersupervisory authorities concerned in accordance with this Article in anendeavour to reach consensus. The lead supervisory authority and thesupervisory authorities concernedrelevantinformation with each other.\n\nshall exchange all\n\nThe lead supervisory authority may request at any time other 2. supervisory authorities concernedto provide mutual assistancepursuant to Article 61 and may conduct joint operations pursuant toArticle 62, in particular for carrying out investigations or for monitoringthe implementation of a measure concerning a controller or processorestablished in another Member State.\n\n3. The lead supervisory authority shall, without delay, communicatethe relevant information on the matter to the other supervisory authorities concerned. It shall without delay submit a draft decision to theother supervisory authorities concerned for their opinion and take dueaccount of their views.\n\n4. Where any of the other supervisory authorities concerned within aperiod of four weeks after having been consulted in accordance withparagraph 3 of this Article, expresses a relevant and reasoned objectionto the draft decision, the lead supervisory authority shall, if it does notfollow the relevant and reasoned objection or is of the opinion that theobjection is not relevant or reasoned, submit the matter to theconsistency mechanism referred to in Article 63.\n\n02016R0679 — EN — 04.05.2016 — 000.002 — 56\n\n▼B\n\n5. Where the lead supervisory authority intends to follow the relevantand reasoned objection made, it shall submit to the other supervisoryauthorities concerned a revised draft decision for their opinion. Thatrevised draft decision shall be subject to the procedure referred to inparagraph 4 within a period of two weeks.\n\n6. Where none of the other supervisory authorities concerned hasobjected to the draft decision submitted by the lead supervisoryauthority within the period referred to in paragraphs 4 and 5, the leadsupervisory authority and the supervisory authorities concerned shall bedeemed to be in agreement with that draft decision and shall be boundby it.\n\n7. The lead supervisory authority shall adopt and notify the decisionto the main establishment or single establishment of the controller orprocessor, as the case may be and inform the other supervisory authorities concerned and the Board of the decision in question, including asummary of the relevant facts and grounds. The supervisory authoritywith which a complaint has been lodged shall inform the complainanton the decision.\n\n8. By derogation from paragraph 7, where a complaint is dismissedor rejected, the supervisory authority with which the complaint waslodged shall adopt the decision and notify it to the complainant andshall inform the controller thereof.\n\n9. Where the lead supervisory authority and the supervisory authorities concerned agree to dismiss or reject parts of a complaint andto act on other parts of that complaint, a separate decision shall beadopted for each of those parts of the matter. The lead supervisoryauthority shall adopt the decision for the part concerning actions inrelation to the controller, shall notify it to the main establishment orsingle establishment of the controller or processor on the territory of itsMember State and shall inform the complainant thereof, while thesupervisory authority of the complainant shall adopt the decision forthe part concerning dismissal or rejection of that complaint, and shallnotify it to that complainant and shall inform the controller or processorthereof.\n\n10. After being notified of the decision of the lead supervisoryauthority pursuant to paragraphs 7 and 9, the controller or processorshall take the necessary measures to ensure compliance with thedecision as regards processing activities in the context of all its establishments in the Union. The controller or processor shall notify themeasures taken for complying with the decision to the lead supervisoryauthority, which shallthe other supervisory authoritiesconcerned.\n\ninform\n\n11. Where, in exceptional circumstances, a supervisory authorityconcerned has reasons to consider that there is an urgent need to actin order to protect the interests of data subjects, the urgency procedurereferred to in Article 66 shall apply.\n\n12. The lead supervisory authority and the other supervisory authorities concerned shall supply the information required under thisArticle to each other by electronic means, using a standardised format.\n\n02016R0679 — EN — 04.05.2016 — 000.002 — 57\n\n▼B\n\nArticle 61\n\nMutual assistance\n\n1. Supervisory authorities shall provide each other with relevantinformation and mutual assistance in order to implement and applythis Regulation in a consistent manner, and shall put in placemeasures for effective cooperation with one another. Mutual assistanceinformation requests and supervisoryshall cover, measures, such as requests to carry out prior authorisations and consultations, inspections and investigations.\n\nin particular,\n\nEach supervisory authority shall take all appropriate measures 2. required to reply to a request of another supervisory authority withoutundue delay and no later than one month after receiving the request. Such measures may include, in particular, the transmission of relevantinformation on the conduct of an investigation.\n\n3. Requests for assistance shall contain all the necessary information, including the purpose of and reasons for the request. Informationexchanged shall be used only for the purpose for which it wasrequested.\n\nThe requested supervisory authority shall not refuse to comply\n\n4. with the request unless:\n\n(a) it is not competent for the subject-matter of the request or for the\n\nmeasures it is requested to execute; or\n\n(b) compliance with the request would infringe this Regulation orUnion or Member State law to which the supervisory authorityreceiving the request is subject.\n\n5. The requested supervisory authority shall inform the requestingsupervisory authority of the results or, as the case may be, of theprogress of the measures taken in order to respond to the request. The requested supervisory authority shall provide reasons for anyrefusal to comply with a request pursuant to paragraph 4.\n\n6. Requested supervisory authorities shall, as a rule, supply theinformation requested by other supervisory authorities by electronicmeans, using a standardised format.\n\n7. Requested supervisory authorities shall not charge a fee for anyaction taken by them pursuant to a request for mutual assistance. Supervisory authorities may agree on rules to indemnify each other forspecific expenditure arising from the provision of mutual assistance inexceptional circumstances.\n\n8. Where a supervisory authority does not provide the informationreferred to in paragraph 5 of this Article within one month of receivingthe request of another supervisory authority, the requesting supervisoryauthority may adopt a provisional measure on the territory of itsMember State in accordance with Article 55(1). In that case, theurgent need to act under Article 66(1) shall be presumed to be metand require an urgent binding decision from the Board pursuant toArticle 66(2).\n\n02016R0679 — EN — 04.05.2016 — 000.002 — 58\n\n▼B\n\n9. The Commission may, by means of implementing acts, specify theformat and procedures for mutual assistance referred to in this Articleand the arrangements for the exchange of information by electronicmeans between supervisory authorities, and between supervisory authorities and the Board, in particular the standardised format referred to inparagraph 6 of this Article. Those implementing acts shall be adopted inaccordance with the examination procedure referred to in Article 93(2).\n\nArticle 62\n\nJoint operations of supervisory authorities\n\n1. The supervisory authorities shall, where appropriate, conduct jointoperations including joint investigations and joint enforcement measuresin which members or staff of the supervisory authorities of otherMember States are involved.\n\n2. Where the controller or processor has establishments in severalMember States or where a significant number of data subjects inmore than one Member State are likely to be substantially affected byprocessing operations, a supervisory authority of each of those MemberStates shall have the right to participate in joint operations. The supervisory authority which is competent pursuant to Article 56(1) or (4) shall invite the supervisory authority of each of those Member Statesto take part in the joint operations and shall respond without delay tothe request of a supervisory authority to participate.\n\n3. A supervisory authority may, in accordance with Member Statelaw, and with the seconding supervisory authority's authorisation, conferpowers, including investigative powers on the seconding supervisoryauthority's members or staff involved in joint operations or, in so faras the law of the Member State of the host supervisory authoritypermits, allow the seconding supervisory authority's members or staffto exercise their investigative powers in accordance with the law of theMember State of the seconding supervisory authority. Such investigativepowers may be exercised only under the guidance and in the presenceof members or staff of the host supervisory authority. The secondingsupervisory authority's members or staff shall be subject to theMember State law of the host supervisory authority.\n\n4. Where, in accordance with paragraph 1, staff of a secondingsupervisory authority operatetheMember State of the host supervisory authority shall assume responsibility for their actions, including liability, for any damage caused bythem during their operations, in accordance with the law of theMember State in whose territory they are operating.\n\nin another Member State,\n\n5. The Member State in whose territory the damage was caused shallmake good such damage under the conditions applicable to damagecaused by its own staff. The Member State of the seconding supervisoryauthority whose staff has caused damage to any person in the territoryof another Member State shall reimburse that other Member State in fullany sums it has paid to the persons entitled on their behalf.\n\n6. Without prejudice to the exercise of its rights vis-à-vis third partiesand with the exception of paragraph 5, each Member State shall refrain, in the case provided for in paragraph 1, from requesting reimbursementfrom another Member State in relation to damage referred to inparagraph 4.\n\n02016R0679 — EN — 04.05.2016 — 000.002 — 59\n\n▼B\n\n7. Where a joint operation is intended and a supervisory authoritydoes not, within one month, comply with the obligation laid down inthe second sentence of paragraph 2 of this Article, the other supervisoryauthorities may adopt a provisional measure on the territory of itsMember State in accordance with Article 55. In that case, the urgentneed to act under Article 66(1) shall be presumed to be met and requirean opinion or an urgent binding decision from the Board pursuant toArticle 66(2).\n\nS e c t i o n 2\n\nC o n s i s t e n c y\n\nArticle 63\n\nConsistency mechanism\n\nIn order to contribute to the consistent application of this Regulationthroughout the Union, the supervisory authorities shall cooperate witheach other and, where relevant, with the Commission, through theconsistency mechanism as set out in this Section.\n\nArticle 64\n\nOpinion of the Board\n\n1. The Board shall issue an opinion where a competent supervisoryauthority intends to adopt any of the measures below. To that end, thecompetent supervisory authority shall communicate the draft decision tothe Board, when it:\n\n(a) aims to adopt a list of the processing operations subject to therequirement for a data protection impact assessment pursuant toArticle 35(4);\n\n(b) concerns a matter pursuant to Article 40(7) whether a draft code ofconduct or an amendment or extension to a code of conductcomplies with this Regulation;\n\n(c) aims to approve the requirements for accreditation of a bodypursuant to Article 41(3), of a certification body pursuant toinArticle 43(3) orArticle 42(5);\n\nthe criteria for certification referred to\n\n(d) aims to determine standard data protection clauses referred to in\n\npoint (d) of Article 46(2) and in Article 28(8);\n\n(e) aims to authorise contractual clauses referred to in point (a) of\n\nArticle 46(3); or\n\n(f) aims to approve binding corporate rules within the meaning of\n\nArticle 47.\n\n2. Any supervisory authority, the Chair of the Board or theCommission may request that any matter of general application orproducing effects in more than one Member State be examined by theBoard with a view to obtaining an opinion, in particular where acompetent supervisory authority does not comply with the obligationsfor mutual assistance in accordance with Article 61 or for joint operations in accordance with Article 62.\n\n▼C1\n\n▼B\n\n▼B\n\n02016R0679 — EN — 04.05.2016 — 000.002 — 60\n\n3. In the cases referred to in paragraphs 1 and 2, the Board shallissue an opinion on the matter submitted to it provided that it has notalready issued an opinion on the same matter. That opinion shall beadopted within eight weeks by simple majority of the members of theBoard. That period may be extended by a further six weeks, taking intoaccount the complexity of the subject matter. Regarding the draftdecision referred to in paragraph 1 circulated to the members of theBoard in accordance with paragraph 5, a member which has notobjected within a reasonable period indicated by the Chair, shall bedeemed to be in agreement with the draft decision.\n\n4. Supervisory authorities and the Commission shall, without unduedelay, communicate by electronic means to the Board, using a standardised format any relevant information, including as the case maybe a summary of the facts, the draft decision, the grounds whichmake the enactment of such measure necessary, and the views ofother supervisory authorities concerned.\n\nThe Chair of the Board shall, without undue, delay inform by\n\n5. electronic means:\n\n(a) the members of the Board and the Commission of any relevantinformation which has been communicated to it usinga standardisedformat. The secretariat of the Board shall, where necessary, providetranslations of relevant information; and\n\n(b) the supervisory authority referred to, as the case may be, in paragraphs 1 and 2, and the Commission of the opinion and make itpublic.\n\n▼C1\n\n6. The competent supervisory authority referred to in paragraph 1 shall not adopt its draft decision referred to in paragraph 1 within theperiod referred to in paragraph 3.\n\n7. The competent supervisory authority referred to in paragraph 1 shall take utmost account of the opinion of the Board and shall, within two weeks after receiving the opinion, communicate to theChair of the Board by electronic means whether it will maintain oramend its draft decision and, if any, the amended draft decision, using a standardised format.\n\nthe competent supervisory authority referred\n\nin 8. Whereparagraph 1 informs the Chair of the Board within the period referredto in paragraph 7 of this Article that it does not intend to follow theopinion of the Board, in whole or in part, providing the relevantgrounds, Article 65(1) shall apply.\n\nto\n\n▼B\n\nArticle 65\n\nDispute resolution by the Board\n\n1. In order to ensure the correct and consistent application of thisRegulation in individual cases, the Board shall adopta binding decisionin the following cases:\n\n(a) ►C1 where, in a case referred to in Article 60(4), a supervisoryauthority concerned has raised a relevant and reasoned objection toa draft decision of the lead supervisory authority and the lead supervisory authority has not followed the objection or has rejected such\n\n02016R0679 — EN — 04.05.2016 — 000.002 — 61\n\n▼B\n\nan objection as being not relevant or reasoned. ◄ The bindingdecision shall concern all the matters which are the subject of therelevant and reasoned objection, in particular whether there is aninfringement of this Regulation;\n\n(b) where there are conflicting views on which of the supervisory auth\n\norities concerned is competent for the main establishment;\n\n(c) where a competent supervisory authority does not request theopinion of the Board in the cases referred to in Article 64(1), ordoes not follow the opinion of the Board issued under Article 64. Inthat case, any supervisory authority concerned or the Commissionmay communicate the matter to the Board.\n\n2. The decision referred to in paragraph 1 shall be adopted withinone month from the referral of the subject-matter by a two-thirdsmajority of the members of the Board. That period may be extendedby a further month on account of the complexity of the subject-matter. The decision referred to in paragraph 1 shall be reasoned and addressedto the lead supervisory authority and all the supervisory authoritiesconcerned and binding on them.\n\n3. Where the Board has been unable to adopt a decision within theperiods referred to in paragraph 2, it shall adopt its decision within twoweeks following the expiration of the second month referred to inparagraph 2 by a simple majority of the members of the Board. Where the members of the Board are split, the decision shall byadopted by the vote of its Chair.\n\n4. The supervisory authorities concerned shall not adopt a decisionon the subject matter submitted to the Board under paragraph 1 duringthe periods referred to in paragraphs 2 and 3.\n\n5. The Chair of the Board shall notify, without undue delay, thedecision referred to in paragraph 1 to the supervisory authoritiesconcerned. It shall inform the Commission thereof. The decision shallbe published on the website of the Board without delay after the supervisory authority has notifiedinparagraph 6.\n\nthe final decision referred\n\nto\n\n6. The lead supervisory authority or, as the case may be, the supervisory authority with which the complaint has been lodged shall adoptits final decision on the basis of the decision referred to in paragraph 1 of this Article, without undue delay and at the latest by one month afterthe Board has notified its decision. The lead supervisory authority or, asthe case may be, the supervisory authority with which the complaint hasbeen lodged, shall inform the Board of the date when its final decisionis notified respectively to the controller or the processor and to the datasubject. The final decision of the supervisory authorities concerned shallbe adopted under the terms of Article 60(7), (8) and (9). The finaldecision shall refer to the decision referred to in paragraph 1 of thisArticle and shall specify that the decision referred to in that paragraphwill be published on the website of the Board in accordance withparagraph 5 of this Article. The final decision shall attach thedecision referred to in paragraph 1 of this Article.\n\n02016R0679 — EN — 04.05.2016 — 000.002 — 62\n\n▼B\n\nArticle 66\n\nUrgency procedure\n\n1. In exceptional circumstances, where a supervisory authorityconcerned considers that there is an urgent need to act in order toprotect the rights and freedoms of data subjects, it may, by way ofderogation from the consistency mechanism referred to in Articles 63, 64 and 65 or the procedure referred to in Article 60, immediately adoptprovisional measures intended to produce legal effects on its ownterritory with a specified period of validity which shall not exceedthree months. The supervisory authority shall, without delay, communicate those measures and the reasons for adopting them to theother supervisory authorities concerned, to the Board and to theCommission.\n\n2. Where a supervisory authority has taken a measure pursuant toparagraph 1 and considers that final measures need urgently be adopted, it may request an urgent opinion or an urgent binding decision from theBoard, giving reasons for requesting such opinion or decision.\n\n3. Any supervisory authority may request an urgent opinion or anurgent binding decision, as the case may be, from the Board where acompetent supervisory authority has not taken an appropriate measure ina situation where there is an urgent need to act, in order to protect therights and freedoms of data subjects, giving reasons for requesting suchopinion or decision, including for the urgent need to act.\n\n4. By derogation from Article 64(3) and Article 65(2), an urgentopinion or an urgent binding decision referred to in paragraphs 2 and 3 of this Article shall be adopted within two weeks by simplemajority of the members of the Board.\n\nArticle 67\n\nExchange of information\n\nThe Commission may adopt implementing acts of general scope inorder to specify the arrangements for the exchange of information byelectronic means between supervisory authorities, and between supervisory authorities and the Board, in particular the standardised formatreferred to in Article 64.\n\nThose implementing acts shall be adopted in accordance with the examination procedure referred to in Article 93(2).\n\nS e c t i o n 3\n\nE u r o p e a n d a t a p r o t e c t i o n b o a r d\n\nArticle 68\n\nEuropean Data Protection Board\n\nThe European Data Protection Board (the ‘Board’) is hereby estab\n\n1. lished as a body of the Union and shall have legal personality.\n\n2.\n\nThe Board shall be represented by its Chair.\n\n02016R0679 — EN — 04.05.2016 — 000.002 — 63\n\n▼B\n\n3. The Board shall be composed of the head of one supervisoryauthority of each Member State and of the European Data ProtectionSupervisor, or their respective representatives.\n\n4. Where in a Member State more than one supervisory authority isresponsible for monitoring the application of the provisions pursuant tothis Regulation, a joint representative shall be appointed in accordancewith that Member State's law.\n\n5. The Commission shall have the right to participate in the activitiesand meetings of the Board without voting right. The Commission shalldesignatea representative. The Chair of the Board shall communicate tothe Commission the activities of the Board.\n\n6. In the cases referred to in Article 65, the European Data ProtectionSupervisor shall have voting rights only on decisions which concernprinciples and rules applicable to the Union institutions, bodies, officesand agencies which correspond in substance to those of this Regulation.\n\nArticle 69\n\nIndependence\n\nThe Board shall act independently when performing its tasks or\n\n1. exercising its powers pursuant to Articles 70 and 71.\n\n2. Without prejudice to requests by the Commission referred to inArticle 70(1) and (2), the Board shall, in the performance of its tasks orthe exercise of its powers, neither seek nor take instructions fromanybody.\n\nArticle 70\n\nTasks of the Board\n\n1. The Board shall ensure the consistent application of this Regulation. To that end, the Board shall, on its own initiative or, whererelevant, at the request of the Commission, in particular:\n\n(a) monitor and ensure the correct application of this Regulation in thecases provided for in Articles 64 and 65 without prejudice to thetasks of national supervisory authorities;\n\n(b) advise the Commission on any issue related to the protection ofpersonal data in the Union, including on any proposed amendmentof this Regulation;\n\n(c) advise the Commission on the format and procedures for theexchange of information between controllers, processors and supervisory authorities for binding corporate rules;\n\n▼C1\n\n▼B\n\n02016R0679 — EN — 04.05.2016 — 000.002 — 64\n\n▼B\n\n(d) issue guidelines,\n\nrecommendations, and best practices onprocedures for erasing links, copies or replications of personaldata from publicly available communication services as referredto in Article 17(2);\n\n(e) examine, on its own initiative, on request of one of its members oron request of the Commission, any question covering the application of this Regulation and issue guidelines, recommendationsand best practices in order to encourage consistent application ofthis Regulation;\n\n(f)\n\nissue guidelines, recommendations and best practices in accordancewith point (e) of this paragraph for further specifying the criteriaand conditions for decisions based on profiling pursuant toArticle 22(2);\n\n(g) issue guidelines, recommendations and best practices in accordancewith point (e) of this paragraph for establishing the personal datainbreaches and determiningArticle 33(1) and (2) and for the particular circumstances inwhich a controller or a processor is required to notify thepersonal data breach;\n\nthe undue delay\n\nreferred\n\nto\n\n(h) issue guidelines, recommendations and best practices in accordancewith point (e) of this paragraph as to the circumstances in which apersonal data breach is likely to result in a high risk to the rightsand freedoms of the natural persons referred to in Article 34(1).\n\n(i)\n\nissue guidelines, recommendations and best practices in accordancewith point (e) of this paragraph for the purpose of further specifying the criteria and requirements for personal data transfersbased on binding corporate rules adhered to by controllers andbinding corporate rules adhered to by processors and on furthernecessary requirements to ensure the protection of personal dataof the data subjects concerned referred to in Article 47;\n\n(j)\n\nissue guidelines, recommendations and best practices in accordancewith point (e) of this paragraph for the purpose of further specifying the criteria and requirements for the personal data transferson the basis of Article 49(1);\n\n(k) draw up guidelines for supervisory authorities concerning the application of measures referred to in Article 58(1), (2) and (3) and thesetting of administrative fines pursuant to Article 83;\n\n▼C1\n\n▼B\n\n(l)\n\nreview the practical application of the guidelines, recommendationsand best practices;\n\n(m) issue guidelines, recommendations and best practices in accordancewith point (e) ofthis paragraph for establishing commonprocedures for reporting by natural persons of infringements ofthis Regulation pursuant to Article 54(2);\n\n02016R0679 — EN — 04.05.2016 — 000.002 — 65\n\n▼B\n\n▼C1\n\n▼B\n\n(n) encourage the drawing-up of codes of conduct and the establishment of data protection certification mechanisms and dataprotection seals and marks pursuant to Articles 40 and 42;\n\n(o) approve the criteria of certification pursuant to Article 42(5) andmaintain a public register of certification mechanisms and dataprotection seals and marks pursuant to Article 42(8) and of thecertified controllers or processors established in third countriespursuant to Article 42(7);\n\n(p) approve the requirements referred to in Article 43(3) with a view tothe accreditation of certification bodies referred to in Article 43;\n\n(q) provide the Commission with an opinion on the certification\n\nrequirements referred to in Article 43(8);\n\n(r) provide the Commission with an opinion on the icons referred to in\n\nArticle 12(7);\n\n(s) provide the Commission with an opinion for the assessment of theadequacy of the level of protection in a third country or international organisation, including for the assessment whether athird country, a territory or one or more specified sectors withinthat third country, or an international organisation no longerensures an adequatetheCommission shall provide the Board with all necessary documentation, including correspondence with the government of the thirdcountry, with regard to that third country, territory or specifiedsector, or with the international organisation.\n\nlevel of protection. To\n\nthat end,\n\n(t)\n\nissue opinions on draft decisions of supervisory authorities pursuantto the consistency mechanism referred to in Article 64(1), onmatters submitted pursuant to Article 64(2) and to issue bindingdecisions pursuant to Article 65, including in cases referred to inArticle 66;\n\n(u) promote the cooperation and the effective bilateral and multilateralexchange of information and best practices between the supervisoryauthorities;\n\n(v) promote common training programmes and facilitate personnelexchanges between the supervisory authorities and, where appropriate, with the supervisory authorities of third countries or withinternational organisations;\n\n(w) promote the exchange of knowledge and documentation on dataprotection legislation and practice with data protection supervisoryauthorities worldwide.\n\n(x) issue opinions on codes of conduct drawn up at Union level\n\npursuant to Article 40(9); and\n\n(y) maintaina publicly accessible electronic register of decisions takenby supervisory authorities and courts on issues handled in theconsistency mechanism.\n\n2. Where the Commission requests advice from the Board, it mayindicate a time limit, taking into account the urgency of the matter.\n\n02016R0679 — EN — 04.05.2016 — 000.002 — 66\n\n▼B\n\n3. The Board shall forward its opinions, guidelines, recommendations, and best practices to the Commission and to the committeereferred to in Article 93 and make them public.\n\n4. The Board shall, where appropriate, consult interested parties andgive them the opportunity to comment within a reasonable period. TheBoard shall, without prejudice to Article 76, make the results of theconsultation procedure publicly available.\n\nArticle 71\n\nReports\n\n1. The Board shall draw up an annual report regarding the protectionof natural persons with regard to processing in the Union and, whererelevant, in third countries and international organisations. The reportshall be made public and be transmitted to the European Parliament, tothe Council and to the Commission.\n\nThe annual report shall include a review of the practical appli 2. cation of the guidelines, recommendations and best practices referred toin point (l) of Article 70(1) as well as of the binding decisions referredto in Article 65.\n\nArticle 72\n\nProcedure\n\nThe Board shall take decisions by a simple majority of its\n\n1. members, unless otherwise provided for in this Regulation.\n\n2. The Board shall adopt its own rules of procedure by a two-thirdsmajority of its members and organise its own operational arrangements.\n\nArticle 73\n\nChair\n\nThe Board shall electa chair and two deputy chairs from amongst\n\n1. its members by simple majority.\n\nThe term of office of the Chair and of the deputy chairs shall be\n\n2. five years and be renewable once.\n\nArticle 74\n\nTasks of the Chair\n\n1.\n\nThe Chair shall have the following tasks:\n\n(a) to convene the meetings of the Board and prepare its agenda;\n\n(b) to notify decisions adopted by the Board pursuant to Article 65 tothe lead supervisory authority and the supervisory authoritiesconcerned;\n\n02016R0679 — EN — 04.05.2016 — 000.002 — 67\n\n▼B\n\n(c) to ensure the timely performance of the tasks of the Board, inparticular in relation to the consistency mechanism referred to inArticle 63.\n\nThe Board shall lay down the allocation of tasks between the\n\n2. Chair and the deputy chairs in its rules of procedure.\n\nArticle 75\n\nSecretariat\n\nThe Board shall have a secretariat, which shall be provided by the\n\n1. European Data Protection Supervisor.\n\nThe secretariat shall perform its tasks exclusively under the\n\n2. instructions of the Chair of the Board.\n\nThe staff of the European Data Protection Supervisor involved in 3. carrying out the tasks conferred on the Board by this Regulation shallbe subject to separate reporting lines from the staff involved in carryingout tasks conferred on the European Data Protection Supervisor.\n\n4. Where appropriate, the Board and the European Data ProtectionSupervisor shall establish and publisha Memorandum of Understandingimplementing this Article, determining the terms of their cooperation, and applicable to the staff of the European Data Protection Supervisorinvolved in carrying out the tasks conferred on the Board by thisRegulation.\n\nThe secretariat shall provide analytical, administrative and\n\n5. logistical support to the Board.\n\n6.\n\nThe secretariat shall be responsible in particular for:\n\n(a) the day-to-day business of the Board;\n\n(b) communication between the members of the Board, its Chair and\n\nthe Commission;\n\n(c) communication with other institutions and the public;\n\n(d) the use of electronic means for\n\nthe\n\ninternal and external\n\ncommunication;\n\n(e) the translation of relevant information;\n\n(f) the preparation and follow-up of the meetings of the Board;\n\n(g) the preparation, drafting and publication of opinions, decisions onthe settlement of disputes between supervisory authorities and othertexts adopted by the Board.\n\n02016R0679 — EN — 04.05.2016 — 000.002 — 68\n\n▼B\n\nArticle 76\n\nConfidentiality\n\n1. The discussions of the Board shall be confidential where theBoard deems it necessary, as provided for in its rules of procedure.\n\nrepresentatives of\n\n2. Access to documents submitted to members of the Board, expertsandshall be governed bythird partiesRegulation (EC) No 1049/2001 of the European Parliament and ofthe Council ( 1 )."
}