{
  "title": "GDPR_CHAPTER_V_organisations",
  "all_text": "CHAPTER V\n\norganisations\n\nArticle 44\n\nGeneral principle for transfers\n\nAny transfer of personal data which are undergoing processing or areintended for processing after transfer to a third country or to an international organisation shall take place only if, subject to the otherprovisions of this Regulation, in thisChapter are complied with by the controller and processor, includingfor onward transfers of personal data from the third country or aninternational organisation to another third country or to another international organisation. All provisions in this Chapter shall be applied inorder to ensure that the level of protection of natural persons guaranteedby this Regulation is not undermined.\n\nthe conditions\n\nlaid down\n\nArticle 45\n\nTransfers on the basis of an adequacy decision\n\n1. A transfer of personal data to a third country or an internationalorganisation may take place where the Commission has decided that thethird country, a territory or one or more specified sectors within thatthird country, or the international organisation in question ensures anadequate level of protection. Such a transfer shall not require anyspecific authorisation.\n\n2. When assessing the adequacy of the level of protection, theCommission shall, in particular, take account of the following elements:\n\n(a) the rule of law, respect for human rights and fundamental freedoms, relevant legislation, both general and sectoral, including concerningpublic security, defence, national security and criminal law and theaccess of public authorities to personal data, as well as the implementation of such legislation, data protection rules, professionalrules and security measures, including rules for the onward transferof personal data to another third country or international organisation which are complied with in that country or internationalorganisation, case-law, as well as effective and enforceable datasubject rights and effective administrative and judicial redress forthe data subjects whose personal data are being transferred;\n\n(b) the existence and effective functioning of one or more independentsupervisory authorities in the third country or to which an international organisation is subject, with responsibility for ensuring andenforcing compliance with the data protection rules, includingadequate enforcement powers, for assisting and advising the datasubjects in exercising their rights and for cooperation with thesupervisory authorities of the Member States; and\n\n02016R0679 — EN — 04.05.2016 — 000.002 — 42\n\n▼B\n\n(c) the international commitments the third country or internationalorganisation concerned has entered into, or other obligationsarising from legally binding conventions or instruments as well asfrom its participation in multilateral or regional systems, inparticular in relation to the protection of personal data.\n\nThe Commission, after assessing the adequacy of the level of 3. protection, may decide, by means of implementing act, that a thirdcountry, a territory or one or more specified sectors within a thirdcountry, or an international organisation ensures an adequate level ofprotection within the meaning of paragraph 2 of this Article. The implementing act shall provide for a mechanism for a periodic review, atleast every four years, which shall take into account all relevant developments in the third country or international organisation. The implementing act shall specify its territorial and sectoral application and, where applicable, identify the supervisory authority or authoritiesreferred to in point (b) of paragraph 2 of this Article. The implementingact shall be adopted in accordance with the examination procedurereferred to in Article 93(2).\n\n4. The Commission shall, on an ongoing basis, monitor developments in third countries and international organisations that couldaffect the functioning of decisions adopted pursuant to paragraph 3 ofthis Article and decisions adopted on the basis of Article 25(6) ofDirective 95/46/EC.\n\nThe Commission shall, where available information reveals, in 5. particular following the review referred to in paragraph 3 of thisArticle, that a third country, a territory or one or more specifiedsectors within a third country, or an international organisation nolonger ensures an adequate level of protection within the meaning ofparagraph 2 of this Article, to the extent necessary, repeal, amend orsuspend the decision referred to in paragraph 3 of this Article by meansof implementing acts without retro-active effect. Those implementingacts shall be adopted in accordance with the examination procedurereferred to in Article 93(2).\n\nOn duly justified imperative grounds of urgency, the Commission shalladopt immediately applicable implementing acts in accordance with theprocedure referred to in Article 93(3).\n\n6. The Commission shall enter into consultations with the thirdcountry or international organisation with a view to remedying thesituation giving rise to the decision made pursuant to paragraph 5.\n\n7. A decision pursuant to paragraph 5 of this Article is withoutprejudice to transfers of personal data to the third country, a territoryor one or more specified sectors within that third country, or the international organisation in question pursuant to Articles 46 to 49.\n\n8. The Commission shall publish in the Official Journal of theEuropean Union and on its website a list of the third countries, territories and specified sectors within a third country and internationalorganisations for which it has decided that an adequate level ofprotection is or is no longer ensured.\n\n02016R0679 — EN — 04.05.2016 — 000.002 — 43\n\n▼B\n\n9. Decisions adopted by the Commission on the basis of Article 25(6) of Directive 95/46/EC shall remain in force until amended, replaced orrepealed by a Commission Decision adopted in accordance withparagraph 3 or 5 of this Article.\n\nArticle 46\n\nTransfers subject to appropriate safeguards\n\n1. In the absence of a decision pursuant to Article 45(3), a controlleror processor may transfer personal data to a third country or an international organisation only if the controller or processor has providedappropriate safeguards, and on condition that enforceable data subjectrights and effective legal remedies for data subjects are available.\n\nThe appropriate safeguards referred to in paragraph 1 may be 2. provided for, without requiring any specific authorisation from a supervisory authority, by:\n\n(a) a legally binding and enforceable instrument between public auth\n\norities or bodies;\n\n(b) binding corporate rules in accordance with Article 47;\n\n(c) standard data protection clauses adopted by the Commission inin\n\nthe examination procedure\n\nreferred\n\nto\n\naccordance withArticle 93(2);\n\n(d) standard data protection clauses adopted by a supervisory authorityand approved by the Commission pursuant to the examinationprocedure referred to in Article 93(2);\n\n(e) an approved code of conduct pursuant to Article 40 together withbinding and enforceable commitments of the controller or processorin the third country to apply the appropriate safeguards, including asregards data subjects' rights; or\n\n(f) an approved certification mechanism pursuant to Article 42 togetherwith binding and enforceable commitments of the controller orprocessor in the third country to apply the appropriate safeguards, including as regards data subjects' rights.\n\n3. Subject to the authorisation from the competent supervisory authority, the appropriate safeguards referred to in paragraph 1 may also beprovided for, in particular, by:\n\n(a) contractual clauses between the controller or processor and thecontroller, processor or the recipient of the personal data in thethird country or international organisation; or\n\n(b) provisions to be inserted into administrative arrangements betweenpublic authorities or bodies which include enforceable and effectivedata subject rights.\n\n4. The supervisory authority shall apply the consistency mechanismreferred to in Article 63 in the cases referred to in paragraph 3 of thisArticle.\n\n02016R0679 — EN — 04.05.2016 — 000.002 — 44\n\n▼B\n\n5. Authorisations by a Member State or supervisory authority on thebasis of Article 26(2) of Directive 95/46/EC shall remain valid untilamended, replaced or repealed, if necessary, by that supervisory authority. Decisions adopted by the Commission on the basis of Article 26(4) of Directive 95/46/EC shall remain in force until amended, replaced orrepealed, if necessary, by a Commission Decision adopted in accordancewith paragraph 2 of this Article.\n\nArticle 47\n\nBinding corporate rules\n\n1. The competent supervisory authority shall approve bindingcorporate rules in accordance with the consistency mechanism set outin Article 63, provided that they:\n\n(a) are legally binding and apply to and are enforced by every memberconcerned of the group of undertakings, or group of enterprisesengaged in a joint economic activity, including their employees;\n\n(b) expressly confer enforceable rights on data subjects with regard to\n\nthe processing of their personal data; and\n\n(c) fulfil the requirements laid down in paragraph 2.\n\nThe binding corporate rules referred to in paragraph 1 shall specify\n\n2. at least:\n\n(a)\n\nthe structure and contact details of the group of undertakings, orgroup of enterprises engaged in a joint economic activity and ofeach of its members;\n\n(b) the data transfers or set of transfers, including the categories ofpersonal data, the type of processing and its purposes, the typeof data subjects affected and the identification of the thirdcountry or countries in question;\n\n(c)\n\ntheir legally binding nature, both internally and externally;\n\n(d) the application of the general data protection principles, inparticular purpose limitation, data minimisation, limited storageperiods, data quality, data protection by design and by default, legal basis for processing, processing of special categories ofpersonal data, measurestherequirements in respect of onward transfers to bodies not boundby the binding corporate rules;\n\nto ensure data security, and\n\n(e)\n\nthe rights of data subjects in regard to processing and the means toexercise those rights, including the right not to be subject todecisions based solely on automated processing, includingprofiling in accordance with Article 22, the right to lodge acomplaint with the competent supervisory authority and beforethe competent courts of the Member States in accordance withArticle 79, and to obtain redress and, where appropriate, compensation for a breach of the binding corporate rules;\n\n02016R0679 — EN — 04.05.2016 — 000.002 — 45\n\n▼B\n\n(f)\n\nthe acceptance by the controller or processor established on theterritory of a Member State of liability for any breaches of thebinding corporate rules by any member concerned not establishedin the Union; the controller or the processor shall be exempt fromthat liability, in whole or in part, only if it proves that that memberis not responsible for the event giving rise to the damage;\n\n(g) how the information on the binding corporate rules, in particular onthe provisions referred to in points (d), (e) and (f) of this paragraphis provided to the data subjects in addition to Articles 13 and 14;\n\n(h) the tasks of any data protection officer designated in accordancewith Article 37 or any other person or entity in charge of themonitoring compliance with the binding corporate rules withinthe group of undertakings, or group of enterprises engaged in ajoint economic activity, as well as monitoring training andcomplaint-handling;\n\n(i)\n\nthe complaint procedures;\n\n(j)\n\nthe mechanisms within the group of undertakings, or group ofenterprises engaged in a joint economic activity for ensuring theverification of compliance with the binding corporate rules. Suchmechanisms shall include data protection audits and methods forensuring corrective actions to protect the rights of the data subject. Results of such verification should be communicated to the personor entity referred to in point (h) and to the board of the controllingundertaking of a group of undertakings, or of the group of enterprises engaged in a joint economic activity, and should be availableupon request to the competent supervisory authority;\n\n(k) the mechanisms for reporting and recording changes to the rules\n\nand reporting those changes to the supervisory authority;\n\n(l)\n\nthe cooperation mechanism with the supervisory authority to ensurecompliance by any member of the group of undertakings, or groupof enterprises engaged in a joint economic activity, in particular bymaking available to the supervisory authority the results of verifications of the measures referred to in point (j);\n\nto\n\n(m) the mechanisms for reporting\n\nthe competent supervisoryauthority any legal requirements to which a member of the groupof undertakings, or group of enterprises engaged in a jointeconomic activity is subject in a third country which are likelyto have a substantial adverse effect on the guarantees providedby the binding corporate rules; and\n\n(n) the appropriate data protection\n\ntraining to personnel having\n\npermanent or regular access to personal data.\n\n3. The Commission may specify the format and procedures for theexchange of information between controllers, processors and supervisory authorities for binding corporate rules within the meaning ofthis Article. Those implementing acts shall be adopted in accordancewith the examination procedure set out in Article 93(2).\n\n02016R0679 — EN — 04.05.2016 — 000.002 — 46\n\n▼B\n\nArticle 48\n\nTransfers or disclosures not authorised by Union law\n\nAny judgment of a court or tribunal and any decision of an administrative authority of a third country requiring a controller or processor totransfer or disclose personal data may only be recognised or enforceablein any manner if based on an international agreement, such as a mutuallegal assistance treaty, in force between the requesting third country andthe Union or a Member State, without prejudice to other grounds fortransfer pursuant to this Chapter.\n\nArticle 49\n\nDerogations for specific situations\n\n1. In the absence of an adequacy decision pursuant to Article 45(3), or of appropriate safeguards pursuant to Article 46, including bindingcorporate rules, a transfer or a set of transfers of personal data to a thirdcountry or an international organisation shall take place only on one ofthe following conditions:\n\n(a) the data subject has explicitly consented to the proposed transfer, after having been informed of the possible risks of such transfers forthe data subject due to the absence of an adequacy decision andappropriate safeguards;\n\n(b) the transfer is necessary for the performance of a contract betweenthe data subject and the controller or the implementation ofpre-contractual measures taken at the data subject's request;\n\n(c) the transfer is necessary for the conclusion or performance of acontract concluded in the interest of the data subject between thecontroller and another natural or legal person;\n\n(d) the transfer is necessary for important reasons of public interest;\n\n(e) the transfer is necessary for the establishment, exercise or defence\n\nof legal claims;\n\n(f) the transfer is necessary in order to protect the vital interests of thedata subject or of other persons, where the data subject is physicallyor legally incapable of giving consent;\n\n(g) the transfer is made from a register which according to Union orMember State law is intended to provide information to the publicand which is open to consultation either by the public in general orby any person who can demonstratea legitimate interest, but only tothe extent that the conditions laid down by Union or Member Statelaw for consultation are fulfilled in the particular case.\n\n▼B\n\n02016R0679 — EN — 04.05.2016 — 000.002 — 47\n\nlimited number of data subjects,\n\nWherea transfer could not be based on a provision in Article 45 or 46, including the provisions on binding corporate rules, and none of thederogations for a specific situation referred to in the first subparagraphof this paragraph is applicable, a transfer to a third country or aninternational organisation may take place only if the transfer is notrepetitive, concerns only aisnecessary for the purposes of compelling legitimate interests pursuedby the controller which are not overridden by the interests or rights andfreedoms of the data subject, and the controller has assessed all thecircumstances surrounding the data transfer and has on the basis ofthat assessment provided suitable safeguards with regard to theprotection of personal data. The controller shall inform the supervisoryauthority of the transfer. The controller shall, in addition to providingthe information referred to in Articles 13 and 14, inform the data subjectof the transfer and on the compelling legitimate interests pursued.\n\n2. A transfer pursuant to point (g) of the first subparagraph ofparagraph 1 shall not involve the entirety of the personal data orentire categories of the personal data contained in the register. Wherethe register is intended for consultation by persons having a legitimateinterest, the transfer shall be made only at the request of those personsor if they are to be the recipients.\n\n3. Points (a), (b) and (c) of the first subparagraph of paragraph 1 andthe second subparagraph thereof shall not apply to activities carried outby public authorities in the exercise of their public powers.\n\n4. The public interest referred to in point (d) of the first subparagraphof paragraph 1 shall be recognised in Union law or in the law of theMember State to which the controller is subject.\n\n5. In the absence of an adequacy decision, Union or Member Statelaw may, for important reasons of public interest, expressly set limits tothe transfer of specific categories of personal data to a third country oraninternational organisation. Member States shall notify suchprovisions to the Commission.\n\n6. The controller or processor shall document the assessment as wellas the suitable safeguards referred to in the second subparagraph ofparagraph 1 of this Article in the records referred to in Article 30.\n\nInternational cooperation for the protection of personal data\n\nArticle 50\n\nIn relation to third countries and international organisations, theCommission and supervisory authorities shall take appropriate steps to:\n\n(a) develop international cooperation mechanisms to facilitate theeffective enforcement of legislation for the protection of personaldata;\n\n(b) provide international mutual assistance in the enforcement of legislation for the protection of personal data, including through notification, complaint referral, investigative assistance and informationexchange, subject to appropriate safeguards for the protection ofpersonal data and other fundamental rights and freedoms;\n\n02016R0679 — EN — 04.05.2016 — 000.002 — 48\n\n▼B\n\n(c) engage relevant stakeholders in discussion and activities aimed atfurthering international cooperation in the enforcement of legislationfor the protection of personal data;\n\n(d) promote\n\nthe exchange and documentation of personal datajurisdictional\n\nlegislation and practice, including on\n\nprotectionconflicts with third countries."
}