{
  "title": "GDPR_CHAPTER_III_Rights_of_the_data_subject",
  "all_text": "CHAPTER III\n\nRights of the data subject\n\nS e c t i o n 1\n\nT r a n s p a r e n c y a n d m o d a l i t i e s\n\nArticle 12\n\nTransparent information, communication and modalities for theexercise of the rights of the data subject\n\nThe controller shall take appropriate measures to provide any 1. information referred to in Articles 13 and 14 and any communicationunder Articles 15 to 22 and 34 relating to processing to the data subjectin a concise, transparent, intelligible and easily accessible form, usingclear and plain language, in particular for any information addressedspecifically to a child. The information shall be provided in writing, orby other means, including, where appropriate, by electronic means. When requested by the data subject, the information may be providedorally, provided that the identity of the data subject is proven by othermeans.\n\n2. The controller shall facilitate the exercise of data subject rightsunder Articles 15 to 22. In the cases referred to in Article 11(2), thecontroller shall not refuse to act on the request of the data subject forexercising his or her rights under Articles 15 to 22, unless the controllerdemonstrates that it is not in a position to identify the data subject.\n\n3. The controller shall provide information on action taken on arequest under Articles 15 to 22 to the data subject without unduedelay and in any event within one month of receipt of the request. That period may be extended by two further months where necessary, taking into account the complexity and number of the requests. Thecontroller shall inform the data subject of any such extension withinone month of receipt of the request, together with the reasons for thedelay. Where the data subject makes the request by electronic formmeans, the information shall be provided by electronic means wherepossible, unless otherwise requested by the data subject.\n\n▼B\n\n02016R0679 — EN — 04.05.2016 — 000.002 — 13\n\n4. If the controller does not take action on the request of the datasubject, the controller shall inform the data subject without delay and atthe latest within one month of receipt of the request of the reasons fornot taking action and on the possibility of lodging a complaint with asupervisory authority and seeking a judicial remedy.\n\n5. Information provided under Articles 13 and 14 and any communication and any actions taken under Articles 15 to 22 and 34 shall beprovided free of charge. Where requests from a data subject are manifestly unfounded or excessive, in particular because of their repetitivecharacter, the controller may either:\n\n(a) charge a reasonable fee taking into account the administrative costsof providing the information or communication or taking the actionrequested; or\n\n(b) refuse to act on the request.\n\nThe controller shall bear the burden of demonstrating the manifestlyunfounded or excessive character of the request.\n\nthe controller has 6. Without prejudicereasonable doubts concerningthe natural personthemaking the request referred to in Articles 15 to 21, the controllermay request the provision of additional information necessary toconfirm the identity of the data subject.\n\nto Article 11, whereidentity of\n\nThe information to be provided to data subjects pursuant to 7. Articles 13 and 14 may be provided in combination with standardisedicons in order to give in an easily visible, intelligible and clearly legiblemanner a meaningful overview of the intended processing. Where theicons are presented electronically they shall be machine-readable.\n\n8. The Commission shall be empowered to adopt delegated acts inaccordance with Article 92 for the purpose of determining theinformation to be presented by the icons and the procedures forproviding standardised icons.\n\nS e c t i o n 2\n\nI n f o r m a t i o n a n d a c c e s s t o p e r s o n a l d a t a\n\nArticle 13\n\nInformation to be provided where personal data are collected fromthe data subject\n\n1. Where personal data relating to a data subject are collected fromthe data subject, the controller shall, at the time when personal data areobtained, provide the data subject with all of the following information:\n\n(a) the identity and the contact details of the controller and, where\n\napplicable, of the controller's representative;\n\n(b) the contact details of the data protection officer, where applicable;\n\n(c) the purposes of the processing for which the personal data are\n\nintended as well as the legal basis for the processing;\n\n02016R0679 — EN — 04.05.2016 — 000.002 — 14\n\n▼B\n\n(d) where the processing is based on point (f) of Article 6(1), thelegitimate interests pursued by the controller or by a third party;\n\n(e) the recipients or categories of recipients of the personal data, if any;\n\n(f) where applicable, the fact that the controller intends to transferpersonal data to a third country or international organisation andthe existence or absence of an adequacy decision bytheCommission, or in the case of transfers referred to in Article 46 or 47, or the second subparagraph of Article 49(1), reference to theappropriate or suitable safeguards and the means by which to obtaina copy of them or where they have been made available.\n\n2. In addition to the information referred to in paragraph 1, thecontroller shall, at the time when personal data are obtained, providethe data subject with the following further information necessary toensure fair and transparent processing:\n\n(a) the period for which the personal data will be stored, or if that is not\n\npossible, the criteria used to determine that period;\n\n(b) the existence of the right to request from the controller access toand rectification or erasure of personal data or restriction ofprocessing concerning the data subject or to object to processingas well as the right to data portability;\n\n(c) where the processing is based on point (a) of Article 6(1) orpoint (a) of Article 9(2), the existence of the right to withdrawconsent at any time, without affecting the lawfulness of processingbased on consent before its withdrawal;\n\n(d) the right to lodge a complaint with a supervisory authority;\n\n(e) whether the provision of personal data is a statutory or contractualrequirement, or a requirement necessary to enter into a contract, aswell as whether the data subject is obliged to provide the personaldata and of the possible consequences of failure to provide suchdata;\n\n(f) the existence of automated decision-making, including profiling, referred to in Article 22(1) and (4) and, at least in those cases, meaningful information about the logic involved, as well as thesignificance and the envisaged consequences of such processingfor the data subject.\n\n3. Where the controller intends to further process the personal datafora purpose other than that for which the personal data were collected, the controller shall provide the data subject prior to that furtherprocessing with information on that other purpose and with anyrelevant further information as referred to in paragraph 2.\n\nParagraphs 1, 2 and 3 shall not apply where and insofar as the\n\n4. data subject already has the information.\n\n▼B\n\n02016R0679 — EN — 04.05.2016 — 000.002 — 15\n\nArticle 14\n\nInformation to be provided where personal data have not beenobtained from the data subject\n\n1. Where personal data have not been obtained from the data subject, the controller shall provide the data subject with the followinginformation:\n\n(a) the identity and the contact details of the controller and, where\n\napplicable, of the controller's representative;\n\n(b) the contact details of the data protection officer, where applicable;\n\n(c) the purposes of the processing for which the personal data are\n\nintended as well as the legal basis for the processing;\n\n(d) the categories of personal data concerned;\n\n(e) the recipients or categories of recipients of the personal data, if any;\n\n(f) where applicable, that the controller intends to transfer personal datatoa recipient in a third country or international organisation and theexistence or absence of an adequacy decision by the Commission, or in the case of transfers referred to in Article 46 or 47, or thesecond subparagraph of Article 49(1), reference to the appropriateor suitable safeguards and the means to obtain a copy of them orwhere they have been made available.\n\n2. In addition to the information referred to in paragraph 1, thecontroller shall provide the data subject with the following informationnecessary to ensure fair and transparent processing in respect of the datasubject:\n\n(a) the period for which the personal data will be stored, or if that is not\n\npossible, the criteria used to determine that period;\n\n(b) where the processing is based on point (f) of Article 6(1), thelegitimate interests pursued by the controller or by a third party;\n\n(c) the existence of the right to request from the controller access toand rectification or erasure of personal data or restriction ofprocessing concerning the data subject and to object to processingas well as the right to data portability;\n\n(d) where processing is based on point (a) of Article 6(1) or point (a) ofArticle 9(2), the existence of the right to withdraw consent at anytime, without affecting the lawfulness of processing based onconsent before its withdrawal;\n\n(e) the right to lodge a complaint with a supervisory authority;\n\n(f) from which source the personal data originate, and if applicable,\n\nwhether it came from publicly accessible sources;\n\n(g) the existence of automated decision-making, including profiling, referred to in Article 22(1) and (4) and, at least in those cases, meaningful information about the logic involved, as well as thesignificance and the envisaged consequences of such processingfor the data subject.\n\n▼B\n\n02016R0679 — EN — 04.05.2016 — 000.002 — 16\n\nThe controller shall provide the information referred to in para\n\n3. graphs 1 and 2:\n\n(a) within a reasonable period after obtaining the personal data, but atthe latest within one month, having regard to the specific circumstances in which the personal data are processed;\n\n(b) if the personal data are to be used for communication with the datasubject, at the latest at the time of the first communication to thatdata subject; or\n\n(c) if a disclosure to another recipient is envisaged, at the latest when\n\nthe personal data are first disclosed.\n\n4. Where the controller intends to further process the personal datafora purpose other than that for which the personal data were obtained, the controller shall provide the data subject prior to that furtherprocessing with information on that other purpose and with anyrelevant further information as referred to in paragraph 2.\n\n5.\n\nParagraphs 1 to 4 shall not apply where and insofar as:\n\n(a) the data subject already has the information;\n\n(b) the provision of such information proves impossible or wouldinvolve a disproportionate effort, in particular for processing forarchiving purposes in the public interest, scientific or historicalresearch purposes or statistical purposes, subject to the conditionsand safeguards referred to in Article 89(1) or in so far as theobligation referred to in paragraph 1 of this Article is likely torender impossible or seriously impair the achievement of theobjectives of that processing. In such cases the controller shalltake appropriate measures to protect the data subject's rights andfreedoms and legitimate interests, including making the informationpublicly available;\n\n(c) obtaining or disclosure is expressly laid down by Union orMember State law to which the controller is subject and whichprovides appropriate measures to protect the data subject's legitimateinterests; or\n\n(d) where the personal data must remain confidential subject to anregulated by Union or\n\nobligation of professional secrecyMember State law, including a statutory obligation of secrecy.\n\nArticle 15\n\nRight of access by the data subject\n\n1. The data subject shall have the right to obtain from the controllerconfirmation as to whether or not personal data concerning him or herare being processed, and, where that is the case, access to the personaldata and the following information:\n\n(a) the purposes of the processing;\n\n(b) the categories of personal data concerned;\n\n(c) the recipients or categories of recipient to whom the personal datahave been or will be disclosed, in particular recipients in thirdcountries or international organisations;\n\n▼B\n\n02016R0679 — EN — 04.05.2016 — 000.002 — 17\n\n(d) where possible, the envisaged period for which the personal datawill be stored, or, if not possible, the criteria used to determine thatperiod;\n\n(e) the existence of the right to request from the controller rectificationor erasure of personal data or restriction of processing of personaldata concerning the data subject or to object to such processing;\n\n(f) the right to lodge a complaint with a supervisory authority;\n\n(g) where the personal data are not collected from the data subject, any\n\navailable information as to their source;\n\n(h) the existence of automated decision-making, including profiling, referred to in Article 22(1) and (4) and, at least in those cases, meaningful information about the logic involved, as well as thesignificance and the envisaged consequences of such processingfor the data subject.\n\n2. Where personal data are transferred to a third country or to aninternational organisation, the data subject shall have the right to beinformed of the appropriate safeguards pursuant to Article 46 relatingto the transfer.\n\nThe controller shall provide a copy of\n\nthe personal data 3. undergoing processing. For any further copies requested by the datasubject, the controller may charge a reasonable fee based on administrative costs. Where the data subject makes the request by electronicmeans, and unless otherwise requested by the data subject, theinformation shall be provided in a commonly used electronic form.\n\nThe right to obtain a copy referred to in paragraph 3 shall not\n\n4. adversely affect the rights and freedoms of others.\n\nS e c t i o n 3\n\nR e c t i f i c a t i o n a n d e r a s u r e\n\nArticle 16\n\nRight to rectification\n\nThe data subject shall have the right to obtain from the controllerwithout undue delay the rectification of inaccurate personal dataconcerning him or her. Taking into account the purposes of theprocessing, the data subject shall have the right to have incompletepersonal data completed, including by means of providing a supplementary statement.\n\nArticle 17\n\nRight to erasure (‘right to be forgotten’)\n\nThe data subject shall have the right to obtain from the controller 1. the erasure of personal data concerning him or her without undue delayand the controller shall have the obligation to erase personal datawithout undue delay where one of the following grounds applies:\n\n(a) the personal data are no longer necessary in relation to the purposes\n\nfor which they were collected or otherwise processed;\n\n▼B\n\n02016R0679 — EN — 04.05.2016 — 000.002 — 18\n\n(b) the data subject withdraws consent on which the processing is basedaccording to point (a) of Article 6(1), or point (a) of Article 9(2), and where there is no other legal ground for the processing;\n\n(c) the data subject objects to the processing pursuant to Article 21(1) and there are no overriding legitimate grounds for the processing, orthe data subject objects to the processing pursuant to Article 21(2);\n\n(d) the personal data have been unlawfully processed;\n\n(e) the personal data have to be erased for compliance with a legalobligation in Union or Member State law to which the controlleris subject;\n\n(f) the personal data have been collected in relation to the offer of\n\ninformation society services referred to in Article 8(1).\n\n2. Where the controller has made the personal data public and isobliged pursuant to paragraph 1 to erase the personal data, thecontroller, taking account of available technology and the cost of implementation, shall take reasonable steps, including technical measures, toinform controllers which are processing the personal data that the datasubject has requested the erasure by such controllers of any links to, orcopy or replication of, those personal data.\n\nParagraphs 1 and 2 shall not apply to the extent that processing is\n\n3. necessary:\n\n(a) for exercising the right of freedom of expression and information;\n\n(b) for compliance with a legal obligation which requires processing byUnion or Member State law to which the controller is subject or forthe performance of a task carried out in the public interest or in theexercise of official authority vested in the controller;\n\n(c) for reasons of public interest in the area of public health inaccordance with points (h) and (i) of Article 9(2) as well asArticle 9(3);\n\n(d) for archiving purposes in the public interest, scientific or historicalresearch purposes or statistical purposesin accordance withArticle 89(1) in so far as the right referred to in paragraph 1 islikely to render impossible or seriously impair the achievement ofthe objectives of that processing; or\n\n(e) for the establishment, exercise or defence of legal claims.\n\nArticle 18\n\nRight to restriction of processing\n\nThe data subject shall have the right to obtain from the controller\n\n1. restriction of processing where one of the following applies:\n\n(a) the accuracy of the personal data is contested by the data subject, for a period enabling the controller to verify the accuracy of thepersonal data;\n\n02016R0679 — EN — 04.05.2016 — 000.002 — 19\n\n▼B\n\n(b) the processing is unlawful and the data subject opposes the erasureof the personal data and requests the restriction of their use instead;\n\n(c) the controller no longer needs the personal data for the purposes ofthe processing, but they are required by the data subject for theestablishment, exercise or defence of legal claims;\n\n(d) the data subject has objected to processing pursuant to Article 21(1) pending the verification whether the legitimate grounds of thecontroller override those of the data subject.\n\n2. Where processing has been restricted under paragraph 1, suchpersonal data shall, with the exception of storage, only be processedwith the data subject's consent or for the establishment, exercise ordefence of legal claims or for the protection of the rights of anothernatural or legal person or for reasons of important public interest of theUnion or of a Member State.\n\n3. A data subject who has obtained restriction of processing pursuantto paragraph 1 shall be informed by the controller before the restrictionof processing is lifted.\n\nArticle 19\n\nNotification obligation regarding rectification or erasure of personaldata or restriction of processing\n\nThe controller shall communicate any rectification or erasure of personaldata or restriction of processing carried out in accordance withArticle 16, Article 17(1) and Article 18 to each recipient to whomthe personal data have been disclosed, unless this proves impossibleor involves disproportionate effort. The controller shall inform thedata subject about those recipients if the data subject requests it.\n\nArticle 20\n\nRight to data portability\n\n1. The data subject shall have the right to receive the personal dataconcerning him or her, which he or she has provided to a controller, ina structured, commonly used and machine-readable format and have theright to transmit those data to another controller without hindrance fromthe controller to which the personal data have been provided, where:\n\n(a) the processing is based on consent pursuant to point (a) ofArticle 6(1) or point (a) of Article 9(2) or on a contract pursuantto point (b) of Article 6(1); and\n\n(b) the processing is carried out by automated means.\n\n2. In exercising his or her right to data portability pursuant toparagraph 1, the data subject shall have the right to have the personaldata transmitted directly from one controller to another, where technically feasible.\n\n02016R0679 — EN — 04.05.2016 — 000.002 — 20\n\n▼B\n\n3. The exercise of the right referred to in paragraph 1 of this Articleshall be without prejudice to Article 17. That right shall not apply toprocessing necessary for the performance of a task carried out in thepublic interest or in the exercise of official authority vested in thecontroller.\n\nThe right referred to in paragraph 1 shall not adversely affect the\n\n4. rights and freedoms of others.\n\nS e c t i o n 4\n\nR i g h t\n\nt o\n\no b j e c t\n\na n d\n\na u t o m a t e d\n\ni n d i v i d u a l\n\nd e c i s i o n - m a k i n g\n\nArticle 21\n\nRight to object\n\n1. The data subject shall have the right to object, on grounds relatingto his or her particular situation, at any time to processing of personaldata concerning him or her which is based on point (e) or (f) ofArticle 6(1), including profiling based on those provisions. Thecontroller shall no longer process the personal data unless the controllerdemonstrates compelling legitimate grounds for the processing whichoverride the interests, rights and freedoms of the data subject or for theestablishment, exercise or defence of legal claims.\n\n2. Where personal data are processed for direct marketing purposes, the data subject shall have the right to object at any time to processingof personal data concerning him or her for such marketing, whichincludes profiling to the extent that it is related to such direct marketing.\n\n3. Where the data subject objects to processing for direct marketingpurposes, the personal data shall no longer be processed for suchpurposes.\n\n4. At the latest at the time of the first communication with the datasubject, the right referred to in paragraphs 1 and 2 shall be explicitlybrought to the attention of the data subject and shall be presented clearlyand separately from any other information.\n\n5. In the context of the use of information society services, andnotwithstanding Directive 2002/58/EC, the data subject may exercisehis or her right to object by automated means using technicalspecifications.\n\n6. Where personal data are processed for scientific or historicalresearch purposes or statistical purposes pursuant to Article 89(1), thedata subject, on grounds relating to his or her particular situation, shallhave the right to object to processing of personal data concerning himor her, unless the processing is necessary for the performance of a taskcarried out for reasons of public interest.\n\n▼B\n\n02016R0679 — EN — 04.05.2016 — 000.002 — 21\n\nAutomated individual decision-making, including profiling\n\nArticle 22\n\n1. The data subject shall have the right not to be subject to a decisionbased solely on automated processing, including profiling, whichproduces legal effects concerning him or her or similarly significantlyaffects him or her.\n\n2.\n\nParagraph 1 shall not apply if the decision:\n\n(a) is necessary for entering into, or performance of, a contract between\n\nthe data subject and a data controller;\n\n(b) is authorised by Union or Member State law to which the controlleris subject and which also lays down suitable measures to safeguardthe data subject's rights and freedoms and legitimate interests; or\n\n(c) is based on the data subject's explicit consent.\n\n3. In the cases referred to in points (a) and (c) of paragraph 2, thedata controller shall implement suitable measures to safeguard the datasubject's rights and freedoms and legitimate interests, at least the right toobtain human intervention on the part of the controller, to express his orher point of view and to contest the decision.\n\n4. Decisions referred to in paragraph 2 shall not be based on specialcategories of personal data referred to in Article 9(1), unless point (a) or (g) of Article 9(2) applies and suitable measures to safeguard the datasubject's rights and freedoms and legitimate interests are in place.\n\nS e c t i o n 5\n\nR e s t r i c t i o n s\n\nArticle 23\n\nRestrictions\n\n1. Union or Member State law to which the data controller orprocessor is subject may restrict by way of a legislative measure thescope of the obligations and rights provided for in Articles 12 to 22 andArticle 34, as well as Article 5 in so far as its provisions correspond tothe rights and obligations provided for in Articles 12 to 22, when such arestriction respects the essence of the fundamental rights and freedomsand is a necessary and proportionate measure in a democratic society tosafeguard:\n\n(a) national security;\n\n(b) defence;\n\n(c) public security;\n\n(d) the prevention, investigation, detection or prosecution of criminaloffences or the execution of criminal penalties, including the safeguarding against and the prevention of threats to public security;\n\n▼B\n\n02016R0679 — EN — 04.05.2016 — 000.002 — 22\n\n(e) other important objectives of general public interest of the Union orof a Member State, in particular an important economic or financialinterest of the Union or of a Member State, including monetary, budgetary and taxation a matters, public health and social security;\n\n(f) the protection of judicial independence and judicial proceedings;\n\n(g) the prevention, investigation, detection and prosecution of breaches\n\nof ethics for regulated professions;\n\n(h) a monitoring, inspection or regulatory function connected, evenoccasionally, to the exercise of official authority in the casesreferred to in points (a) to (e) and (g);\n\n(i) the protection of the data subject or the rights and freedoms of\n\nothers;\n\n(j) the enforcement of civil law claims.\n\nIn particular, any legislative measure referred to in paragraph 1\n\n2. shall contain specific provisions at least, where relevant, as to:\n\n(a) the purposes of the processing or categories of processing;\n\n(b) the categories of personal data;\n\n(c) the scope of the restrictions introduced;\n\n(d) the safeguards to prevent abuse or unlawful access or transfer;\n\n(e) the specification of the controller or categories of controllers;\n\n(f) the storage periods and the applicable safeguards taking intoaccount the nature, scope and purposes of the processing orcategories of processing;\n\n(g) the risks to the rights and freedoms of data subjects; and\n\n(h) the right of data subjects to be informed about the restriction, unless\n\nthat may be prejudicial to the purpose of the restriction."
}