{
  "title": "PRIVACY_ACT_CONFIDENTIALITY",
  "all_text": "ConfidentialitySubject to this Act, the Privacy Commissioner and every person acting on behalf or under the direction of theCommissioner shall not disclose any information thatcomes to their knowledge in the performance of their duties and functions under this Act. 1980-81-82-83, c. 111, Sch. II “63”. Disclosure authorized 64 (1) The Privacy Commissioner may disclose or mayauthorize any person acting on behalf or under the direction of the Commissioner to disclose information (a) that, in the opinion of the Commissioner, is necessary to (i) carry out an investigation under this Act, or (ii) establish the grounds for findings and recommendations contained in any report under this Act; or (b) in the course of a prosecution for an offence underthis Act, a prosecution for an offence under section 131 of the Criminal Code (perjury) in respect of astatement made under this Act or a review before theCurrent to December 10, 2025 40 Last amended on June 2, 2025\n\nPrivacyOffice of the Privacy CommissionerGeneralSections 64-66 Court under this Act or Part 1 of the Access to Information Act or an appeal from a review of that Court. Disclosure of offence authorized (2) The Privacy Commissioner may disclose to the Attorney General of Canada information relating to the commission of an offence againsta law of Canada or aprovince by a director, an officer or an employee of a government institution if, in the Commissioner’s opinion, there is evidence of such an offence. Provision of information (3) The Privacy Commissioner may disclose or may authorize any person acting on behalf or under the direction of the Commissioner to disclose — to the extent thatthe Commissioner or the authorized person, as the casemay be, considers necessary for the purpose of subsection 37(5) — information concerning the Commissioner’sactivities under subsection 37(1) to the National Securityand Intelligence Review Agency. R.S., 1985, c. P-21, s. 64; R.S., 1985, c. 27 (1st Supp.), s. 187; 2006, c. 9, s. 186; 2019, c. 13, s. 37.2; 2019, c. 18, s. 52. Information not to be disclosed 65 In carrying out an investigation under this Act, in notifying an individual of a disclosure under subsection 8(5) and in any report made to Parliament under section 38 or 39, the Privacy Commissioner and every person acting onbehalf or under the direction of the Privacy Commissioner shall take every reasonable precaution to avoid the disclosure of, and shall not disclose, (a) any information that the head of a government institution would be authorized to refuse to disclose if itwere requested under subsection 12(1) or contained ina record requested under the Access to InformationAct; or (b) any information as to whether personal information exists where the head of a government institution, in refusing to disclose the personal information underthis Act, does not indicate whether it exists. 1980-81-82-83, c. 111, Sch. II “65”. No summonsThe Privacy Commissioner or any person acting onbehalf or under the direction of the Commissioner is nota competent or compellable witness, in respect of anymatter coming to the knowledge of the Commissioner orthat person as a result of performing any duties or functions under this Act, in any proceeding other than aCurrent to December 10, 2025 41 Last amended on June 2, 2025\n\nPrivacyOffice of the Privacy CommissionerGeneralSections 66-68 prosecution for an offence under this Act, a prosecutionfor an offence under section 131 of the Criminal Code (perjury) in respect of a statement made under this Act, areview before the Court under this Act or an appeal froma review of that Court. R.S., 1985, c. P-21, s. 66; R.S., 1985, c. 27 (1st Supp.), s. 187; 2019, c. 18, s. 53. For greater certainty 66.1 For greater certainty, sections 63 and 66 apply ifthe Privacy Commissioner is consulted by the Information Commissioner under subsection 36(1.1) or section 36.2 of the Access to Information Act. 2019, c. 18, s. 53. Protection of Privacy Commissioner 67 (1) No criminal or civil proceedings lie against thePrivacy Commissioner, or against any person acting onbehalf or under the direction of the Commissioner, foranything done, reported or said in good faith in thecourse of the exercise or performance or purported exercise or performance of any power, duty or function of theCommissioner under this Act. Libel or slander (2) For the purposes of any law relating to libel or slander, (a) anything said, any information supplied or anydocument or thing produced in good faith in thecourse of an investigation carried out by or on behalfof the Privacy Commissioner under this Act is privileged; andany report made in good faith by the Privacy Com- (b) missioner under this Act and any fair and accurate account of the report made in good faith in a newspaperor any other periodical publication or in a broadcast isprivileged. 1980-81-82-83, c. 111, Sch. II “67”."
}