{
  "title": "PRIVACY_ACT_INVESTIGATIONS",
  "all_text": "InvestigationsNotice of intention to investigateBefore commencing an investigation of a complaintunder this Act, the Privacy Commissioner shall notify thehead of the government institution concerned of the intention to carry out the investigation and shall inform thehead of the institution of the substance of the complaint. 1980-81-82-83, c. 111, Sch. II “31”. Regulation of procedure 32 Subject to this Act, the Privacy Commissioner maydetermine the procedure to be followed in the performance of any duty or function of the Commissioner under this Act. 1980-81-82-83, c. 111, Sch. II “32”. Investigations in private 33 (1) Every investigation of a complaint under this Actby the Privacy Commissioner shall be conducted in private. Right to make representation (2) In the course of an investigation of a complaint underthis Act by the Privacy Commissioner, the person whomade the complaint and the head of the government institution concerned shall be given an opportunity tomake representations to the Commissioner, but no one isentitled as of right to be present during, to have access toCurrent to December 10, 2025 25 Last amended on June 2, 2025\n\nPrivacyInvestigationsSections 33-34 or to comment on representations made to the Commissioner by any other person. 1980-81-82-83, c. 111, Sch. II “33”. Powers of Privacy Commissioner in carrying outinvestigationsThe Privacy Commissioner has, in relation to the 34 (1) carrying out of the investigation of any complaint underthis Act, powerto summon and enforce the appearance of persons (a) before the Privacy Commissioner and compel them togive oral or written evidence on oath and to producesuch documents and things as the Commissionerdeems requisite to the full investigation and consideration of the complaint, in the same manner and to thesame extent as a superior court of record; (b) to administer oaths; (c) to receive and accept such evidence and other information, whether on oath or by affidavit or otherwise, as the Privacy Commissioner sees fit, whether ornot the evidence or information is or would be admissible in a court of law; to enter any premises occupied by any government (d) institution on satisfying any security requirements ofthe institution relating to the premises; (e) to converse in private with any person in anypremises entered pursuant to paragraph (d) and otherwise carry out therein such inquiries within the authority of the Privacy Commissioner under this Act asthe Commissioner sees fit; and (f) to examine or obtain copies of or extracts frombooks or other records found in any premises enteredpursuant to paragraph (d) containing any matter relevant to the investigation. Access to information (2) Despite any other Act of Parliament, any privilegeunder the law of evidence, solicitor-client privilege or theprofessional secrecy of advocates and notaries and litigation privilege, and subject to subsection (2.1), the PrivacyCommissioner may, during the investigation of any complaint under this Act, examine any information recordedin any form under the control of a government institution, other than a confidence of the Queen’s Privy Council for Canada to which subsection 70(1) applies, and noinformation that the Commissioner may examine underthis subsection may be withheld from the Commissioneron any grounds. Current to December 10, 2025 26 Last amended on June 2, 2025\n\nPrivacyInvestigationsSections 34-35 Protected information — solicitors, advocates andnotaries (2.1) The Privacy Commissioner may examine information that is subject to solicitor-client privilege or the professional secrecy of advocates and notaries or to litigationprivilege only if the head of a government institution refuses to disclose the information under section 27. For greater certainty (2.2) For greater certainty, the disclosure by the head ofa government institution to the Privacy Commissioner ofinformation that is subject to solicitor-client privilege orthe professional secrecy of advocates and notaries or tolitigation privilege does not constitutea waiver of thoseprivileges or that professional secrecy. Evidence in other proceedings (3) Except in a prosecution of a person for an offence under section 131 of the Criminal Code (perjury) in respectofa statement made under this Act, in a prosecution foran offence under this Act or in a review before the Courtunder this Act or an appeal therefrom, evidence given bya person in proceedings under this Act and evidence ofthe existence of the proceedings is inadmissible againstthat person in a court or in any other proceedings. Witness fees (4) Any person summoned to appear before the PrivacyCommissioner pursuant to this section is entitled in thediscretion of the Commissioner to receive the like feesand allowances for so doing as if summoned to attend before the Federal Court. Return of documents, etc. (5) Any document or thing produced pursuant to thissection by any person or government institution shall bereturned by the Privacy Commissioner within ten daysaftera request is made to the Commissioner by that person or government institution, but nothing in this subsection precludes the Commissioner from again requiringits production in accordance with this section. R.S., 1985, c. P-21, s. 34; R.S., 1985, c. 27 (1st Supp.), s. 187; 2019, c. 18, s. 50. Findings and recommendations of PrivacyCommissionerIf, on investigatinga complaint under this Act in 35 (1) respect of personal information, the Privacy Commissioner finds that the complaint is well-founded, the Commissioner shall provide the head of the government institution that has control of the personal information with areport containingCurrent to December 10, 2025 27 Last amended on June 2, 2025\n\nPrivacyInvestigationsSection 35 (a) the findings of the investigation and any recommendations that the Commissioner considers appropriate; and (b) where appropriate, a request that, withina timespecified therein, notice be given to the Commissionerof any action taken or proposed to be taken to implement the recommendations contained in the report orreasons why no such action has been or is proposed tobe taken. Report to complainant (2) The Privacy Commissioner shall, after investigating acomplaint under this Act, report to the complainant theresults of the investigation, but wherea notice has beenrequested under paragraph (1)(b) no report shall bemade under this subsection until the expiration of thetime within which the notice is to be given to the Commissioner. Matter to be included in report to complainantWherea notice has been requested under paragraph (3) (1)(b) but no such notice is received by the Commissioner within the time specified therefor or the action described in the notice is, in the opinion of the Commissioner, inadequate or inappropriate or will not be takenina reasonable time, the Commissioner shall so advisethe complainant in his report under subsection (2) andmay include in the report such comments on the matteras he thinks fit. Access to be given (4) Where, pursuant to a request under paragraph (1)(b), the head of a government institution gives notice to thePrivacy Commissioner that access to personal information will be given to a complainant, the head of the institution shall give the complainant access to the information forthwith on giving the notice. Right of review (5) Where, following the investigation of a complaint relating to a refusal to give access to personal informationunder this Act, access is not given to the complainant, thePrivacy Commissioner shall inform the complainant thatthe complainant has the right to apply to the Court for areview of the matter investigated. 1980-81-82-83, c. 111, Sch. II “35”. Current to December 10, 2025 28 Last amended on June 2, 2025\n\nPrivacy"
}