{
  "title": "PRIVACY_ACT_DESIGNATION",
  "all_text": "DesignationPower to designate Minister 3.1 (1) The Governor in Council may designatea member of the Queen’s Privy Council for Canada to be theMinister for the purposes of any provision of this Act. Current to December 10, 2025 4 Last amended on June 2, 2025\n\nPrivacyDesignationSections 3.1-6 Power to designate headThe Governor in Council may, by order, designatea (2) person to be the head of a government institution, otherthana department or ministry of state, for the purposesof this Act. 2006, c. 9, s. 182. Collection, Retention andDisposal of PersonalInformationCollection of personal informationNo personal information shall be collected by a government institution unless it relates directly to an operating program or activity of the institution. 1980-81-82-83, c. 111, Sch. II “4”. Personal information to be collected directlyA government institution shall, wherever possible, 5 (1) collect personal information that is intended to be usedfor an administrative purpose directly from the individual to whom it relates except where the individual authorizes otherwise or where personal information may bedisclosed to the institution under subsection 8(2). Individual to be informed of purposeA government institution shall inform any individual (2) from whom the institution collects personal informationabout the individual of the purpose for which the information is being collected. ExceptionSubsections (1) and (2) do not apply where compli- (3) ance therewith might (a) result in the collection of inaccurate information; or (b) defeat the purpose or prejudice the use for whichinformation is collected. 1980-81-82-83, c. 111, Sch. II “5”. Retention of personal information used for anadministrative purposePersonal information that has been used by a gov6 (1) ernment institution for an administrative purpose shallbe retained by the institution for such period of time after it is so used as may be prescribed by regulation in order to ensure that the individual to whom it relates has areasonable opportunity to obtain access to the information. Current to December 10, 2025 5 Last amended on June 2, 2025\n\nPrivacyCollection, Retention and Disposal of Personal InformationSections 6-8 Accuracy of personal informationA government institution shall take all reasonable (2) steps to ensure that personal information that is used foran administrative purpose by the institution is as accurate, up-to-date and complete as possible. Disposal of personal information (3) A government institution shall dispose of personalinformation under the control of the institution in accordance with the regulations and in accordance with anydirectives or guidelines issued by the designated ministerin relation to the disposal of that information. 1980-81-82-83, c. 111, Sch. II “6”. Protection of PersonalInformationUse of personal information 7 Personal information under the control of a government institution shall not, without the consent of the individual to whom it relates, be used by the institution except (a) for the purpose for which the information was obtained or compiled by the institution or for a use consistent with that purpose; or (b) for a purpose for which the information may bedisclosed to the institution under subsection 8(2). 1980-81-82-83, c. 111, Sch. II “7”. Disclosure of personal information 8 (1) Personal information under the control of a government institution shall not, without the consent of theindividual to whom it relates, be disclosed by the institution except in accordance with this section. Where personal information may be disclosed (2) Subject to any other Act of Parliament, personal information under the control of a government institutionmay be disclosed (a) for the purpose for which the information was obtained or compiled by the institution or for a use consistent with that purpose; (b) for any purpose in accordance with any Act of Parliament or any regulation made thereunder that authorizes its disclosure; (c) for the purpose of complying with a subpoena orwarrant issued or order made by a court, person orbody with jurisdiction to compel the production ofCurrent to December 10, 2025 6 Last amended on June 2, 2025\n\nPrivacyProtection of Personal InformationSection 8 information or for the purpose of complying with rulesof court relating to the production of information; (d) to the Attorney General of Canada for use in legalproceedings involving the Crown in right of Canada orthe Government of Canada; (e) to an investigative body specified in the regulations, on the written request of the body, for the purpose of enforcing any law of Canada or a province orcarrying out a lawful investigation, if the request specifies the purpose and describes the information to bedisclosed; (f) for the purpose of administering or enforcing anylaw or carrying out a lawful investigation, under anagreement or arrangement between the Governmentof Canada or any of its institutions and any of the following entities or any of their institutions: (i) the government of a foreign state, (ii) an international organization of states or an international organization established by the governments of states, (iii) the government of a province, (iv) the council of the Westbank First Nation, the council of a participating First Nation as (v) defined in subsection 2(1) of the First Nations Jurisdiction over Education in British Columbia Act, the council of a participating First Nation as (vi) defined in section 2 of the Anishinabek Nation Education Agreement Act, a First Nation Government or the Anishin- (vii) abek Nation Government, as defined in section 2 of the Anishinabek Nation Governance AgreementAct, or an Anishinaabe Institution, within themeaning of section 1.1 of the Agreement, as defined in section 2 of that Act, (vii.1) the Whitecap Dakota Government, as defined in section 2 of the Self-Government TreatyRecognizing the Whitecap Dakota Nation / Wapaha Ska Dakota Oyate Act; (g) to a member of Parliament for the purpose of assisting the individual to whom the information relatesin resolvinga problem; (h) to officers or employees of the institution for internal audit purposes, or to the office of the ComptrollerCurrent to December 10, 2025 7 Last amended on June 2, 2025\n\nPrivacyProtection of Personal InformationSection 8 General or any other person or body specified in theregulations for audit purposes; (i) to the Library and Archives of Canada for archivalpurposes; (j) to any person or body for research or statisticalpurposes if the head of the government institution (i) is satisfied that the purpose for which the information is disclosed cannot reasonably be accomplished unless the information is provided in a formthat would identify the individual to whom it relates, and (ii) obtains from the person or body a written undertaking that no subsequent disclosure of the information will be made in a form that could reasonably be expected to identify the individual to whomit relates; (k) to any aboriginal government, association of aboriginal people, Indian band, government institution orpart thereof, or to any person acting on behalf of suchgovernment, association, band, institution or partthereof, for the purpose of researching or validatingthe claims, disputes or grievances of any of the aboriginal peoples of Canada; to any government institution for the purpose of (l) locating an individual in order to collecta debt owingto Her Majesty in right of Canada by that individual ormakea payment owing to that individual by HerMajesty in right of Canada; and (m) for any purpose where, in the opinion of the headof the institution, (i) the public interest in disclosure clearly outweighs any invasion of privacy that could resultfrom the disclosure, or (ii) disclosure would clearly benefit the individualto whom the information relates. Personal information disclosed by Library andArchives of CanadaSubject to any other Act of Parliament, personal in- (3) formation under the custody or control of the Libraryand Archives of Canada that has been transferred therebya government institution for historical or archivalCurrent to December 10, 2025 8 Last amended on June 2, 2025\n\nPrivacyProtection of Personal InformationSection 8 purposes may be disclosed in accordance with the regulations to any person or body for research or statisticalpurposes. Copies of requests under paragraph (2)(e) to beretained (4) The head of a government institution shall retain acopy of every request received by the government institution under paragraph (2)(e) for such period of time asmay be prescribed by regulation, shall keep a record ofany information disclosed pursuant to the request forsuch period of time as may be prescribed by regulationand shall, on the request of the Privacy Commissioner, make those copies and records available to the PrivacyCommissioner. Notice of disclosure under paragraph (2)(m) (5) The head of a government institution shall notify thePrivacy Commissioner in writing of any disclosure of personal information under paragraph (2)(m) prior to thedisclosure where reasonably practicable or in any othercase forthwith on the disclosure, and the Privacy Commissioner may, if the Commissioner deems it appropriate, notify the individual to whom the information relatesof the disclosure. Definition of Indian band (6) In paragraph (2)(k), Indian band means (a) a band, as defined in the Indian Act; the band, as defined in subsection 2(1) of the (b) Naskapi and the Cree-Naskapi Commission Act; the Nation, as defined in subsection 2(1) (c) shíshálhof the shíshálh Nation Self-Government Act; or (d) a first nation named in Schedule II to the YukonFirst Nations Self-Government Act. Definition of aboriginal government (7) The expression aboriginal government in paragraph (2)(k) means (a) Nisga’a Government, as defined in the Nisga’a Final Agreement given effect by the Nisga’a FinalAgreement Act; (b) the council of the Westbank First Nation; (c) the Tlicho Government, as defined in section 2 ofthe Tlicho Land Claims and Self-Government Act; Current to December 10, 2025 9 Last amended on June 2, 2025\n\nPrivacyProtection of Personal InformationSection 8 (d) the Nunatsiavut Government, as defined in section 2 of the Labrador Inuit Land Claims Agreement Act; (e) the council of a participating First Nation as defined in subsection 2(1) of the First Nations Jurisdiction over Education in British Columbia Act; (e.1) the Tla’amin Government, as defined in subsection 2(2) of the Tla’amin Final Agreement Act; (f) the Tsawwassen Government, as defined in subsection 2(2) of the Tsawwassen First Nation FinalAgreement Act; (f.1) the Cree Nation Government, as defined insubsection 2(1) of the Cree Nation of Eeyou IstcheeGovernance Agreement Act or a Cree First Nation, asdefined in subsection 2(2) of that Act; (g) a Maanulth Government, within the meaning ofsubsection 2(2) of the Maanulth First Nations FinalAgreement Act; (h) Sioux Valley Dakota Oyate Government, withinthe meaning of subsection 2(2) of the Sioux ValleyDakota Nation Governance Act; (h.1) the Whitecap Dakota Government, as definedin section 2 of the Self-Government Treaty Recognizing the Whitecap Dakota Nation / Wapaha SkaDakota Oyate Act; the council of a as de- (i) participating First Nationfined in section 2 of the Anishinabek Nation Education Agreement Act; ora or the (j) First Nation Government AnishinabekNation Government, as defined in section of theAnishinabek Nation Governance Agreement Act, oran Anishinaabe Institution, within the meaning of section 1.1 of the Agreement, as defined in section 2 ofthat Act. Definition of council of the Westbank First NationThe expression (8) council of the Westbank First Nain paragraphs (2)(f) and (7)(b) means the council, astionCurrent to December 10, 2025 10 Last amended on June 2, 2025\n\nPrivacyProtection of Personal InformationSections 8-9 defined in the Westbank First Nation Self-GovernmentAgreement given effect by the Westbank First NationSelf-Government Act. R.S., 1985, c. P-21, s. 8; R.S., 1985, c. 20 (2nd Supp.), s. 13, c. 1 (3rd Supp.), s. 12; 1994, c. 35, s. 39; 2000, c. 7, s. 26; 2004, c. 11, s. 37, c. 17, s. 18; 2005, c. 1, ss. 106, 109, c. 27, ss. 21, 25; 2006, c. 10, s. 33; 2008, c. 32, s. 30; 2009, c. 18, s. 23; 2014, c. 1, s. 19, c. 11, s. 24; 2017, c. 32, s. 18; 2018, c. 4, s. 132; 2022, c. 9, s. 4; 2022, c. 9, s. 45; 2023, c. 22, s. 20. Record of disclosures to be retained 9 (1) The head of a government institution shall retain arecord of any use by the institution of personal information contained in a personal information bank or any useor purpose for which that information is disclosed by theinstitution where the use or purpose is not included inthe statements of uses and purposes set forth pursuant tosubparagraph 11(1)(a)(iv) and subsection 11(2) in the index referred to in section 11, and shall attach the recordto the personal information. Limitation (2) Subsection (1) does not apply in respect of information disclosed pursuant to paragraph 8(2)(e). Record forms part of personal information (3) For the purposes of this Act, a record retained undersubsection (1) shall be deemed to form part of the personal information to which it is attached. Consistent usesWhere personal information in a personal informa- (4) tion bank under the control of a government institutionis used or disclosed for a use consistent with the purposefor which the information was obtained or compiled bythe institution but the use is not included in the statement of consistent uses set forth pursuant to subparagraph 11(1)(a)(iv) in the index referred to in section 11, the head of the government institution shallforthwith notify the Privacy Commissioner of the (a) use for which the information was used or disclosed; andensure that the use is included in the next state- (b) ment of consistent uses set forth in the index. 1980-81-82-83, c. 111, Sch. II “9”; 1984, c. 21, s. 89. Current to December 10, 2025 11 Last amended on June 2, 2025\n\nPrivacyPersonal Information BanksSections 10-11 Personal Information BanksPersonal information to be included in personalinformation banks 10 (1) The head of a government institution shall causeto be included in personal information banks all personalinformation under the control of the government institution that (a) has been used, is being used or is available for usefor an administrative purpose; or (b) is organized or intended to be retrieved by thename of an individual or by an identifying number, symbol or other particular assigned to an individual. Exception for Library and Archives of Canada (2) Subsection (1) does not apply in respect of personalinformation under the custody or control of the Libraryand Archives of Canada that has been transferred therebya government institution for historical or archival purposes. R.S., 1985, c. P-21, s. 10; R.S., 1985, c. 1 (3rd Supp.), s. 12; 2004, c. 11, s. 38. Personal Information IndexIndex of personal informationThe designated Minister shall cause to be pub11 (1) lished on a periodic basis not less frequently than onceeach year, an index of (a) all personal information banks setting forth, in respect of each bank, (i) the identification and a description of the bank, the registration number assigned to it by the designated Minister pursuant to paragraph 71(1)(b) anda description of the class of individuals to whompersonal information contained in the bank relates, (ii) the name of the government institution that hascontrol of the bank, (iii) the title and address of the appropriate officerto whom requests relating to personal informationcontained in the bank should be sent, (iv) a statement of the purposes for which personalinformation in the bank was obtained or compiledanda statement of the uses consistent with thoseCurrent to December 10, 2025 12 Last amended on June 2, 2025\n\nPrivacyPersonal Information IndexSection 11 purposes for which the information is used or disclosed, (v) a statement of the retention and disposal standards applied to personal information in the bank, and (vi) an indication, where applicable, that the bankwas designated as an exempt bank by an order under section 18 and the provision of section 21 or 22 on the basis of which the order was made; and (b) all classes of personal information under the control of a government institution that are not containedin personal information banks, setting forth in respectof each classa description of the class in sufficient detail to (i) facilitate the right of access under this Act, andthe title and address of the appropriate officer (ii) for each government institution to whom requestsrelating to personal information within the classshould be sent. Statement of uses and purposes (2) The designated Minister may set forth in the indexreferred to in subsection (1) a statement of any of the uses and purposes, not included in the statements madepursuant to subparagraph (1)(a)(iv), for which personalinformation contained in any of the personal informationbanks referred to in the index is used or disclosed on aregular basis. Index to be made available (3) The designated Minister shall cause the index referred to in subsection (1) to be made available throughout Canada in conformity with the principle that everyperson is entitled to reasonable access to the index. 1980-81-82-83, c. 111, Sch. II “11”. Current to December 10, 2025 13 Last amended on June 2, 2025\n\nPrivacyAccess to Personal InformationSection 12 Access to Personal InformationRight of AccessRight of accessSubject to this Act, every individual who is a 12 (1) Canadian citizen or a permanent resident within themeaning of subsection 2(1) of the Immigration andRefugee Protection Act has a right to and shall, onrequest, be given access to (a) any personal information about the individualcontained in a personal information bank; and (b) any other personal information about the individual under the control of a government institution withrespect to which the individual is able to provide sufficiently specific information on the location of the information as to render it reasonably retrievable by thegovernment institution. Other rights relating to personal information (2) Every individual who is given access under paragraph (1)(a) to personal information that has been used, is being used or is available for use for an administrative purpose is entitled to (a) request correction of the personal informationwhere the individual believes there is an error or omission therein; (b) require that a notation be attached to the information reflecting any correction requested but not made; andrequire that any person or body to whom that in- (c) formation has been disclosed for use for an administrative purpose within two years prior to the time acorrection is requested or a notation is required underthis subsection in respect of that information (i) be notified of the correction or notation, and (ii) where the disclosure is to a government institution, the institution make the correction or notationon any copy of the information under its control. Current to December 10, 2025 14 Last amended on June 2, 2025\n\nPrivacyAccess to Personal InformationRight of AccessSections 12-15 Extension of right of access by orderThe Governor in Council may, by order, extend the (3) right to be given access to personal information undersubsection (1) to include individuals not referred to inthat subsection and may set such conditions as theGovernor in Council deems appropriate. R.S., 1985, c. P-21, s. 12; 2001, c. 27, s. 269. Requests for AccessRequest for access under paragraph 12(1)(a) 13 (1) A request for access to personal information under paragraph 12(1)(a) shall be made in writing to thegovernment institution that has control of the personalinformation bank that contains the information and shallidentify the bank. Request for access under 12(1)(b) A request for access to personal information under (2) paragraph 12(1)(b) shall be made in writing to the government institution that has control of the informationand shall provide sufficiently specific information on thelocation of the information as to render it reasonably retrievable by the government institution. 1980-81-82-83, c. 111, Sch. II “13”. Notice where access requested 14 Where access to personal information is requestedunder subsection 12(1), the head of the government institution to which the request is made shall, subject to section 15, within thirty days after the request is received, (a) give written notice to the individual who made therequest as to whether or not access to the informationora part thereof will be given; andif access is to be given, give the individual who (b) made the request access to the information or the partthereof. 1980-81-82-83, c. 111, Sch. II “14”. Extension of time limitsThe head of a government institution may extend thetime limit set out in section 14 in respect of a request fora maximum of thirty days if (a) (i) meeting the original time limit would unreasonably interfere with the operations of the government institution, or (ii) consultations are necessary to comply with therequest that cannot reasonably be completed withinthe original time limit, orCurrent to December 10, 2025 15 Last amended on June 2, 2025\n\nPrivacyAccess to Personal InformationRequests for AccessSections 15-17 (b) such period of time as is reasonable, if additionaltime is necessary for translation purposes or for thepurposes of converting the personal information intoan alternative format, by giving notice of the extension and the length of the extension to the individual who made the request withinthirty days after the request is received, which noticeshall containa statement that the individual has a rightto make a complaint to the Privacy Commissioner aboutthe extension. R.S., 1985, c. P-21, s. 15; 1992, c. 21, s. 35. Where access is refused 16 (1) Where the head of a government institution refuses to give access to any personal information requested under subsection 12(1), the head of the institutionshall state in the notice given under paragraph 14(a) that the personal information does not exist, or (a) the specific provision of this Act on which the re- (b) fusal was based or the provision on whicha refusalcould reasonably be expected to be based if the information existed, and shall state in the notice that the individual who madethe request has a right to make a complaint to the PrivacyCommissioner about the refusal. Existence not required to be disclosed (2) The head of a government institution may but is notrequired to indicate under subsection (1) whether personal information exists. Deemed refusal to give access (3) Where the head of a government institution fails togive access to any personal information requested undersubsection 12(1) within the time limits set out in this Act, the head of the institution shall, for the purposes of thisAct, be deemed to have refused to give access. 1980-81-82-83, c. 111, Sch. II “16”. AccessForm of access 17 (1) Subject to any regulations made under paragraph 77(1)(o), where an individual is to be given access to personal information requested under subsection 12(1), thegovernment institution shall (a) permit the individual to examine the informationin accordance with the regulations; or (b) provide the individual with a copy thereof. Current to December 10, 2025 16 Last amended on June 2, 2025\n\nPrivacyAccess to Personal InformationAccessSections 17-18 Language of accessWhere access to personal information is to be given (2) under this Act and the individual to whom access is to begiven requests that access be given in a particular one ofthe official languages of Canada, (a) access shall be given in that language, if the personal information already exists under the control of agovernment institution in that language; and (b) where the personal information does not exist inthat language, the head of the government institutionthat has control of the personal information shallcause it to be translated or interpreted for the individual if the head of the institution considersa translation or interpretation to be necessary to enable the individual to understand the information. Access to personal information in alternative format (3) Where access to personal information is to be givenunder this Act and the individual to whom access is to begiven has a sensory disability and requests that access begiven in an alternative format, access shall be given in analternative format ifthe personal information already exists under the (a) control of a government institution in an alternativeformat that is acceptable to the individual; or (b) the head of the government institution that hascontrol of the personal information considers the giving of access in an alternative format to be necessaryto enable the individual to exercise the individual’sright of access under this Act and considers it reasonable to cause the personal information to be converted. R.S., 1985, c. P-21, s. 17; 1992, c. 21, s. 36. ExemptionsExempt BanksGovernor in Council may designate exempt banks 18 (1) The Governor in Council may, by order, designate as exempt banks certain personal information banksthat contain files all of which consist predominantly ofpersonal information described in section 21 or 22. Disclosure may be refused (2) The head of a government institution may refuse todisclose any personal information requested underCurrent to December 10, 2025 17 Last amended on June 2, 2025\n\nPrivacyExemptionsExempt BanksSections 18-19 subsection 12(1) that is contained in a personal information bank designated as an exempt bank under subsection (1). Contents of orderAn order made under subsection (1) shall specify (3) (a) the section on the basis of which the order ismade; and (b) wherea personal information bank is designatedthat contains files that consist predominantly of personal information described in subparagraph 22(1)(a)(ii), the law concerned. 1980-81-82-83, c. 111, Sch. II “18”. Responsibilities of GovernmentPersonal information obtained in confidence 19 (1) Subject to subsection (2), the head of a government institution shall refuse to disclose any personal information requested under subsection 12(1) that was obtained in confidence from (a) the government of a foreign state or an institutionthereof; (b) an international organization of states or an institution thereof; (c) the government of a province or an institutionthereof; (d) a municipal or regional government established byor pursuant to an Act of the legislature of a province oran institution of such a government; (e) the council, as defined in the Westbank First Nation Self-Government Agreement given effect by theWestbank First Nation Self-Government Act; (e.1) the Whitecap Dakota Government, as definedin section 2 of the Self-Government Treaty Recognizing the Whitecap Dakota Nation / Wapaha SkaDakota Oyate Act; the council of a participating First Nation as de- (f) fined in subsection 2(1) of the First Nations Jurisdiction over Education in British Columbia Act; ora First Nation Government or the Anishinabek (g) Nation Government, as defined in section 2 of theAnishinabek Nation Governance Agreement Act, orCurrent to December 10, 2025 18 Last amended on June 2, 2025\n\nPrivacyExemptionsResponsibilities of GovernmentSections 19-22 an Anishinaabe Institution, within the meaning of section 1.1 of the Agreement, as defined in section 2 ofthat Act. Where disclosure authorizedThe head of a government institution may disclose (2) any personal information requested under subsection 12(1) that was obtained from any government, organization or institution described in subsection (1) if the government, organization or institution from which the information was obtained (a) consents to the disclosure; or (b) makes the information public. R.S., 1985, c. P-21, s. 19; 2004, c. 17, s. 19; 2006, c. 10, s. 34; 2022, c. 9, s. 5; 2023, c. 22, s. 21. Federal-provincial affairs 20 The head of a government institution may refuse todisclose any personal information requested under subsection 12(1) the disclosure of which could reasonably beexpected to be injurious to the conduct by the Government of Canada of federal-provincial affairs. 1980-81-82-83, c. 111, Sch. II “20”. International affairs and defence 21 The head of a government institution may refuse todisclose any personal information requested under subsection 12(1) the disclosure of which could reasonably beexpected to be injurious to the conduct of internationalaffairs, the defence of Canada or any state allied or associated with Canada, as defined in subsection 15(2) of theAccess to Information Act, or the efforts of Canada toward detecting, preventing or suppressing subversive orhostile activities, as defined in subsection 15(2) of the Access to Information Act, including, without restrictingthe generality of the foregoing, any such information listed in paragraphs 15(1)(a) to (i) of the Access to Information Act. 1980-81-82-83, c. 111, Sch. II “21”. Law enforcement and investigation 22 (1) The head of a government institution may refuseto disclose any personal information requested undersubsection 12(1) that was obtained or prepared by any government (a) institution, or part of any government institution, thatis an investigative body specified in the regulations inthe course of lawful investigations pertaining toCurrent to December 10, 2025 19 Last amended on June 2, 2025\n\nPrivacyExemptionsResponsibilities of GovernmentSection 22 (i) the detection, prevention or suppression ofcrime, (ii) the enforcement of any law of Canada or aprovince, or (iii) activities suspected of constituting threats tothe security of Canada within the meaning of theCanadian Security Intelligence Service Act, if the information came into existence less than twentyyears prior to the request; (b) the disclosure of which could reasonably be expected to be injurious to the enforcement of any law ofCanada or a province or the conduct of lawful investigations, including, without restricting the generality ofthe foregoing, any such informationrelating to the existence or nature of a particular (i) investigation, (ii) that would reveal the identity of a confidentialsource of information, or (iii) that was obtained or prepared in the course ofan investigation; or (c) the disclosure of which could reasonably be expected to be injurious to the security of penal institutions. Policing services for provinces or municipalities (2) The head of a government institution shall refuse todisclose any personal information requested under subsection 12(1) that was obtained or prepared by the RoyalCanadian Mounted Police while performing policing services for a province or municipality pursuant to an arrangement made under section 20 of the Royal CanadianMounted Police Act, where the Government of Canadahas, on the request of the province or municipality, agreed not to disclose such information. Definition of investigation (3) For the purposes of paragraph (1)(b), investigationmeans an investigation thatpertains to the administration or enforcement of (a) an Act of Parliament; is authorized by or pursuant to an Act of Parlia- (b) ment; orCurrent to December 10, 2025 20 Last amended on June 2, 2025\n\nPrivacyExemptionsResponsibilities of GovernmentSections 22-22.4 (c) is withina class of investigations specified in theregulations. 1980-81-82-83, c. 111, Sch. II “22”; 1984, c. 21, s. 90, c. 40, s. 79(E). Information obtained by Privacy Commissioner 22.1 (1) The Privacy Commissioner shall refuse to disclose any personal information requested under this Actthat was obtained or created by the Commissioner or onthe Commissioner’s behalf in the course of an investigation conducted by, or under the authority of, the Commissioner or that was obtained by the Commissioner inthe course of a consultation with the Information Commissioner under subsection 36(1.1) or section 36.2 of theAccess to Information Act. Exception (2) However, the Commissioner shall not refuse undersubsection (1) to disclose any personal information thatwas created by the Commissioner or on the Commissioner’s behalf in the course of an investigation conducted by, or under the authority of, the Commissioner once the investigation and all related proceedings, if any, are finallyconcluded. 2006, c. 9, s. 183; 2019, c. 18, s. 48. Public Sector Integrity CommissionerThe Public Sector Integrity Commissioner shall 22.2 refuse to disclose any personal information requestedunder subsection 12(1) that was obtained or created byhim or her or on his or her behalf in the course of an investigation into a disclosure made under the Public Servants Disclosure Protection Act or an investigation commenced under section of that Act. 2005, c. 46, s. 58. Public Servants Disclosure Protection Act 22.3 The head of a government institution shall refuseto disclose personal information requested under subsection 12(1) that was created for the purpose of making adisclosure under the Public Servants Disclosure Protection Act or in the course of an investigation into a disclosure under that Act. 2005, c. 46, s. 58. Secretariat of National Security and IntelligenceCommittee of Parliamentarians 22.4 The Secretariat of the National Security and Intelligence Committee of Parliamentarians shall refuse to disclose personal information requested under subsection 12(1) that was obtained or created by it or on its behalf inthe course of assisting the National Security andCurrent to December 10, 2025 21 Last amended on June 2, 2025\n\nPrivacyExemptionsResponsibilities of GovernmentSections 22.4-25 Intelligence Committee of Parliamentarians in fulfillingits mandate. 2017, c. 15, s. 45. Security clearances 23 The head of a government institution may refuse todisclose any personal information requested under subsection 12(1) that was obtained or prepared by an investigative body specified in the regulations for the purposeof determining whether to grant security clearances (a) required by the Government of Canada or a government institution in respect of individuals employedby or performing services for the Government ofCanada or a government institution, individuals employed by or performing services for a person or bodyperforming services for the Government of Canada ora government institution, individuals seeking to be soemployed or seeking to perform those services, or (b) required by the government of a province or a foreign state or an institution thereof, if disclosure of the information could reasonably be expected to reveal the identity of the individual who furnished the investigative body with the information. 1980-81-82-83, c. 111, Sch. II “23”. Individuals sentenced for an offence 24 The head of a government institution may refuse todisclose any personal information requested under subsection 12(1) that was collected or obtained by the Correctional Service of Canada or the Parole Board ofCanada while the individual who made the request wasunder sentence for an offence against any Act of Parliament, if the disclosure could reasonably be expected to (a) lead to a serious disruption of the individual’s institutional, parole or statutory release program; or (b) reveal information about the individual originallyobtained on a promise of confidentiality, express orimplied. R.S., 1985, c. P-21, s. 24; 1994, c. 26, s. 56; 2012, c. 1, s. 160. Safety of individuals 25 The head of a government institution may refuse todisclose any personal information requested under subsection 12(1) the disclosure of which could reasonably beexpected to threaten the safety of individuals. 1980-81-82-83, c. 111, Sch. II “25”. Current to December 10, 2025 22 Last amended on June 2, 2025\n\nPrivacyExemptionsResponsibilities of GovernmentSections 25-28"
}