{
  "title": "PRIVACY_ACT_ASSISTANT_PRIVACY_COMMISSIONER",
  "all_text": "Assistant Privacy CommissionerAppointment of Assistant Privacy Commissioner 56 (1) The Governor in Council may, on the recommendation of the Privacy Commissioner, appoint one or moreAssistant Privacy Commissioners. Tenure of office and removal of Assistant PrivacyCommissioner (2) Subject to this section, an Assistant Privacy Commissioner holds office during good behaviour for a term notexceeding five years. Further terms (3) An Assistant Privacy Commissioner, on the expiration of a first or any subsequent term of office, is eligibleto be re-appointed for a further term not exceeding fiveyears. 1980-81-82-83, c. 111, Sch. II “56”; 1984, c. 40, s. 79(E). Duties generally 57 (1) An Assistant Privacy Commissioner shall engageexclusively in such duties or functions of the office of thePrivacy Commissioner under this Act or any other Act ofParliament as are delegated by the Privacy Commissionerto that Assistant Privacy Commissioner and shall nothold any other office under Her Majesty for reward orengage in any other employment for reward. Salary and expenses (2) An Assistant Privacy Commissioner is entitled to bepaida salary to be fixed by the Governor in Council andsuch travel and living expenses incurred in the performance of duties under this Act or any other Act of Parliament as the Privacy Commissioner considers reasonable. Current to December 10, 2025 37 Last amended on June 2, 2025\n\nPrivacyOffice of the Privacy CommissionerAssistant Privacy CommissionerSections 57-59 Pension benefitsThe provisions of the Public Service Superannuation (3) Act, other than those relating to tenure of office, apply toan Assistant Privacy Commissioner. Other benefits (4) An Assistant Privacy Commissioner is deemed to beemployed in the public service of Canada for the purposes of the Government Employees Compensation Act andany regulations made under section 9 of the AeronauticsAct. 1980-81-82-83, c. 111, Sch. II “57”."
}