{
  "title": "PRIVACY_ACT_REVIEW_BY_THE_FEDERAL_COURT",
  "all_text": "Review by the Federal CourtReview by Federal Court where access refused 41 Any individual who has been refused access to personal information requested under subsection 12(1) may, if a complaint has been made to the Privacy Commissioner in respect of the refusal, apply to the Court for a reviewof the matter within forty-five days after the time the results of an investigation of the complaint by the PrivacyCommissioner are reported to the complainant undersubsection 35(2) or within such further time as the Courtmay, either before or after the expiration of those fortyfive days, fix or allow. 1980-81-82-83, c. 111, Sch. II “41”. Privacy Commissioner may apply or appear 42 The Privacy Commissioner mayCurrent to December 10, 2025 31 Last amended on June 2, 2025\n\nPrivacyReview by the Federal CourtSections 42-46 (a) apply to the Court, within the time limits prescribed by section 41, for a review of any refusal to disclose personal information requested under subsection 12(1) in respect of which an investigation hasbeen carried out by the Privacy Commissioner, if theCommissioner has the consent of the individual whorequested access to the information; (b) appear before the Court on behalf of any individual who has applied for a review under section 41; orwith leave of the Court, appear as a party to any (c) review applied for under section 41. 1980-81-82-83, c. 111, Sch. II “42”. Application respecting files in exempt banksIn the circumstances described in subsection 36(5), the Privacy Commissioner may apply to the Court for areview of any file contained in a personal informationbank designated as an exempt bank under section 18. 1980-81-82-83, c. 111, Sch. II “43”. Hearing in summary wayAn application made under section 41, 42 or 43 shallbe heard and determined in a summary way in accordance with any special rules made in respect of such applications pursuant to section 46 of the Federal CourtsAct. R.S., 1985, c. P-21, s. 44; 2002, c. 8, s. 182. Access to information 45 Despite any other Act of Parliament, any privilegeunder the law of evidence, solicitor-client privilege or theprofessional secrecy of advocates and notaries and litigation privilege, the Court may, in the course of any proceedings before it arising from an application under section 41, 42 or 43, examine any information recorded inany form under the control of a government institution, other than a confidence of the Queen’s Privy Council forCanada to which subsection 70(1) applies, and no information that the Court may examine under this sectionmay be withheld from the Court on any grounds. R.S., 1985, c. P-21, s. 45; 2019, c. 18, s. 51. Court to take precautions against disclosing 46 (1) In any proceedings before the Court arising froman application under section 41, 42 or 43, the Court shalltake every reasonable precaution, including, when appropriate, receiving representations ex parte and conductinghearings in camera, to avoid the disclosure by the Courtor any person of (a) any information or other material that the head ofa government institution would be authorized torefuse to disclose if it were requested under subsectionCurrent to December 10, 2025 32 Last amended on June 2, 2025\n\nPrivacyReview by the Federal CourtSections 46-4912(1) or contained in a record requested under the Access to Information Act; or (b) any information as to whether personal information exists where the head of a government institution, in refusing to disclose the personal information underthis Act, does not indicate whether it exists. Disclosure of offence authorized (2) The Court may disclose to the appropriate authorityinformation relating to the commission of an offenceagainsta law of Canada or a province by a director, an officer or an employee of a government institution if, in theCourt’s opinion, there is evidence of such an offence. R.S., 1985, c. P-21, s. 46; 2006, c. 9, s. 184. Burden of proof 47 In any proceedings before the Court arising from anapplication under section 41, 42 or 43, the burden of establishing that the head of a government institution isauthorized to refuse to disclose personal information requested under subsection 12(1) or that a file should be included in a personal information bank designated as anexempt bank under section 18 shall be on the government institution concerned. 1980-81-82-83, c. 111, Sch. II “47”. Order of Court where no authorization to refusedisclosure foundWhere the head of a government institution refusesto disclose personal information requested under subsection 12(1) on the basis of a provision of this Act not referred to in section 49, the Court shall, if it determinesthat the head of the institution is not authorized underthis Act to refuse to disclose the personal information, order the head of the institution to disclose the personalinformation, subject to such conditions as the Courtdeems appropriate, to the individual who requested access thereto, or shall make such other order as the Courtdeems appropriate. 1980-81-82-83, c. 111, Sch. II “48”. Order of Court where reasonable grounds of injurynot found 49 Where the head of a government institution refusesto disclose personal information requested under subsection 12(1) on the basis of section 20 or 21 or paragraph 22(1)(b) or (c) or 24(a), the Court shall, if it determinesthat the head of the institution did not have reasonablegrounds on which to refuse to disclose the personal information, order the head of the institution to disclose thepersonal information, subject to such conditions as theCurrent to December 10, 2025 33 Last amended on June 2, 2025\n\nPrivacyReview by the Federal CourtSections 49-51 Court deems appropriate, to the individual who requested access thereto, or shall make such other order as theCourt deems appropriate. 1980-81-82-83, c. 111, Sch. II “49”. Order to remove file from exempt bank 50 Where the Privacy Commissioner makes an application to the Court under section 43 for a review of a filecontained in a personal information bank designated asan exempt bank under section 18, the Court shall, if it determines (a) in the case of a file contained in the bank on thebasis of personal information described in paragraph 22(1)(a) or subsection 22(2), that the file should not beincluded therein, orin the case of a file contained in the bank on the (b) basis of personal information described in section 21 or paragraph 22(1)(b) or (c), that reasonable groundsdo not exist on which to include the file in the bank, order the head of the government institution that hascontrol of the bank to remove the file from the bank ormake such other order as the Court deems appropriate. 1980-81-82-83, c. 111, Sch. II “50”; 1984, c. 40, s. 60. Actions relating to international affairs and defenceAny application under section 41 or 42 relating to 51 (1) personal information that the head of a government institution has refused to disclose by reason of paragraph 19(1)(a) or (b) or section 21, and any application undersection 43 in respect of a file contained in a personal information bank designated as an exempt bank under section 18 to contain files all of which consist predominantlyof personal information described in section 21, shall beheard and determined by the Chief Justice of the FederalCourt or by any other judge of the Court that the ChiefJustice may designate to hear the applications. Special rules for hearingsAn application referred to in subsection (1) or an ap- (2) peal brought in respect of such application shallbe heard in camera; and (a) (b) on the request of the head of the government institution concerned, be heard and determined in the National Capital Region described in the schedule to theNational Capital Act. Ex parte representations (3) During the hearing of an application referred to insubsection (1) or an appeal brought in respect of such application, the head of the government institution concerned shall, on the request of the head of the institution, Current to December 10, 2025 34 Last amended on June 2, 2025\n\nPrivacyReview by the Federal CourtSections 51-53 be given the opportunity to make representations exparte. R.S., 1985, c. P-21, s. 51; 2002, c. 8, s. 159. Costs 52 (1) Subject to subsection (2), the costs of and incidental to all proceedings in the Court under this Act shallbe in the discretion of the Court and shall follow theevent unless the Court orders otherwise. IdemWhere the Court is of the opinion that an application (2) for review under section 41 or 42 has raised an importantnew principle in relation to this Act, the Court shall orderthat costs be awarded to the applicant even if the applicant has not been successful in the result. 1980-81-82-83, c. 111, Sch. II “52”. Office of the PrivacyCommissioner"
}