{
  "title": "PRIVACY_ACT_PRIVACY_COMMISSIONER",
  "all_text": "Privacy CommissionerAppointment 53 (1) The Governor in Council shall, by commissionunder the Great Seal, appointa Privacy Commissioner after consultation with the Leader of the Government inthe Senate or Government Representative in the Senate, the Leader of the Opposition in the Senate, the Leader orFacilitator of every other recognized party or parliamentary group in the Senate and the leader of every recognized party in the House of Commons and approval ofthe appointment by resolution of the Senate and Houseof Commons. Tenure (2) Subject to this section, the Privacy Commissionerholds office during good behaviour for a term of sevenyears, but may be removed for cause by the Governor inCouncil at any time on address of the Senate and Houseof Commons. Further terms (3) The Privacy Commissioner, on the expiration of afirst or any subsequent term of office, is eligible to be reappointed for a further term not exceeding seven years. Interim appointmentIn the event of the absence or incapacity of the Priva- (4) cy Commissioner, or if that office is vacant, the GovernorCurrent to December 10, 2025 35 Last amended on June 2, 2025\n\nPrivacyOffice of the Privacy CommissionerPrivacy CommissionerSections 53-55 in Council may appoint any qualified person to hold thatoffice in the interim for a term not exceeding six months, and that person shall, while holding office, be paid thesalary or other remuneration and expenses that may befixed by the Governor in Council. R.S., 1985, c. P-21, s. 53; 2006, c. 9, s. 118; 2022, c. 10, s. 247. Rank, powers and duties generally 54 (1) The Privacy Commissioner shall rank as and haveall the powers of a deputy head of a department, shall engage exclusively in the duties of the office of PrivacyCommissioner under this Act or any other Act of Parliament and shall not hold any other office under HerMajesty for reward or engage in any other employmentfor reward. Salary and expensesThe Privacy Commissioner shall be paid a salary (2) equal to the salary of a judge of the Federal Court, otherthan the Chief Justice, and is entitled to be paid reasonable travel and living expenses incurred in the performance of duties under this Act or any other Act of Parliament. Pension benefits (3) The provisions of the Public Service SuperannuationAct, other than those relating to tenure of office, apply tothe Privacy Commissioner, except that a person appointed as Privacy Commissioner from outside the public service, as defined in the Public Service SuperannuationAct, may, by notice in writing given to the President ofthe Treasury Board not more than sixty days after thedate of appointment, elect to participate in the pensionplan provided in the Diplomatic Service (Special) Superannuation Act, in which case the provisions of that Act, other than those relating to tenure of office, apply to thePrivacy Commissioner from the date of appointment andthe provisions of the Public Service Superannuation Actdo not apply. Other benefits (4) The Privacy Commissioner is deemed to be employedin the public service of Canada for the purposes of theGovernment Employees Compensation Act and any regulations made under section 9 of the Aeronautics Act. R.S., 1985, c. P-21, s. 54; 2002, c. 8, s. 160; 2003, c. 22, s. 225(E). Information Commissioner may be appointed asPrivacy Commissioner 55 (1) The Governor in Council may appoint as PrivacyCommissioner under section 53 the Information Commissioner appointed under the Access to InformationAct. Current to December 10, 2025 36 Last amended on June 2, 2025\n\nPrivacyOffice of the Privacy CommissionerPrivacy CommissionerSections 55-57 SalaryIn the event that the Information Commissioner is (2) appointed in accordance with subsection (1) as PrivacyCommissioner, the Privacy Commissioner shall, notwithstanding subsection 54(2), be paid the salary of the Information Commissioner but not the salary of the PrivacyCommissioner. 1980-81-82-83, c. 111, Sch. II “55”."
}