{
  "title": "PRIVACY_ACT_COMPLAINTS",
  "all_text": "ComplaintsSection 29 ComplaintsReceipt and investigation of complaints 29 (1) Subject to this Act, the Privacy Commissionershall receive and investigate complaints (a) from individuals who allege that personal information about themselves held by a government institution has been used or disclosed otherwise than in accordance with section 7 or 8; (b) from individuals who have been refused access topersonal information requested under subsection 12(1); (c) from individuals who allege that they are not beingaccorded the rights to which they are entitled undersubsection 12(2) or that corrections of personal information requested under paragraph 12(2)(a) are beingrefused without justification; from individuals who have requested access to (d) personal information in respect of whicha time limithas been extended pursuant to section 15 where theyconsider the extension unreasonable; (e) from individuals who have not been given accessto personal information in the official language requested by the individuals under subsection 17(2); (e.1) from individuals who have not been given accessto personal information in an alternative format pursuant to a request made under subsection 17(3); (f) from individuals who have been required to pay afee that they consider inappropriate; (g) in respect of the index referred to in subsection 11(1); or (h) in respect of any other matter relating to (i) the collection, retention or disposal of personalinformation by a government institution, (ii) the use or disclosure of personal informationunder the control of a government institution, or (iii) requesting or obtaining access under subsection 12(1) to personal information. Current to December 10, 2025 24 Last amended on June 2, 2025\n\nPrivacyComplaintsSections 29-33 Complaints submitted on behalf of complainantsNothing in this Act precludes the Privacy Commis- (2) sioner from receiving and investigating complaints of anature described in subsection (1) that are submitted bya person authorized by the complainant to act on behalfof the complainant, and a reference to a complainant inany other section includesa reference to a person so authorized. Privacy Commissioner may initiate complaint (3) Where the Privacy Commissioner is satisfied thatthere are reasonable grounds to investigatea matter under this Act, the Commissioner may initiatea complaintin respect thereof. R.S., 1985, c. P-21, s. 29; 1992, c. 21, s. 37. Written complaint 30 A complaint under this Act shall be made to the Privacy Commissioner in writing unless the Commissionerauthorizes otherwise. 1980-81-82-83, c. 111, Sch. II “30”."
}