{
  "title": "PRIVACY_ACT_COMPLAINTS",
  "all_text": "Complaints\nSection 29\nComplaints\nReceipt and investigation of complaints\n29 (1) Subject to this Act, the Privacy Commissioner\nshall receive and investigate complaints\n(a) from individuals who allege that personal information about themselves held by a government institution has been used or disclosed otherwise than in accordance with section 7 or 8;\n(b) from individuals who have been refused access to\npersonal information requested under subsection\n12(1);\n(c) from individuals who allege that they are not being\naccorded the rights to which they are entitled under\nsubsection 12(2) or that corrections of personal information requested under paragraph 12(2)(a) are being\nrefused without justification;\nfrom individuals who have requested access to\n(d)\npersonal information in respect of which a time limit\nhas been extended pursuant to section 15 where they\nconsider the extension unreasonable;\n(e) from individuals who have not been given access\nto personal information in the official language requested by the individuals under subsection 17(2);\n(e.1) from individuals who have not been given access\nto personal information in an alternative format pursuant to a request made under subsection 17(3);\n(f) from individuals who have been required to pay a\nfee that they consider inappropriate;\n(g) in respect of the index referred to in subsection\n11(1); or\n(h) in respect of any other matter relating to\n(i) the collection, retention or disposal of personal\ninformation by a government institution,\n(ii) the use or disclosure of personal information\nunder the control of a government institution, or\n(iii) requesting or obtaining access under subsection 12(1) to personal information.\nCurrent to December 10, 2025 24\nLast amended on June 2, 2025\n\nPrivacy\nComplaints\nSections 29-33\nComplaints submitted on behalf of complainants\nNothing in this Act precludes the Privacy Commis-\n(2)\nsioner from receiving and investigating complaints of a\nnature described in subsection (1) that are submitted by\na person authorized by the complainant to act on behalf\nof the complainant, and a reference to a complainant in\nany other section includes a reference to a person so authorized.\nPrivacy Commissioner may initiate complaint\n(3) Where the Privacy Commissioner is satisfied that\nthere are reasonable grounds to investigate a matter under this Act, the Commissioner may initiate a complaint\nin respect thereof.\nR.S., 1985, c. P-21, s. 29; 1992, c. 21, s. 37.\nWritten complaint\n30 A complaint under this Act shall be made to the Privacy Commissioner in writing unless the Commissioner\nauthorizes otherwise.\n1980-81-82-83, c. 111, Sch. II “30”.\n"
}