{
  "title": "PRIVACY_ACT_DESIGNATION",
  "all_text": "Designation\nPower to designate Minister\n3.1 (1) The Governor in Council may designate a member of the Queen’s Privy Council for Canada to be the\nMinister for the purposes of any provision of this Act.\nCurrent to December 10, 2025 4\nLast amended on June 2, 2025\n\nPrivacy\nDesignation\nSections 3.1-6\nPower to designate head\nThe Governor in Council may, by order, designate a\n(2)\nperson to be the head of a government institution, other\nthan a department or ministry of state, for the purposes\nof this Act.\n2006, c. 9, s. 182.\nCollection, Retention and\nDisposal of Personal\nInformation\nCollection of personal information\nNo personal information shall be collected by a gov-\n4\nernment institution unless it relates directly to an operating program or activity of the institution.\n1980-81-82-83, c. 111, Sch. II “4”.\nPersonal information to be collected directly\nA government institution shall, wherever possible,\n5 (1)\ncollect personal information that is intended to be used\nfor an administrative purpose directly from the individual to whom it relates except where the individual authorizes otherwise or where personal information may be\ndisclosed to the institution under subsection 8(2).\nIndividual to be informed of purpose\nA government institution shall inform any individual\n(2)\nfrom whom the institution collects personal information\nabout the individual of the purpose for which the information is being collected.\nException\nSubsections (1) and (2) do not apply where compli-\n(3)\nance therewith might\n(a) result in the collection of inaccurate information;\nor\n(b) defeat the purpose or prejudice the use for which\ninformation is collected.\n1980-81-82-83, c. 111, Sch. II “5”.\nRetention of personal information used for an\nadministrative purpose\nPersonal information that has been used by a gov-\n6 (1)\nernment institution for an administrative purpose shall\nbe retained by the institution for such period of time after it is so used as may be prescribed by regulation in order to ensure that the individual to whom it relates has a\nreasonable opportunity to obtain access to the information.\nCurrent to December 10, 2025 5\nLast amended on June 2, 2025\n\nPrivacy\nCollection, Retention and Disposal of Personal Information\nSections 6-8\nAccuracy of personal information\nA government institution shall take all reasonable\n(2)\nsteps to ensure that personal information that is used for\nan administrative purpose by the institution is as accurate, up-to-date and complete as possible.\nDisposal of personal information\n(3) A government institution shall dispose of personal\ninformation under the control of the institution in accordance with the regulations and in accordance with any\ndirectives or guidelines issued by the designated minister\nin relation to the disposal of that information.\n1980-81-82-83, c. 111, Sch. II “6”.\nProtection of Personal\nInformation\nUse of personal information\n7 Personal information under the control of a government institution shall not, without the consent of the individual to whom it relates, be used by the institution except\n(a) for the purpose for which the information was obtained or compiled by the institution or for a use consistent with that purpose; or\n(b) for a purpose for which the information may be\ndisclosed to the institution under subsection 8(2).\n1980-81-82-83, c. 111, Sch. II “7”.\nDisclosure of personal information\n8 (1) Personal information under the control of a government institution shall not, without the consent of the\nindividual to whom it relates, be disclosed by the institution except in accordance with this section.\nWhere personal information may be disclosed\n(2) Subject to any other Act of Parliament, personal information under the control of a government institution\nmay be disclosed\n(a) for the purpose for which the information was obtained or compiled by the institution or for a use consistent with that purpose;\n(b) for any purpose in accordance with any Act of Parliament or any regulation made thereunder that authorizes its disclosure;\n(c) for the purpose of complying with a subpoena or\nwarrant issued or order made by a court, person or\nbody with jurisdiction to compel the production of\nCurrent to December 10, 2025 6\nLast amended on June 2, 2025\n\nPrivacy\nProtection of Personal Information\nSection 8\ninformation or for the purpose of complying with rules\nof court relating to the production of information;\n(d) to the Attorney General of Canada for use in legal\nproceedings involving the Crown in right of Canada or\nthe Government of Canada;\n(e) to an investigative body specified in the regulations, on the written request of the body, for the purpose of enforcing any law of Canada or a province or\ncarrying out a lawful investigation, if the request specifies the purpose and describes the information to be\ndisclosed;\n(f) for the purpose of administering or enforcing any\nlaw or carrying out a lawful investigation, under an\nagreement or arrangement between the Government\nof Canada or any of its institutions and any of the following entities or any of their institutions:\n(i) the government of a foreign state,\n(ii) an international organization of states or an international organization established by the governments of states,\n(iii) the government of a province,\n(iv) the council of the Westbank First Nation,\nthe council of a participating First Nation as\n(v)\ndefined in subsection 2(1) of the First Nations Jurisdiction over Education in British Columbia Act,\nthe council of a participating First Nation as\n(vi)\ndefined in section 2 of the Anishinabek Nation Education Agreement Act,\na First Nation Government or the Anishin-\n(vii)\nabek Nation Government, as defined in section 2\nof the Anishinabek Nation Governance Agreement\nAct, or an Anishinaabe Institution, within the\nmeaning of section 1.1 of the Agreement, as defined in section 2 of that Act,\n(vii.1) the Whitecap Dakota Government, as defined in section 2 of the Self-Government Treaty\nRecognizing the Whitecap Dakota Nation / Wapaha Ska Dakota Oyate Act;\n(g) to a member of Parliament for the purpose of assisting the individual to whom the information relates\nin resolving a problem;\n(h) to officers or employees of the institution for internal audit purposes, or to the office of the Comptroller\nCurrent to December 10, 2025 7\nLast amended on June 2, 2025\n\nPrivacy\nProtection of Personal Information\nSection 8\nGeneral or any other person or body specified in the\nregulations for audit purposes;\n(i) to the Library and Archives of Canada for archival\npurposes;\n(j) to any person or body for research or statistical\npurposes if the head of the government institution\n(i) is satisfied that the purpose for which the information is disclosed cannot reasonably be accomplished unless the information is provided in a form\nthat would identify the individual to whom it relates, and\n(ii) obtains from the person or body a written undertaking that no subsequent disclosure of the information will be made in a form that could reasonably be expected to identify the individual to whom\nit relates;\n(k) to any aboriginal government, association of aboriginal people, Indian band, government institution or\npart thereof, or to any person acting on behalf of such\ngovernment, association, band, institution or part\nthereof, for the purpose of researching or validating\nthe claims, disputes or grievances of any of the aboriginal peoples of Canada;\nto any government institution for the purpose of\n(l)\nlocating an individual in order to collect a debt owing\nto Her Majesty in right of Canada by that individual or\nmake a payment owing to that individual by Her\nMajesty in right of Canada; and\n(m) for any purpose where, in the opinion of the head\nof the institution,\n(i) the public interest in disclosure clearly outweighs any invasion of privacy that could result\nfrom the disclosure, or\n(ii) disclosure would clearly benefit the individual\nto whom the information relates.\nPersonal information disclosed by Library and\nArchives of Canada\nSubject to any other Act of Parliament, personal in-\n(3)\nformation under the custody or control of the Library\nand Archives of Canada that has been transferred there\nby a government institution for historical or archival\nCurrent to December 10, 2025 8\nLast amended on June 2, 2025\n\nPrivacy\nProtection of Personal Information\nSection 8\npurposes may be disclosed in accordance with the regulations to any person or body for research or statistical\npurposes.\nCopies of requests under paragraph (2)(e) to be\nretained\n(4) The head of a government institution shall retain a\ncopy of every request received by the government institution under paragraph (2)(e) for such period of time as\nmay be prescribed by regulation, shall keep a record of\nany information disclosed pursuant to the request for\nsuch period of time as may be prescribed by regulation\nand shall, on the request of the Privacy Commissioner,\nmake those copies and records available to the Privacy\nCommissioner.\nNotice of disclosure under paragraph (2)(m)\n(5) The head of a government institution shall notify the\nPrivacy Commissioner in writing of any disclosure of personal information under paragraph (2)(m) prior to the\ndisclosure where reasonably practicable or in any other\ncase forthwith on the disclosure, and the Privacy Commissioner may, if the Commissioner deems it appropriate, notify the individual to whom the information relates\nof the disclosure.\nDefinition of Indian band\n(6) In paragraph (2)(k), Indian band means\n(a) a band, as defined in the Indian Act;\nthe band, as defined in subsection 2(1) of the\n(b)\nNaskapi and the Cree-Naskapi Commission Act;\nthe Nation, as defined in subsection 2(1)\n(c) shíshálh\nof the shíshálh Nation Self-Government Act; or\n(d) a first nation named in Schedule II to the Yukon\nFirst Nations Self-Government Act.\nDefinition of aboriginal government\n(7) The expression aboriginal government in paragraph (2)(k) means\n(a) Nisga’a Government, as defined in the Nisga’a Final Agreement given effect by the Nisga’a Final\nAgreement Act;\n(b) the council of the Westbank First Nation;\n(c) the Tlicho Government, as defined in section 2 of\nthe Tlicho Land Claims and Self-Government Act;\nCurrent to December 10, 2025 9\nLast amended on June 2, 2025\n\nPrivacy\nProtection of Personal Information\nSection 8\n(d) the Nunatsiavut Government, as defined in section\n2 of the Labrador Inuit Land Claims Agreement Act;\n(e) the council of a participating First Nation as defined in subsection 2(1) of the First Nations Jurisdiction over Education in British Columbia Act;\n(e.1) the Tla’amin Government, as defined in subsection 2(2) of the Tla’amin Final Agreement Act;\n(f) the Tsawwassen Government, as defined in subsection 2(2) of the Tsawwassen First Nation Final\nAgreement Act;\n(f.1) the Cree Nation Government, as defined in\nsubsection 2(1) of the Cree Nation of Eeyou Istchee\nGovernance Agreement Act or a Cree First Nation, as\ndefined in subsection 2(2) of that Act;\n(g) a Maanulth Government, within the meaning of\nsubsection 2(2) of the Maanulth First Nations Final\nAgreement Act;\n(h) Sioux Valley Dakota Oyate Government, within\nthe meaning of subsection 2(2) of the Sioux Valley\nDakota Nation Governance Act;\n(h.1) the Whitecap Dakota Government, as defined\nin section 2 of the Self-Government Treaty Recognizing the Whitecap Dakota Nation / Wapaha Ska\nDakota Oyate Act;\nthe council of a as de-\n(i) participating First Nation\nfined in section 2 of the Anishinabek Nation Education Agreement Act; or\na or the\n(j) First Nation Government Anishinabek\n2\nNation Government, as defined in section of the\nAnishinabek Nation Governance Agreement Act, or\nan Anishinaabe Institution, within the meaning of section 1.1 of the Agreement, as defined in section 2 of\nthat Act.\nDefinition of council of the Westbank First Nation\nThe expression\n(8) council of the Westbank First Nain paragraphs (2)(f) and (7)(b) means the council, as\ntion\nCurrent to December 10, 2025 10\nLast amended on June 2, 2025\n\nPrivacy\nProtection of Personal Information\nSections 8-9\ndefined in the Westbank First Nation Self-Government\nAgreement given effect by the Westbank First Nation\nSelf-Government Act.\nR.S., 1985, c. P-21, s. 8; R.S., 1985, c. 20 (2nd Supp.), s. 13, c. 1 (3rd Supp.), s. 12; 1994,\nc. 35, s. 39; 2000, c. 7, s. 26; 2004, c. 11, s. 37, c. 17, s. 18; 2005, c. 1, ss. 106, 109, c. 27,\nss. 21, 25; 2006, c. 10, s. 33; 2008, c. 32, s. 30; 2009, c. 18, s. 23; 2014, c. 1, s. 19, c. 11, s.\n24; 2017, c. 32, s. 18; 2018, c. 4, s. 132; 2022, c. 9, s. 4; 2022, c. 9, s. 45; 2023, c. 22, s. 20.\nRecord of disclosures to be retained\n9 (1) The head of a government institution shall retain a\nrecord of any use by the institution of personal information contained in a personal information bank or any use\nor purpose for which that information is disclosed by the\ninstitution where the use or purpose is not included in\nthe statements of uses and purposes set forth pursuant to\nsubparagraph 11(1)(a)(iv) and subsection 11(2) in the index referred to in section 11, and shall attach the record\nto the personal information.\nLimitation\n(2) Subsection (1) does not apply in respect of information disclosed pursuant to paragraph 8(2)(e).\nRecord forms part of personal information\n(3) For the purposes of this Act, a record retained under\nsubsection (1) shall be deemed to form part of the personal information to which it is attached.\nConsistent uses\nWhere personal information in a personal informa-\n(4)\ntion bank under the control of a government institution\nis used or disclosed for a use consistent with the purpose\nfor which the information was obtained or compiled by\nthe institution but the use is not included in the statement of consistent uses set forth pursuant to subparagraph 11(1)(a)(iv) in the index referred to in section 11,\nthe head of the government institution shall\nforthwith notify the Privacy Commissioner of the\n(a)\nuse for which the information was used or disclosed;\nand\nensure that the use is included in the next state-\n(b)\nment of consistent uses set forth in the index.\n1980-81-82-83, c. 111, Sch. II “9”; 1984, c. 21, s. 89.\nCurrent to December 10, 2025 11\nLast amended on June 2, 2025\n\nPrivacy\nPersonal Information Banks\nSections 10-11\nPersonal Information Banks\nPersonal information to be included in personal\ninformation banks\n10 (1) The head of a government institution shall cause\nto be included in personal information banks all personal\ninformation under the control of the government institution that\n(a) has been used, is being used or is available for use\nfor an administrative purpose; or\n(b) is organized or intended to be retrieved by the\nname of an individual or by an identifying number,\nsymbol or other particular assigned to an individual.\nException for Library and Archives of Canada\n(2) Subsection (1) does not apply in respect of personal\ninformation under the custody or control of the Library\nand Archives of Canada that has been transferred there\nby a government institution for historical or archival purposes.\nR.S., 1985, c. P-21, s. 10; R.S., 1985, c. 1 (3rd Supp.), s. 12; 2004, c. 11, s. 38.\nPersonal Information Index\nIndex of personal information\nThe designated Minister shall cause to be pub-\n11 (1)\nlished on a periodic basis not less frequently than once\neach year, an index of\n(a) all personal information banks setting forth, in respect of each bank,\n(i) the identification and a description of the bank,\nthe registration number assigned to it by the designated Minister pursuant to paragraph 71(1)(b) and\na description of the class of individuals to whom\npersonal information contained in the bank relates,\n(ii) the name of the government institution that has\ncontrol of the bank,\n(iii) the title and address of the appropriate officer\nto whom requests relating to personal information\ncontained in the bank should be sent,\n(iv) a statement of the purposes for which personal\ninformation in the bank was obtained or compiled\nand a statement of the uses consistent with those\nCurrent to December 10, 2025 12\nLast amended on June 2, 2025\n\nPrivacy\nPersonal Information Index\nSection 11\npurposes for which the information is used or disclosed,\n(v) a statement of the retention and disposal standards applied to personal information in the bank,\nand\n(vi) an indication, where applicable, that the bank\nwas designated as an exempt bank by an order under section 18 and the provision of section 21 or 22\non the basis of which the order was made; and\n(b) all classes of personal information under the control of a government institution that are not contained\nin personal information banks, setting forth in respect\nof each class\na description of the class in sufficient detail to\n(i)\nfacilitate the right of access under this Act, and\nthe title and address of the appropriate officer\n(ii)\nfor each government institution to whom requests\nrelating to personal information within the class\nshould be sent.\nStatement of uses and purposes\n(2) The designated Minister may set forth in the index\nreferred to in subsection (1) a statement of any of the uses and purposes, not included in the statements made\npursuant to subparagraph (1)(a)(iv), for which personal\ninformation contained in any of the personal information\nbanks referred to in the index is used or disclosed on a\nregular basis.\nIndex to be made available\n(3) The designated Minister shall cause the index referred to in subsection (1) to be made available throughout Canada in conformity with the principle that every\nperson is entitled to reasonable access to the index.\n1980-81-82-83, c. 111, Sch. II “11”.\nCurrent to December 10, 2025 13\nLast amended on June 2, 2025\n\nPrivacy\nAccess to Personal Information\nSection 12\nAccess to Personal Information\nRight of Access\nRight of access\nSubject to this Act, every individual who is a\n12 (1)\nCanadian citizen or a permanent resident within the\nmeaning of subsection 2(1) of the Immigration and\nRefugee Protection Act has a right to and shall, on\nrequest, be given access to\n(a) any personal information about the individual\ncontained in a personal information bank; and\n(b) any other personal information about the individual under the control of a government institution with\nrespect to which the individual is able to provide sufficiently specific information on the location of the information as to render it reasonably retrievable by the\ngovernment institution.\nOther rights relating to personal information\n(2) Every individual who is given access under paragraph\n(1)(a) to personal information that has been used, is being used or is available for use for an administrative purpose is entitled to\n(a) request correction of the personal information\nwhere the individual believes there is an error or omission therein;\n(b) require that a notation be attached to the information reflecting any correction requested but not made;\nand\nrequire that any person or body to whom that in-\n(c)\nformation has been disclosed for use for an administrative purpose within two years prior to the time a\ncorrection is requested or a notation is required under\nthis subsection in respect of that information\n(i) be notified of the correction or notation, and\n(ii) where the disclosure is to a government institution, the institution make the correction or notation\non any copy of the information under its control.\nCurrent to December 10, 2025 14\nLast amended on June 2, 2025\n\nPrivacy\nAccess to Personal Information\nRight of Access\nSections 12-15\nExtension of right of access by order\nThe Governor in Council may, by order, extend the\n(3)\nright to be given access to personal information under\nsubsection (1) to include individuals not referred to in\nthat subsection and may set such conditions as the\nGovernor in Council deems appropriate.\nR.S., 1985, c. P-21, s. 12; 2001, c. 27, s. 269.\nRequests for Access\nRequest for access under paragraph 12(1)(a)\n13 (1) A request for access to personal information under paragraph 12(1)(a) shall be made in writing to the\ngovernment institution that has control of the personal\ninformation bank that contains the information and shall\nidentify the bank.\nRequest for access under 12(1)(b)\nA request for access to personal information under\n(2)\nparagraph 12(1)(b) shall be made in writing to the government institution that has control of the information\nand shall provide sufficiently specific information on the\nlocation of the information as to render it reasonably retrievable by the government institution.\n1980-81-82-83, c. 111, Sch. II “13”.\nNotice where access requested\n14 Where access to personal information is requested\nunder subsection 12(1), the head of the government institution to which the request is made shall, subject to section 15, within thirty days after the request is received,\n(a) give written notice to the individual who made the\nrequest as to whether or not access to the information\nor a part thereof will be given; and\nif access is to be given, give the individual who\n(b)\nmade the request access to the information or the part\nthereof.\n1980-81-82-83, c. 111, Sch. II “14”.\nExtension of time limits\nThe head of a government institution may extend the\n15\ntime limit set out in section 14 in respect of a request for\na maximum of thirty days if\n(a)\n(i) meeting the original time limit would unreasonably interfere with the operations of the government institution, or\n(ii) consultations are necessary to comply with the\nrequest that cannot reasonably be completed within\nthe original time limit, or\nCurrent to December 10, 2025 15\nLast amended on June 2, 2025\n\nPrivacy\nAccess to Personal Information\nRequests for Access\nSections 15-17\n(b) such period of time as is reasonable, if additional\ntime is necessary for translation purposes or for the\npurposes of converting the personal information into\nan alternative format,\nby giving notice of the extension and the length of the extension to the individual who made the request within\nthirty days after the request is received, which notice\nshall contain a statement that the individual has a right\nto make a complaint to the Privacy Commissioner about\nthe extension.\nR.S., 1985, c. P-21, s. 15; 1992, c. 21, s. 35.\nWhere access is refused\n16 (1) Where the head of a government institution refuses to give access to any personal information requested under subsection 12(1), the head of the institution\nshall state in the notice given under paragraph 14(a)\nthat the personal information does not exist, or\n(a)\nthe specific provision of this Act on which the re-\n(b)\nfusal was based or the provision on which a refusal\ncould reasonably be expected to be based if the information existed,\nand shall state in the notice that the individual who made\nthe request has a right to make a complaint to the Privacy\nCommissioner about the refusal.\nExistence not required to be disclosed\n(2) The head of a government institution may but is not\nrequired to indicate under subsection (1) whether personal information exists.\nDeemed refusal to give access\n(3) Where the head of a government institution fails to\ngive access to any personal information requested under\nsubsection 12(1) within the time limits set out in this Act,\nthe head of the institution shall, for the purposes of this\nAct, be deemed to have refused to give access.\n1980-81-82-83, c. 111, Sch. II “16”.\nAccess\nForm of access\n17 (1) Subject to any regulations made under paragraph\n77(1)(o), where an individual is to be given access to personal information requested under subsection 12(1), the\ngovernment institution shall\n(a) permit the individual to examine the information\nin accordance with the regulations; or\n(b) provide the individual with a copy thereof.\nCurrent to December 10, 2025 16\nLast amended on June 2, 2025\n\nPrivacy\nAccess to Personal Information\nAccess\nSections 17-18\nLanguage of access\nWhere access to personal information is to be given\n(2)\nunder this Act and the individual to whom access is to be\ngiven requests that access be given in a particular one of\nthe official languages of Canada,\n(a) access shall be given in that language, if the personal information already exists under the control of a\ngovernment institution in that language; and\n(b) where the personal information does not exist in\nthat language, the head of the government institution\nthat has control of the personal information shall\ncause it to be translated or interpreted for the individual if the head of the institution considers a translation or interpretation to be necessary to enable the individual to understand the information.\nAccess to personal information in alternative format\n(3) Where access to personal information is to be given\nunder this Act and the individual to whom access is to be\ngiven has a sensory disability and requests that access be\ngiven in an alternative format, access shall be given in an\nalternative format if\nthe personal information already exists under the\n(a)\ncontrol of a government institution in an alternative\nformat that is acceptable to the individual; or\n(b) the head of the government institution that has\ncontrol of the personal information considers the giving of access in an alternative format to be necessary\nto enable the individual to exercise the individual’s\nright of access under this Act and considers it reasonable to cause the personal information to be converted.\nR.S., 1985, c. P-21, s. 17; 1992, c. 21, s. 36.\nExemptions\nExempt Banks\nGovernor in Council may designate exempt banks\n18 (1) The Governor in Council may, by order, designate as exempt banks certain personal information banks\nthat contain files all of which consist predominantly of\npersonal information described in section 21 or 22.\nDisclosure may be refused\n(2) The head of a government institution may refuse to\ndisclose any personal information requested under\nCurrent to December 10, 2025 17\nLast amended on June 2, 2025\n\nPrivacy\nExemptions\nExempt Banks\nSections 18-19\nsubsection 12(1) that is contained in a personal information bank designated as an exempt bank under subsection (1).\nContents of order\nAn order made under subsection (1) shall specify\n(3)\n(a) the section on the basis of which the order is\nmade; and\n(b) where a personal information bank is designated\nthat contains files that consist predominantly of personal information described in subparagraph\n22(1)(a)(ii), the law concerned.\n1980-81-82-83, c. 111, Sch. II “18”.\nResponsibilities of Government\nPersonal information obtained in confidence\n19 (1) Subject to subsection (2), the head of a government institution shall refuse to disclose any personal information requested under subsection 12(1) that was obtained in confidence from\n(a) the government of a foreign state or an institution\nthereof;\n(b) an international organization of states or an institution thereof;\n(c) the government of a province or an institution\nthereof;\n(d) a municipal or regional government established by\nor pursuant to an Act of the legislature of a province or\nan institution of such a government;\n(e) the council, as defined in the Westbank First Nation Self-Government Agreement given effect by the\nWestbank First Nation Self-Government Act;\n(e.1) the Whitecap Dakota Government, as defined\nin section 2 of the Self-Government Treaty Recognizing the Whitecap Dakota Nation / Wapaha Ska\nDakota Oyate Act;\nthe council of a participating First Nation as de-\n(f)\nfined in subsection 2(1) of the First Nations Jurisdiction over Education in British Columbia Act; or\na First Nation Government or the Anishinabek\n(g)\nNation Government, as defined in section 2 of the\nAnishinabek Nation Governance Agreement Act, or\nCurrent to December 10, 2025 18\nLast amended on June 2, 2025\n\nPrivacy\nExemptions\nResponsibilities of Government\nSections 19-22\nan Anishinaabe Institution, within the meaning of section 1.1 of the Agreement, as defined in section 2 of\nthat Act.\nWhere disclosure authorized\nThe head of a government institution may disclose\n(2)\nany personal information requested under subsection\n12(1) that was obtained from any government, organization or institution described in subsection (1) if the government, organization or institution from which the information was obtained\n(a) consents to the disclosure; or\n(b) makes the information public.\nR.S., 1985, c. P-21, s. 19; 2004, c. 17, s. 19; 2006, c. 10, s. 34; 2022, c. 9, s. 5; 2023, c. 22,\ns. 21.\nFederal-provincial affairs\n20 The head of a government institution may refuse to\ndisclose any personal information requested under subsection 12(1) the disclosure of which could reasonably be\nexpected to be injurious to the conduct by the Government of Canada of federal-provincial affairs.\n1980-81-82-83, c. 111, Sch. II “20”.\nInternational affairs and defence\n21 The head of a government institution may refuse to\ndisclose any personal information requested under subsection 12(1) the disclosure of which could reasonably be\nexpected to be injurious to the conduct of international\naffairs, the defence of Canada or any state allied or associated with Canada, as defined in subsection 15(2) of the\nAccess to Information Act, or the efforts of Canada toward detecting, preventing or suppressing subversive or\nhostile activities, as defined in subsection 15(2) of the Access to Information Act, including, without restricting\nthe generality of the foregoing, any such information listed in paragraphs 15(1)(a) to (i) of the Access to Information Act.\n1980-81-82-83, c. 111, Sch. II “21”.\nLaw enforcement and investigation\n22 (1) The head of a government institution may refuse\nto disclose any personal information requested under\nsubsection 12(1)\nthat was obtained or prepared by any government\n(a)\ninstitution, or part of any government institution, that\nis an investigative body specified in the regulations in\nthe course of lawful investigations pertaining to\nCurrent to December 10, 2025 19\nLast amended on June 2, 2025\n\nPrivacy\nExemptions\nResponsibilities of Government\nSection 22\n(i) the detection, prevention or suppression of\ncrime,\n(ii) the enforcement of any law of Canada or a\nprovince, or\n(iii) activities suspected of constituting threats to\nthe security of Canada within the meaning of the\nCanadian Security Intelligence Service Act,\nif the information came into existence less than twenty\nyears prior to the request;\n(b) the disclosure of which could reasonably be expected to be injurious to the enforcement of any law of\nCanada or a province or the conduct of lawful investigations, including, without restricting the generality of\nthe foregoing, any such information\nrelating to the existence or nature of a particular\n(i)\ninvestigation,\n(ii) that would reveal the identity of a confidential\nsource of information, or\n(iii) that was obtained or prepared in the course of\nan investigation; or\n(c) the disclosure of which could reasonably be expected to be injurious to the security of penal institutions.\nPolicing services for provinces or municipalities\n(2) The head of a government institution shall refuse to\ndisclose any personal information requested under subsection 12(1) that was obtained or prepared by the Royal\nCanadian Mounted Police while performing policing services for a province or municipality pursuant to an arrangement made under section 20 of the Royal Canadian\nMounted Police Act, where the Government of Canada\nhas, on the request of the province or municipality,\nagreed not to disclose such information.\nDefinition of investigation\n(3) For the purposes of paragraph (1)(b), investigation\nmeans an investigation that\npertains to the administration or enforcement of\n(a)\nan Act of Parliament;\nis authorized by or pursuant to an Act of Parlia-\n(b)\nment; or\nCurrent to December 10, 2025 20\nLast amended on June 2, 2025\n\nPrivacy\nExemptions\nResponsibilities of Government\nSections 22-22.4\n(c) is within a class of investigations specified in the\nregulations.\n1980-81-82-83, c. 111, Sch. II “22”; 1984, c. 21, s. 90, c. 40, s. 79(E).\nInformation obtained by Privacy Commissioner\n22.1 (1) The Privacy Commissioner shall refuse to disclose any personal information requested under this Act\nthat was obtained or created by the Commissioner or on\nthe Commissioner’s behalf in the course of an investigation conducted by, or under the authority of, the Commissioner or that was obtained by the Commissioner in\nthe course of a consultation with the Information Commissioner under subsection 36(1.1) or section 36.2 of the\nAccess to Information Act.\nException\n(2) However, the Commissioner shall not refuse under\nsubsection (1) to disclose any personal information that\nwas created by the Commissioner or on the Commissioner’s behalf in the course of an investigation conducted by,\nor under the authority of, the Commissioner once the investigation and all related proceedings, if any, are finally\nconcluded.\n2006, c. 9, s. 183; 2019, c. 18, s. 48.\nPublic Sector Integrity Commissioner\nThe Public Sector Integrity Commissioner shall\n22.2\nrefuse to disclose any personal information requested\nunder subsection 12(1) that was obtained or created by\nhim or her or on his or her behalf in the course of an investigation into a disclosure made under the Public Servants Disclosure Protection Act or an investigation com-\n33\nmenced under section of that Act.\n2005, c. 46, s. 58.\nPublic Servants Disclosure Protection Act\n22.3 The head of a government institution shall refuse\nto disclose personal information requested under subsection 12(1) that was created for the purpose of making a\ndisclosure under the Public Servants Disclosure Protection Act or in the course of an investigation into a disclosure under that Act.\n2005, c. 46, s. 58.\nSecretariat of National Security and Intelligence\nCommittee of Parliamentarians\n22.4 The Secretariat of the National Security and Intelligence Committee of Parliamentarians shall refuse to disclose personal information requested under subsection\n12(1) that was obtained or created by it or on its behalf in\nthe course of assisting the National Security and\nCurrent to December 10, 2025 21\nLast amended on June 2, 2025\n\nPrivacy\nExemptions\nResponsibilities of Government\nSections 22.4-25\nIntelligence Committee of Parliamentarians in fulfilling\nits mandate.\n2017, c. 15, s. 45.\nSecurity clearances\n23 The head of a government institution may refuse to\ndisclose any personal information requested under subsection 12(1) that was obtained or prepared by an investigative body specified in the regulations for the purpose\nof determining whether to grant security clearances\n(a) required by the Government of Canada or a government institution in respect of individuals employed\nby or performing services for the Government of\nCanada or a government institution, individuals employed by or performing services for a person or body\nperforming services for the Government of Canada or\na government institution, individuals seeking to be so\nemployed or seeking to perform those services, or\n(b) required by the government of a province or a foreign state or an institution thereof,\nif disclosure of the information could reasonably be expected to reveal the identity of the individual who furnished the investigative body with the information.\n1980-81-82-83, c. 111, Sch. II “23”.\nIndividuals sentenced for an offence\n24 The head of a government institution may refuse to\ndisclose any personal information requested under subsection 12(1) that was collected or obtained by the Correctional Service of Canada or the Parole Board of\nCanada while the individual who made the request was\nunder sentence for an offence against any Act of Parliament, if the disclosure could reasonably be expected to\n(a) lead to a serious disruption of the individual’s institutional, parole or statutory release program; or\n(b) reveal information about the individual originally\nobtained on a promise of confidentiality, express or\nimplied.\nR.S., 1985, c. P-21, s. 24; 1994, c. 26, s. 56; 2012, c. 1, s. 160.\nSafety of individuals\n25 The head of a government institution may refuse to\ndisclose any personal information requested under subsection 12(1) the disclosure of which could reasonably be\nexpected to threaten the safety of individuals.\n1980-81-82-83, c. 111, Sch. II “25”.\nCurrent to December 10, 2025 22\nLast amended on June 2, 2025\n\nPrivacy\nExemptions\nResponsibilities of Government\nSections 25-28\n"
}