{
  "title": "PRIVACY_ACT_INTERPRETATION",
  "all_text": "Interpretation\nDefinitions\n3 In this Act,\nadministrative purpose, in relation to the use of personal information about an individual, means the use of\nthat information in a decision making process that directly affects that individual; (fins administratives)\nalternative format, with respect to personal information, means a format that allows a person with a sensory\ndisability to read or listen to the personal information;\n(support substitution)\nde\nCourt means the Federal Court; (Cour)\nCurrent to December 10, 2025 1\nLast amended on June 2, 2025\n\nPrivacy\nInterpretation\nSection 3\ndesignated Minister means a person who is designated\nas the Minister under subsection 3.1(1); (ministre\ndésigné)\ngovernment institution means\n(a) any department or ministry of state of the Government of Canada, or any body or office, listed in the\nschedule, and\n(b) any parent Crown corporation, and any whollyowned subsidiary of such a corporation, within the\nmeaning of section 83 of the Financial Administration\nAct; (institution fédérale)\nhead, in respect of a government institution, means\n(a) in the case of a department or ministry of state,\nthe member of the Queen’s Privy Council for Canada\nwho presides over the department or ministry, or\n(b) in any other case, either the person designated under subsection 3.1(2) to be the head of the institution\nfor the purposes of this Act or, if no such person is\ndesignated, the chief executive officer of the institution, whatever their title; (responsable d’institution\nfédérale)\nmeans information about an\npersonal information\nidentifiable individual that is recorded in any form including, without restricting the generality of the foregoing,\n(a) information relating to the race, national or ethnic\norigin, colour, religion, age or marital status of the individual,\n(b) information relating to the education or the medical, criminal or employment history of the individual\nor information relating to financial transactions in\nwhich the individual has been involved,\n(c) any identifying number, symbol or other particular assigned to the individual,\n(d) the address, fingerprints or blood type of the individual,\n(e) the personal opinions or views of the individual\nexcept where they are about another individual or\nabout a proposal for a grant, an award or a prize to be\nmade to another individual by a government institution or a part of a government institution specified in\nthe regulations,\n(f) correspondence sent to a government institution\nby the individual that is implicitly or explicitly of a\nCurrent to December 10, 2025 2\nLast amended on June 2, 2025\n\nPrivacy\nInterpretation\nSection 3\nprivate or confidential nature, and replies to such correspondence that would reveal the contents of the\noriginal correspondence,\n(g) the views or opinions of another individual about\nthe individual,\n(h) the views or opinions of another individual about\na proposal for a grant, an award or a prize to be made\nto the individual by an institution or a part of an institution referred to in paragraph (e), but excluding the\nname of the other individual where it appears with the\nviews or opinions of the other individual, and\n(i) the name of the individual where it appears with\nother personal information relating to the individual\nor where the disclosure of the name itself would reveal\ninformation about the individual,\nbut, for the purposes of sections 7, 8 and 26 and section\n19 of the Access to Information Act, does not include\n(j) information about an individual who is or was an\nofficer or employee of a government institution that\nrelates to the position or functions of the individual including,\n(i) the fact that the individual is or was an officer or\nemployee of the government institution,\n(ii) the title, business address and telephone number of the individual,\n(iii) the classification, salary range and responsibilities of the position held by the individual,\n(iv) the name of the individual on a document prepared by the individual in the course of employment, and\n(v) the personal opinions or views of the individual\ngiven in the course of employment,\n(j.1) the fact that an individual is or was a ministerial\nadviser or a member of a ministerial staff, as those\nterms are defined in subsection 2(1) of the Conflict of\nInterest Act, as well as the individual’s name and title,\n(k) information about an individual who is or was performing services under contract for a government institution that relates to the services performed, including the terms of the contract, the name of the\nindividual and the opinions or views of the individual\ngiven in the course of the performance of those services,\nCurrent to December 10, 2025 3\nLast amended on June 2, 2025\n\nPrivacy\nInterpretation\nSections 3-3.1\n(l) information relating to any discretionary benefit of\na financial nature, including the granting of a licence\nor permit, conferred on an individual, including the\nname of the individual and the exact nature of the\nbenefit, and\n(m) information about an individual who has been\ndead for more than twenty years; (renseignements\npersonnels)\npersonal information bank means a collection or\ngrouping of personal information described in section 10;\n(fichier de renseignements personnels)\nPrivacy Commissioner means the Commissioner appointed under section 53; (Commissaire à la protection\nde la vie privée)\nsensory disability means a disability that relates to\nsight or hearing. (déficience sensorielle)\nR.S., 1985, c. P-21, s. 3; 1992, c. 1, s. 144(F), c. 21, s. 34; 2002, c. 8, s. 183; 2006, c. 9, s.\n181; 2019, c. 18, s. 47.\nFor greater certainty\n3.01 (1) For greater certainty, any provision of this Act\nthat applies to a government institution that is a parent\nCrown corporation applies to any of its wholly-owned\nsubsidiaries within the meaning of section 83 of the Financial Administration Act.\nFor greater certainty\n(2) For greater certainty, the Canadian Race Relations\nFoundation and the Public Sector Pension Investment\nBoard are parent Crown corporations for the purposes of\nthis Act.\n2006, c. 9, s. 182.\nApplication\n3.02 Paragraph (j.1) of the definition personal information in section 3 applies only to records created on or after the day on which that paragraph comes into force.\n2019, c. 18, s. 47.1.\n"
}