{
  "title": "PRIVACY_ACT_INVESTIGATIONS",
  "all_text": "Investigations\nNotice of intention to investigate\nBefore commencing an investigation of a complaint\n31\nunder this Act, the Privacy Commissioner shall notify the\nhead of the government institution concerned of the intention to carry out the investigation and shall inform the\nhead of the institution of the substance of the complaint.\n1980-81-82-83, c. 111, Sch. II “31”.\nRegulation of procedure\n32 Subject to this Act, the Privacy Commissioner may\ndetermine the procedure to be followed in the performance of any duty or function of the Commissioner under this Act.\n1980-81-82-83, c. 111, Sch. II “32”.\nInvestigations in private\n33 (1) Every investigation of a complaint under this Act\nby the Privacy Commissioner shall be conducted in private.\nRight to make representation\n(2) In the course of an investigation of a complaint under\nthis Act by the Privacy Commissioner, the person who\nmade the complaint and the head of the government institution concerned shall be given an opportunity to\nmake representations to the Commissioner, but no one is\nentitled as of right to be present during, to have access to\nCurrent to December 10, 2025 25\nLast amended on June 2, 2025\n\nPrivacy\nInvestigations\nSections 33-34\nor to comment on representations made to the Commissioner by any other person.\n1980-81-82-83, c. 111, Sch. II “33”.\nPowers of Privacy Commissioner in carrying out\ninvestigations\nThe Privacy Commissioner has, in relation to the\n34 (1)\ncarrying out of the investigation of any complaint under\nthis Act, power\nto summon and enforce the appearance of persons\n(a)\nbefore the Privacy Commissioner and compel them to\ngive oral or written evidence on oath and to produce\nsuch documents and things as the Commissioner\ndeems requisite to the full investigation and consideration of the complaint, in the same manner and to the\nsame extent as a superior court of record;\n(b) to administer oaths;\n(c) to receive and accept such evidence and other information, whether on oath or by affidavit or otherwise, as the Privacy Commissioner sees fit, whether or\nnot the evidence or information is or would be admissible in a court of law;\nto enter any premises occupied by any government\n(d)\ninstitution on satisfying any security requirements of\nthe institution relating to the premises;\n(e) to converse in private with any person in any\npremises entered pursuant to paragraph (d) and otherwise carry out therein such inquiries within the authority of the Privacy Commissioner under this Act as\nthe Commissioner sees fit; and\n(f) to examine or obtain copies of or extracts from\nbooks or other records found in any premises entered\npursuant to paragraph (d) containing any matter relevant to the investigation.\nAccess to information\n(2) Despite any other Act of Parliament, any privilege\nunder the law of evidence, solicitor-client privilege or the\nprofessional secrecy of advocates and notaries and litigation privilege, and subject to subsection (2.1), the Privacy\nCommissioner may, during the investigation of any complaint under this Act, examine any information recorded\nin any form under the control of a government institution, other than a confidence of the Queen’s Privy Council for Canada to which subsection 70(1) applies, and no\ninformation that the Commissioner may examine under\nthis subsection may be withheld from the Commissioner\non any grounds.\nCurrent to December 10, 2025 26\nLast amended on June 2, 2025\n\nPrivacy\nInvestigations\nSections 34-35\nProtected information — solicitors, advocates and\nnotaries\n(2.1) The Privacy Commissioner may examine information that is subject to solicitor-client privilege or the professional secrecy of advocates and notaries or to litigation\nprivilege only if the head of a government institution refuses to disclose the information under section 27.\nFor greater certainty\n(2.2) For greater certainty, the disclosure by the head of\na government institution to the Privacy Commissioner of\ninformation that is subject to solicitor-client privilege or\nthe professional secrecy of advocates and notaries or to\nlitigation privilege does not constitute a waiver of those\nprivileges or that professional secrecy.\nEvidence in other proceedings\n(3) Except in a prosecution of a person for an offence under section 131 of the Criminal Code (perjury) in respect\nof a statement made under this Act, in a prosecution for\nan offence under this Act or in a review before the Court\nunder this Act or an appeal therefrom, evidence given by\na person in proceedings under this Act and evidence of\nthe existence of the proceedings is inadmissible against\nthat person in a court or in any other proceedings.\nWitness fees\n(4) Any person summoned to appear before the Privacy\nCommissioner pursuant to this section is entitled in the\ndiscretion of the Commissioner to receive the like fees\nand allowances for so doing as if summoned to attend before the Federal Court.\nReturn of documents, etc.\n(5) Any document or thing produced pursuant to this\nsection by any person or government institution shall be\nreturned by the Privacy Commissioner within ten days\nafter a request is made to the Commissioner by that person or government institution, but nothing in this subsection precludes the Commissioner from again requiring\nits production in accordance with this section.\nR.S., 1985, c. P-21, s. 34; R.S., 1985, c. 27 (1st Supp.), s. 187; 2019, c. 18, s. 50.\nFindings and recommendations of Privacy\nCommissioner\nIf, on investigating a complaint under this Act in\n35 (1)\nrespect of personal information, the Privacy Commissioner finds that the complaint is well-founded, the Commissioner shall provide the head of the government institution that has control of the personal information with a\nreport containing\nCurrent to December 10, 2025 27\nLast amended on June 2, 2025\n\nPrivacy\nInvestigations\nSection 35\n(a) the findings of the investigation and any recommendations that the Commissioner considers appropriate; and\n(b) where appropriate, a request that, within a time\nspecified therein, notice be given to the Commissioner\nof any action taken or proposed to be taken to implement the recommendations contained in the report or\nreasons why no such action has been or is proposed to\nbe taken.\nReport to complainant\n(2) The Privacy Commissioner shall, after investigating a\ncomplaint under this Act, report to the complainant the\nresults of the investigation, but where a notice has been\nrequested under paragraph (1)(b) no report shall be\nmade under this subsection until the expiration of the\ntime within which the notice is to be given to the Commissioner.\nMatter to be included in report to complainant\nWhere a notice has been requested under paragraph\n(3)\n(1)(b) but no such notice is received by the Commissioner within the time specified therefor or the action described in the notice is, in the opinion of the Commissioner, inadequate or inappropriate or will not be taken\nin a reasonable time, the Commissioner shall so advise\nthe complainant in his report under subsection (2) and\nmay include in the report such comments on the matter\nas he thinks fit.\nAccess to be given\n(4) Where, pursuant to a request under paragraph (1)(b),\nthe head of a government institution gives notice to the\nPrivacy Commissioner that access to personal information will be given to a complainant, the head of the institution shall give the complainant access to the information forthwith on giving the notice.\nRight of review\n(5) Where, following the investigation of a complaint relating to a refusal to give access to personal information\nunder this Act, access is not given to the complainant, the\nPrivacy Commissioner shall inform the complainant that\nthe complainant has the right to apply to the Court for a\nreview of the matter investigated.\n1980-81-82-83, c. 111, Sch. II “35”.\nCurrent to December 10, 2025 28\nLast amended on June 2, 2025\n\nPrivacy\n"
}