{
  "title": "PRIVACY_ACT_PRIVACY_COMMISSIONER",
  "all_text": "Privacy Commissioner\nAppointment\n53 (1) The Governor in Council shall, by commission\nunder the Great Seal, appoint a Privacy Commissioner after consultation with the Leader of the Government in\nthe Senate or Government Representative in the Senate,\nthe Leader of the Opposition in the Senate, the Leader or\nFacilitator of every other recognized party or parliamentary group in the Senate and the leader of every recognized party in the House of Commons and approval of\nthe appointment by resolution of the Senate and House\nof Commons.\nTenure\n(2) Subject to this section, the Privacy Commissioner\nholds office during good behaviour for a term of seven\nyears, but may be removed for cause by the Governor in\nCouncil at any time on address of the Senate and House\nof Commons.\nFurther terms\n(3) The Privacy Commissioner, on the expiration of a\nfirst or any subsequent term of office, is eligible to be reappointed for a further term not exceeding seven years.\nInterim appointment\nIn the event of the absence or incapacity of the Priva-\n(4)\ncy Commissioner, or if that office is vacant, the Governor\nCurrent to December 10, 2025 35\nLast amended on June 2, 2025\n\nPrivacy\nOffice of the Privacy Commissioner\nPrivacy Commissioner\nSections 53-55\nin Council may appoint any qualified person to hold that\noffice in the interim for a term not exceeding six months,\nand that person shall, while holding office, be paid the\nsalary or other remuneration and expenses that may be\nfixed by the Governor in Council.\nR.S., 1985, c. P-21, s. 53; 2006, c. 9, s. 118; 2022, c. 10, s. 247.\nRank, powers and duties generally\n54 (1) The Privacy Commissioner shall rank as and have\nall the powers of a deputy head of a department, shall engage exclusively in the duties of the office of Privacy\nCommissioner under this Act or any other Act of Parliament and shall not hold any other office under Her\nMajesty for reward or engage in any other employment\nfor reward.\nSalary and expenses\nThe Privacy Commissioner shall be paid a salary\n(2)\nequal to the salary of a judge of the Federal Court, other\nthan the Chief Justice, and is entitled to be paid reasonable travel and living expenses incurred in the performance of duties under this Act or any other Act of Parliament.\nPension benefits\n(3) The provisions of the Public Service Superannuation\nAct, other than those relating to tenure of office, apply to\nthe Privacy Commissioner, except that a person appointed as Privacy Commissioner from outside the public service, as defined in the Public Service Superannuation\nAct, may, by notice in writing given to the President of\nthe Treasury Board not more than sixty days after the\ndate of appointment, elect to participate in the pension\nplan provided in the Diplomatic Service (Special) Superannuation Act, in which case the provisions of that Act,\nother than those relating to tenure of office, apply to the\nPrivacy Commissioner from the date of appointment and\nthe provisions of the Public Service Superannuation Act\ndo not apply.\nOther benefits\n(4) The Privacy Commissioner is deemed to be employed\nin the public service of Canada for the purposes of the\nGovernment Employees Compensation Act and any regulations made under section 9 of the Aeronautics Act.\nR.S., 1985, c. P-21, s. 54; 2002, c. 8, s. 160; 2003, c. 22, s. 225(E).\nInformation Commissioner may be appointed as\nPrivacy Commissioner\n55 (1) The Governor in Council may appoint as Privacy\nCommissioner under section 53 the Information Commissioner appointed under the Access to Information\nAct.\nCurrent to December 10, 2025 36\nLast amended on June 2, 2025\n\nPrivacy\nOffice of the Privacy Commissioner\nPrivacy Commissioner\nSections 55-57\nSalary\nIn the event that the Information Commissioner is\n(2)\nappointed in accordance with subsection (1) as Privacy\nCommissioner, the Privacy Commissioner shall, notwithstanding subsection 54(2), be paid the salary of the Information Commissioner but not the salary of the Privacy\nCommissioner.\n1980-81-82-83, c. 111, Sch. II “55”.\n"
}