{
  "title": "PRIVACY_ACT_REVIEW_BY_THE_FEDERAL_COURT",
  "all_text": "Review by the Federal Court\nReview by Federal Court where access refused\n41 Any individual who has been refused access to personal information requested under subsection 12(1) may,\nif a complaint has been made to the Privacy Commissioner in respect of the refusal, apply to the Court for a review\nof the matter within forty-five days after the time the results of an investigation of the complaint by the Privacy\nCommissioner are reported to the complainant under\nsubsection 35(2) or within such further time as the Court\nmay, either before or after the expiration of those fortyfive days, fix or allow.\n1980-81-82-83, c. 111, Sch. II “41”.\nPrivacy Commissioner may apply or appear\n42 The Privacy Commissioner may\nCurrent to December 10, 2025 31\nLast amended on June 2, 2025\n\nPrivacy\nReview by the Federal Court\nSections 42-46\n(a) apply to the Court, within the time limits prescribed by section 41, for a review of any refusal to disclose personal information requested under subsection 12(1) in respect of which an investigation has\nbeen carried out by the Privacy Commissioner, if the\nCommissioner has the consent of the individual who\nrequested access to the information;\n(b) appear before the Court on behalf of any individual who has applied for a review under section 41; or\nwith leave of the Court, appear as a party to any\n(c)\nreview applied for under section 41.\n1980-81-82-83, c. 111, Sch. II “42”.\nApplication respecting files in exempt banks\nIn the circumstances described in subsection 36(5),\n43\nthe Privacy Commissioner may apply to the Court for a\nreview of any file contained in a personal information\nbank designated as an exempt bank under section 18.\n1980-81-82-83, c. 111, Sch. II “43”.\nHearing in summary way\nAn application made under section 41, 42 or 43 shall\n44\nbe heard and determined in a summary way in accordance with any special rules made in respect of such applications pursuant to section 46 of the Federal Courts\nAct.\nR.S., 1985, c. P-21, s. 44; 2002, c. 8, s. 182.\nAccess to information\n45 Despite any other Act of Parliament, any privilege\nunder the law of evidence, solicitor-client privilege or the\nprofessional secrecy of advocates and notaries and litigation privilege, the Court may, in the course of any proceedings before it arising from an application under section 41, 42 or 43, examine any information recorded in\nany form under the control of a government institution,\nother than a confidence of the Queen’s Privy Council for\nCanada to which subsection 70(1) applies, and no information that the Court may examine under this section\nmay be withheld from the Court on any grounds.\nR.S., 1985, c. P-21, s. 45; 2019, c. 18, s. 51.\nCourt to take precautions against disclosing\n46 (1) In any proceedings before the Court arising from\nan application under section 41, 42 or 43, the Court shall\ntake every reasonable precaution, including, when appropriate, receiving representations ex parte and conducting\nhearings in camera, to avoid the disclosure by the Court\nor any person of\n(a) any information or other material that the head of\na government institution would be authorized to\nrefuse to disclose if it were requested under subsection\nCurrent to December 10, 2025 32\nLast amended on June 2, 2025\n\nPrivacy\nReview by the Federal Court\nSections 46-49\n12(1) or contained in a record requested under the Access to Information Act; or\n(b) any information as to whether personal information exists where the head of a government institution,\nin refusing to disclose the personal information under\nthis Act, does not indicate whether it exists.\nDisclosure of offence authorized\n(2) The Court may disclose to the appropriate authority\ninformation relating to the commission of an offence\nagainst a law of Canada or a province by a director, an officer or an employee of a government institution if, in the\nCourt’s opinion, there is evidence of such an offence.\nR.S., 1985, c. P-21, s. 46; 2006, c. 9, s. 184.\nBurden of proof\n47 In any proceedings before the Court arising from an\napplication under section 41, 42 or 43, the burden of establishing that the head of a government institution is\nauthorized to refuse to disclose personal information requested under subsection 12(1) or that a file should be included in a personal information bank designated as an\nexempt bank under section 18 shall be on the government institution concerned.\n1980-81-82-83, c. 111, Sch. II “47”.\nOrder of Court where no authorization to refuse\ndisclosure found\nWhere the head of a government institution refuses\n48\nto disclose personal information requested under subsection 12(1) on the basis of a provision of this Act not referred to in section 49, the Court shall, if it determines\nthat the head of the institution is not authorized under\nthis Act to refuse to disclose the personal information,\norder the head of the institution to disclose the personal\ninformation, subject to such conditions as the Court\ndeems appropriate, to the individual who requested access thereto, or shall make such other order as the Court\ndeems appropriate.\n1980-81-82-83, c. 111, Sch. II “48”.\nOrder of Court where reasonable grounds of injury\nnot found\n49 Where the head of a government institution refuses\nto disclose personal information requested under subsection 12(1) on the basis of section 20 or 21 or paragraph\n22(1)(b) or (c) or 24(a), the Court shall, if it determines\nthat the head of the institution did not have reasonable\ngrounds on which to refuse to disclose the personal information, order the head of the institution to disclose the\npersonal information, subject to such conditions as the\nCurrent to December 10, 2025 33\nLast amended on June 2, 2025\n\nPrivacy\nReview by the Federal Court\nSections 49-51\nCourt deems appropriate, to the individual who requested access thereto, or shall make such other order as the\nCourt deems appropriate.\n1980-81-82-83, c. 111, Sch. II “49”.\nOrder to remove file from exempt bank\n50 Where the Privacy Commissioner makes an application to the Court under section 43 for a review of a file\ncontained in a personal information bank designated as\nan exempt bank under section 18, the Court shall, if it determines\n(a) in the case of a file contained in the bank on the\nbasis of personal information described in paragraph\n22(1)(a) or subsection 22(2), that the file should not be\nincluded therein, or\nin the case of a file contained in the bank on the\n(b)\nbasis of personal information described in section 21\nor paragraph 22(1)(b) or (c), that reasonable grounds\ndo not exist on which to include the file in the bank,\norder the head of the government institution that has\ncontrol of the bank to remove the file from the bank or\nmake such other order as the Court deems appropriate.\n1980-81-82-83, c. 111, Sch. II “50”; 1984, c. 40, s. 60.\nActions relating to international affairs and defence\nAny application under section 41 or 42 relating to\n51 (1)\npersonal information that the head of a government institution has refused to disclose by reason of paragraph\n19(1)(a) or (b) or section 21, and any application under\nsection 43 in respect of a file contained in a personal information bank designated as an exempt bank under section 18 to contain files all of which consist predominantly\nof personal information described in section 21, shall be\nheard and determined by the Chief Justice of the Federal\nCourt or by any other judge of the Court that the Chief\nJustice may designate to hear the applications.\nSpecial rules for hearings\nAn application referred to in subsection (1) or an ap-\n(2)\npeal brought in respect of such application shall\nbe heard in camera; and\n(a)\n(b) on the request of the head of the government institution concerned, be heard and determined in the National Capital Region described in the schedule to the\nNational Capital Act.\nEx parte representations\n(3) During the hearing of an application referred to in\nsubsection (1) or an appeal brought in respect of such application, the head of the government institution concerned shall, on the request of the head of the institution,\nCurrent to December 10, 2025 34\nLast amended on June 2, 2025\n\nPrivacy\nReview by the Federal Court\nSections 51-53\nbe given the opportunity to make representations ex\nparte.\nR.S., 1985, c. P-21, s. 51; 2002, c. 8, s. 159.\nCosts\n52 (1) Subject to subsection (2), the costs of and incidental to all proceedings in the Court under this Act shall\nbe in the discretion of the Court and shall follow the\nevent unless the Court orders otherwise.\nIdem\nWhere the Court is of the opinion that an application\n(2)\nfor review under section 41 or 42 has raised an important\nnew principle in relation to this Act, the Court shall order\nthat costs be awarded to the applicant even if the applicant has not been successful in the result.\n1980-81-82-83, c. 111, Sch. II “52”.\nOffice of the Privacy\nCommissioner\n"
}