{
  "title": "PRIVACY_ACT_ASSISTANT_PRIVACY_COMMISSIONER",
  "all_text": "Assistant Privacy Commissioner\nAppointment of Assistant Privacy Commissioner\n56 (1) The Governor in Council may, on the recommendation of the Privacy Commissioner, appoint one or more\nAssistant Privacy Commissioners.\nTenure of office and removal of Assistant Privacy\nCommissioner\n(2) Subject to this section, an Assistant Privacy Commissioner holds office during good behaviour for a term not\nexceeding five years.\nFurther terms\n(3) An Assistant Privacy Commissioner, on the expiration of a first or any subsequent term of office, is eligible\nto be re-appointed for a further term not exceeding five\nyears.\n1980-81-82-83, c. 111, Sch. II “56”; 1984, c. 40, s. 79(E).\nDuties generally\n57 (1) An Assistant Privacy Commissioner shall engage\nexclusively in such duties or functions of the office of the\nPrivacy Commissioner under this Act or any other Act of\nParliament as are delegated by the Privacy Commissioner\nto that Assistant Privacy Commissioner and shall not\nhold any other office under Her Majesty for reward or\nengage in any other employment for reward.\nSalary and expenses\n(2) An Assistant Privacy Commissioner is entitled to be\npaid a salary to be fixed by the Governor in Council and\nsuch travel and living expenses incurred in the performance of duties under this Act or any other Act of Parliament as the Privacy Commissioner considers reasonable.\nCurrent to December 10, 2025 37\nLast amended on June 2, 2025\n\nPrivacy\nOffice of the Privacy Commissioner\nAssistant Privacy Commissioner\nSections 57-59\nPension benefits\nThe provisions of the Public Service Superannuation\n(3)\nAct, other than those relating to tenure of office, apply to\nan Assistant Privacy Commissioner.\nOther benefits\n(4) An Assistant Privacy Commissioner is deemed to be\nemployed in the public service of Canada for the purposes of the Government Employees Compensation Act and\nany regulations made under section 9 of the Aeronautics\nAct.\n1980-81-82-83, c. 111, Sch. II “57”.\n"
}