{
  "title": "PRIVACY_ACT_EXCLUSIONS",
  "all_text": "Exclusions\nAct does not apply to certain materials\n69 (1) This Act does not apply to\n(a) library or museum material preserved solely for\npublic reference or exhibition purposes; or\n(b) material placed in the Library and Archives of\nCanada, the National Gallery of Canada, the Canadian\nMuseum of History, the Canadian Museum of Nature,\nthe National Museum of Science and Technology, the\nCanadian Museum for Human Rights or the Canadian\nMuseum of Immigration at Pier 21 by or on behalf of\npersons or organizations other than government institutions.\nSections 7 and 8 do not apply to certain information\n(2) Sections 7 and 8 do not apply to personal information\nthat is publicly available.\nR.S., 1985, c. P-21, s. 69; R.S., 1985, c. 1 (3rd Supp.), s. 12; 1990, c. 3, s. 32; 1992, c. 1, s.\n143(E); 2004, c. 11, s. 39; 2008, c. 9, s. 10; 2010, c. 7, s. 9; 2013, c. 38, s. 18.\nCanadian Broadcasting Corporation\nThis Act does not apply to personal information\n69.1\nthat the Canadian Broadcasting Corporation collects, uses or discloses for journalistic, artistic or literary purposes and does not collect, use or disclose for any other purpose.\n2006, c. 9, s. 188.\nConfidences of the Queen’s Privy Council for Canada\nThis Act does not apply to confidences of the\n70 (1)\nQueen’s Privy Council for Canada, including, without restricting the generality of the foregoing, any information\ncontained in\n(a) memoranda the purpose of which is to present\nproposals or recommendations to Council;\nCurrent to December 10, 2025 43\nLast amended on June 2, 2025\n\nPrivacy\nExclusions\nSections 70-70.1\n(b) discussion papers the purpose of which is to\npresent background explanations, analyses of problems or policy options to Council for consideration by\nCouncil in making decisions;\n(c) agenda of Council or records recording deliberations or decisions of Council;\n(d) records used for or reflecting communications or\ndiscussions between ministers of the Crown on matters relating to the making of government decisions or\nthe formulation of government policy;\nrecords the purpose of which is to brief ministers\n(e)\nof the Crown in relation to matters that are before, or\nare proposed to be brought before, Council or that are\nthe subject of communications or discussions referred\nto in paragraph (d); and\n(f) draft legislation.\nDefinition of Council\n(2) For the purposes of subsection (1), Council means\nthe Queen’s Privy Council for Canada, committees of the\nQueen’s Privy Council for Canada, Cabinet and committees of Cabinet.\nException\n(3) Subsection (1) does not apply to\nconfidences of the Queen’s Privy Council for\n(a)\nCanada that have been in existence for more than\ntwenty years; or\n(b) discussion papers described in paragraph (1)(b)\nif the decisions to which the discussion papers\n(i)\nrelate have been made public, or\nwhere the decisions have not been made public,\n(ii)\nif four years have passed since the decisions were\nmade.\nR.S., 1985, c. P-21, s. 70; 1992, c. 1, s. 144(F).\nCertificate under Canada Evidence Act\nIf a certificate under section 38.13 or 38.41 of\n70.1 (1)\nthe Canada Evidence Act prohibiting the disclosure of\npersonal information of a specific individual is issued before a complaint is filed by that individual under this Act\nin respect of a request for access to that information, the\nprovisions of this Act respecting that individual’s right of\naccess to their personal information do not apply to the\ninformation that is subject to the certificate.\nCurrent to December 10, 2025 44\nLast amended on June 2, 2025\n\nPrivacy\nExclusions\nSections 70.1-71\nCertificate following filing of complaint\nDespite any other provision of this Act, if a certificate\n(2)\nunder section 38.13 or 38.41 of the Canada Evidence Act\nprohibiting the disclosure of personal information of a\nspecific individual is issued in respect of personal information after the filing of a complaint under this Act in relation to a request for access to that information,\n(a) all proceedings under this Act in respect of that information, including an investigation, audit, appeal or\njudicial review, are discontinued;\n(b) the Privacy Commissioner shall not disclose the\ninformation and shall take all necessary precautions to\nprevent its disclosure; and\n(c) the Privacy Commissioner shall, within 10 days after the certificate is published in the Canada Gazette,\nreturn the information to the head of the government\ninstitution that controls the information.\nInformation not to be disclosed\nThe Privacy Commissioner and every person acting\n(3)\non behalf or under the direction of the Privacy Commissioner, in carrying out their functions under this Act,\nshall not disclose information subject to a certificate issued under section 38.13 or 38.41 of the Canada Evidence\nAct and shall take every reasonable precaution to avoid\nthe disclosure of that information.\nLimited power of delegation\n(4) The Privacy Commissioner may not, nor may an Assistant Privacy Commissioner, delegate the investigation\nof any complaint respecting information subject to a certificate issued under section 38.13 or 38.41 of the Canada\nEvidence Act except to one of a maximum of four officers\nor employees of the Commissioner specifically designated by the Commissioner for the purpose of conducting\nthat investigation.\n2001, c. 41, s. 104; 2024, c. 16, s. 92.\nGeneral\nDuties and functions of designated Minister\n71 (1) Subject to subsection (2), the designated Minister\nshall\n(a) cause to be kept under review the manner in which\npersonal information banks are maintained and managed to ensure compliance with the provisions of this\nCurrent to December 10, 2025 45\nLast amended on June 2, 2025\n\nPrivacy\nGeneral\nSection 71\nAct and the regulations relating to access by individuals to personal information contained therein;\n(b) assign or cause to be assigned a registration number to each personal information bank;\n(c) prescribe such forms as may be required for the\noperation of this Act and the regulations;\n(d) cause to be prepared and distributed to government institutions directives and guidelines concerning\nthe operation of this Act and the regulations; and\n(e) prescribe the form of, and what information is to\nbe included in, reports made to Parliament under section 72.\nException for Bank of Canada\nAnything that is required to be done by the designat-\n(2)\ned Minister under paragraph (1)(a) or (d) shall be done\nin respect of the Bank of Canada by the Governor of the\nBank of Canada.\nReview of existing and proposed personal information\nbanks\n(3) Subject to subsection (5), the designated Minister\nshall cause to be kept under review the utilization of existing personal information banks and proposals for the\ncreation of new banks, and shall make such recommendations as he considers appropriate to the heads of the\nappropriate government institutions with regard to personal information banks that, in the opinion of the designated Minister, are under-utilized or the existence of\nwhich can be terminated.\nEstablishment and modification of personal\ninformation banks\n(4) Subject to subsection (5), no new personal information bank shall be established and no existing personal\ninformation banks shall be substantially modified without approval of the designated Minister or otherwise\nthan in accordance with any term or condition on which\nsuch approval is given.\nApplication of subsections (3) and (4)\n(5) Subsections (3) and (4) apply only in respect of personal information banks under the control of government institutions that are departments as defined in section 2 of the Financial Administration Act.\nCurrent to December 10, 2025 46\nLast amended on June 2, 2025\n\nPrivacy\nGeneral\nSections 71-73\nDelegation to head of government institution\nThe designated Minister may authorize the head of a\n(6)\ngovernment institution to exercise and perform, in such\nmanner and subject to such terms and conditions as the\ndesignated Minister directs, any of the powers, functions\nand duties of the designated Minister under subsection\n(3) or (4).\n1980-81-82-83, c. 111, Sch. II “71”.\nDesignated Minister’s power\n71.1 The designated Minister may provide services with\nrespect to the administration of this Act to the public and\nto any government institution.\n2019, c. 18, s. 54.\nAnnual report — government institutions\n72 (1) Every year the head of every government institution shall prepare a report on the administration of this\nAct within the institution during the period beginning on\nApril 1 of the preceding year and ending on March 31 of\nthe current year.\nTabling of report\nEvery report prepared under subsection (1) shall be\n(2)\nlaid before each House of Parliament on any of the first\n15 days on which that House is sitting after September 1\nof the year in which the report is prepared.\nReference to Parliamentary committee\n(3) Every report prepared under subsection (1) shall, after it is laid before the Senate and the House of Commons, under subsection (2), be referred to the committee\ndesignated or established by Parliament for the purpose\nof subsection 75(1).\nCopy of report to designated Minister\n(4) The head of every government institution shall provide a copy of the report to the designated Minister immediately after it is laid before both Houses.\nR.S., 1985, c. P-21, s. 72; 2019, c. 18, s. 55.\nDelegation by head of government institution\nThe head of a government institution may, by or-\n73 (1)\nder, delegate any of their powers, duties or functions under this Act to one or more officers or employees of that\ninstitution.\nCurrent to December 10, 2025 47\nLast amended on June 2, 2025\n\nPrivacy\nGeneral\nSections 73-73.1\nDelegation to officers or employees of other\ngovernment institution\n(2) The head of a government institution may, for the\npurposes of subsection 73.1(1), by order, delegate any of\ntheir powers, duties or functions under this Act to one or\nmore officers or employees of another government institution.\nR.S., 1985, c. P-21, s. 73; 2019, c. 18, s. 56.\nProvision of services related to privacy\n73.1 (1) A government institution may provide services\nrelated to any power, duty or function conferred or imposed on the head of a government institution under this\nAct to another government institution that is presided\nover by the same Minister or that is under the responsibility of the same Minister and may receive such services\nfrom any other such government institution.\nWritten agreement\n(2) A government institution may provide services under\nsubsection (1) to another government institution only if it\nenters into an agreement in writing with the other government institution in respect of those services before it\nprovides the services.\nNotice\n(3) The head of a government institution that receives\nthe services shall provide a copy of the agreement to the\nPrivacy Commissioner and the designated Minister as\nsoon as possible after the agreement is entered into. The\nhead of the institution shall also notify the Commissioner\nand the designated Minister of any material change to\nthat agreement.\nFees\n(4) The head of a government institution that provides\nthe services may charge a fee for those services. The fee is\nnot to exceed the cost of providing the service.\nSpending authority\n(5) The head of the institution that charges the fee may\nspend the revenues that are received from the provision\nof the services for any purpose of that institution. If the\nhead of the institution spends the revenues, he or she\nmust do so in the fiscal year in which they are received\nor, unless an appropriation Act provides otherwise, in the\nnext fiscal year.\n2019, c. 18, s. 56.\nCurrent to December 10, 2025 48\nLast amended on June 2, 2025\n\nPrivacy\nGeneral\nSections 73.2-77\nPersonal information not under control of institution\n73.2 The personal information that the head of a government institution provides to the head of another government institution for the purpose of the other institution providing the services referred to in subsection\n73.1(1) is not under the control of that other institution.\n2019, c. 18, s. 56.\nProtection from civil proceeding or from prosecution\n74 Notwithstanding any other Act of Parliament, no civil\nor criminal proceedings lie against the head of any government institution, or against any person acting on behalf or under the direction of the head of a government\ninstitution, and no proceedings lie against the Crown or\nany government institution, for the disclosure in good\nfaith of any personal information pursuant to this Act, for\nany consequences that flow from that disclosure, or for\nthe failure to give any notice required under this Act if\nreasonable care is taken to give the required notice.\n1980-81-82-83, c. 111, Sch. II “74”.\nPermanent review of this Act by Parliamentary\ncommittee\n75 (1) The administration of this Act shall be reviewed\non a permanent basis by such committee of the House of\nCommons, of the Senate or of both Houses of Parliament\nas may be designated or established by Parliament for\nthat purpose.\nReview and report to Parliament\n(2) The committee designated or established by Parliament for the purpose of subsection (1) shall, not later\nthan July 1, 1986, undertake a comprehensive review of\nthe provisions and operation of this Act, and shall, within\na year after the review is undertaken or within such further time as the House of Commons may authorize, submit a report to Parliament thereon including a statement\nof any changes the committee would recommend.\n1980-81-82-83, c. 111, Sch. II “75”.\nBinding on Crown\n76 This Act is binding on Her Majesty in right of\nCanada.\n1980-81-82-83, c. 111, Sch. II “76”.\nRegulations\nThe Governor in Council may make regulations\n77 (1)\nCurrent to December 10, 2025 49\nLast amended on June 2, 2025\n\nPrivacy\nGeneral\nSection 77\n(a) specifying government institutions or parts of government institutions for the purpose of paragraph (e)\nof the definition personal information in section 3;\n(b) prescribing the period of time for which any class\nof personal information is to be retained under subsection 6(1);\n(c) prescribing the circumstances and the manner in\nwhich personal information under the control of a\ngovernment institution is to be disposed of under subsection 6(3);\n(d) specifying investigative bodies for the purposes of\nparagraph 8(2)(e) and sections 22 and 23;\n(e) prescribing the circumstances in which and the\nconditions under which personal information may be\ndisclosed under subsection 8(3);\n(f) prescribing the period of time for which copies of\nrequests received under paragraph 8(2)(e) and records\nof information disclosed pursuant to the requests are\nto be retained under subsection 8(4);\nspecifying persons or bodies for the purpose of\n(g)\nparagraph 8(2)(h);\nprescribing procedures to be followed in making\n(h)\nand responding to a request for access to personal information under paragraph 12(1)(a) or (b);\n(i) prescribing procedures to be followed by an individual or a government institution where the individual requests under subsection 12(2) a correction of personal information or a notation of a correction\nrequested, including the period of time within which\nthe correction or notation must be made;\n(j) prescribing any fees, or the manner of calculating\nany fees, to be paid for being given access to personal\ninformation requested under subsection 12(1) or for\nthe making of copies of such personal information;\nprescribing the procedures to be followed by the\n(k)\nPrivacy Commissioner and any person acting on behalf or under the direction of the Privacy Commissioner in examining or obtaining copies of records relevant\nto an investigation of a complaint in respect of a refusal to disclose personal information under paragraph 19(1)(a) or (b) or section 21;\n(l) specifying classes of investigations for the purpose\nof paragraph 22(3)(c);\n(m) prescribing the class of individuals who may act\non behalf of minors, incompetents, deceased persons\nCurrent to December 10, 2025 50\nLast amended on June 2, 2025\n\nPrivacy\nGeneral\nSection 77\nor any other individuals under this Act and regulating\nthe manner in which any rights or actions of individuals under this Act may be exercised or performed on\ntheir behalf;\n(n) authorizing the disclosure of information relating\nto the physical or mental health of individuals to duly\nqualified medical practitioners or psychologists in order to determine whether disclosure of the information would be contrary to the best interests of the individuals, and prescribing any procedures to be followed\nor restrictions deemed necessary with regard to the\ndisclosure and examination of the information; and\n(o) prescribing special procedures for giving individuals access under subsection 12(1) to personal information relating to their physical or mental health and\nregulating the way in which that access is given.\nAmendments to schedule\n(2) The Governor in Council may, by order,\n(a) add to the schedule the name of any department,\nministry of state, body or office of the Government of\nCanada;\n(b) replace in the schedule the former name of any department, ministry of state, body or office of the Government of Canada with its new name; and\n(c) delete from the schedule the name of any department, ministry of state, body or office of the Government of Canada that has ceased to exist or has become\npart of another department, ministry of state, body or\noffice of the Government of Canada.\nR.S., 1985, c. P-21, s. 77; 2019, c. 18, s. 57.\nCurrent to December 10, 2025 51\nLast amended on June 2, 2025\n\nPrivacy\n"
}